[
  {
    "id": 1060444,
    "title": "Changes to roster status logic on Trades",
    "section_id": 126279,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145144613",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n\n- If the player is a Major League Player, then when updating the player's Pending or Current roster status for a Trade or PTBNL (see stories #129462741, #129463383 and #129474671), use the updated logic\n\n- In-season:  \nActive and DFA roster statuses becomes Not Yet Reported\nAll other roster statuses including DL and IL should remain unchanged\nOptioned players continue  to have their pending MN roster status set to Null (until the Recall is created)\n\n- Off-season: \n Active and DFA become Active\nAll other roster statuses including DL and IL should remain unchanged\nOptioned players continue  to have their pending MN roster status set to Null (until the Recall is auto-created)",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060445,
    "title": "As a club, I want to know when a player has earned a contingency bonus",
    "section_id": 126280,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142358967",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**Wireframe**\nhttp://f2j41d.axshare.com/#p=bonus_payment_tracker\n\n**AC**\n\nGeneral Batch AC\n- This is calculated as a Nightly batch called \"Contingency Bonus batch\"\n- It can be run in Report and Update mode on demand via the Batches interface\n- It can also be run on an individual player ID\n- Results are returned with each player that the batch as marked as having earned the bonus (can be negotiated)\n- All other global batch requirements are consistent with other batches\n\nBatch Activity\n- Find all players who have a potential Contingency Bonus, or 'earned but not paid' Contingency bonus (date paid should not be entered)\n- For each player, verify if player has the required number of \"Active\" days at the respective level of play. Only active roster status counts and only service earned in the first year on the contract counts\n- If yes, then set the Payment due date of that player's bonus to the date that player will reach the required days. This should show on Payment tracker\n- If no, then verify if the player is selected under Rule 5 before the bonus becomes payable. In this case the bonus is due immediately by the club in the date when the contract was selected.\n- If the payment due date is set, then update the status of that payment to \"Earned, Not Paid\"\n- Contingency Bonuses may only be earned in the Contract Start Year. If it is past the start year, set the status of any Potential Con Bonuses to \"Cancelled\"\n- When viewing in the payment tracker, If a CON bonus is potential, and the player is traded, the Responsible Org for the bonus should be the new club of the player.\n- If the CON bonus is Expired, Earned, or Paid, the Org should be locked to the Org under which he earned it with",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060448,
    "title": "As a club, I want to revert a payment to unpaid on the tracker",
    "section_id": 126283,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145057799",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- Clubs can edit the payment tracker and blank out the paid date and Save. \n- On Save, the status of that bonus should revert to \"Earned, not paid\"\n\nOther Miscellaneous changes\n- The totals at the bottom of the tracker should show the total amounts of the filtered values. Changing the filters should update the total. Also change the label to \"Total\" instead of \"Total Due\"\n- Clubs can navigate to other club's payment tracker using the Org toggle. However, they should only have edit permissions to their own club\n- Change default filter to Status = earned not paid",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060449,
    "title": "As a club, I don't want to be stopped from trading a recently Signed FA unless he is on next subsequent contract",
    "section_id": 126284,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144478225",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- When checking Trades business rule 2.07 whether player is a recently signed XXB FA, also verify that player is currently on a Major league contract that is the next immediate contract signed since the XXB transaction. If player is not on his next subsequent MJ contract, then he should not be considered a XXB recently signed FA for the rule or condition check\n\nThis updated logic should impact the following places\n- Onsubmit rule 2.07 - #126263069\n- Front end rule 1.06 - #126081031\n- Onsubmit rule 2.16 - #126430817\n- Trade checklist item - #129475125",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060450,
    "title": "As a club, I want to see player ID on the International Signing Bonus utility export",
    "section_id": 126285,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143879471",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- Add a Player ID column to the Excel export of International Signing Bonus utilities\n- This column would appear to the left of the Player Name column\n\nSee INC0062757 for more details",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060451,
    "title": "As a club, I would like to see the mexican club that a player was outrighted from when signing a contract",
    "section_id": 126286,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144453295",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**Wire**\nhttp://f2j41d.axshare.com/#p=mexican_assignment_agreement\n\n**AC**\n- On the Mexican Assignment Agreement of a contract, add the \"From Club\" dropdown field\n- The field is defaulted to blank\n- The field should show a list of all current mexican league clubs\n- It is not required\n- It's editable to Clubs and BOC in any state that the rest of the mex aa can be edited\n- If populated, this club name should also appear in the player history entry for \"Outrighted from Mexican League\" under the \"From\" column.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060453,
    "title": "UAT feedback - If payment schedule is entered for trades, the \"Paid on\" field on main screen summary should show last date",
    "section_id": 126288,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146716669",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "https://jira.boc.mlb.com:8443/browse/EBISII-12334#comment-56856",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060454,
    "title": "As a club, I want to see a message on who I should contact when a contract isn't attached",
    "section_id": 126289,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143523507",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- If an MN contract is Approved, Expired or Terminated but missing a contract attachment, show the following text in the file attachment section.\n\"Executed Contract has not been attached. Please contact BOC Baseball Operations \"\n- If a Major League contract is Approved, Expired or Terminated but missing a contract attachment, show the following text in the file attachment section.\n\"Executed Contract has not been attached. Please contact BOC Labor Relations \"",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060455,
    "title": "As BOC, I want to know when the club hit Submit on a trade prior to running rule checks",
    "section_id": 126290,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145624027",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- For Trades and Waiver Claims (and potentially all other transactions if it's no extra work), capture the exact time at which the 2nd (or last) Approving Club user clicks \"Submit to BOC\" button even before running rule checks.\n- Add the field \"Submit Button Clicked\" to the Trades and Waiver Claim header that shows the time stamp. This field is visible to BOC users only.\n- This field should not overwrite the actual submission time of the transaction",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060456,
    "title": "As a club, I want to be stopped if I don't pay the minimum ML salary for players with ML service - INC0063586",
    "section_id": 126291,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144115743",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1498488279,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\r\nBus rule 19.131\r\nhttps://wiki.mlbam.com/display/EBIS/EBIS4-BR-403+19.+Add+C+onSubmit+Rules\r\n\r\n- On both MNCs and Add Cs, run the following rule check:\r\n- Rule: If the player has a Major League Contract that is Active AND he has at least 1 or more days of Major league service, then his Salary cannot be lower than Minimum Minor League Salary system value.\r\n- If rule fails, show Hard error to Club and Override for BOC\r\n- Error message: [Player name] salary may not be lower than Minimum Minor League Salary rate $[amount]\r\n\r\nQA - Please verify on both Contracts and Addendum Cs.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060457,
    "title": "As a club, I want to track CEP payments and balances on the payment tracker",
    "section_id": 126292,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143886185",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- On the Payment tracker, show all CEP invoice payments (similar to story #142359527)\n- If the payment has been made and date paid is available, status is \"paid\". Else, status is Earned not Paid.\n- Type is \"CEP-INV\"\n\n- On the payment tracker show all potential CEP balance payments owed to players.  (Similar to #142359229)\n- For CEP, Living allowance is shown as a lump sum as opposed to a Pay Per Period (only difference from CSP)\n- Status of these payments is 'Potential'\n- Type is \"CEP-Tuition Allowance\" or \"CEP-Living Allowance\"\n- Date paid is set to \"Exp [Date]\" for Living Allowance rows\n\n- All other columns are populated as normal\n- No fields are editable for these rows for any user type\n- Add 'CEP Invoice' and 'CEP Balance' options to the Type filter\n- Date on the tracker must match the CEP details on the Player profile",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1060458,
    "title": "Detect if an uploaded PDF is invalid before the contract stamping process is attempted",
    "section_id": 126293,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146951469",
    "created_by": 126,
    "created_on": 1497878959,
    "updated_by": 126,
    "updated_on": 1497878959,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18804,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "We need to programmatically detect when a PDF cannot be stamped - and warn a user that there is an issue.  The PDF that triggered this story can be opened in most PDF tools, but does not allow our PDF libraries (currently itext) to manipulate/stamp the PDF.  Also need to research when this occurs - look at the club in question and review their process.\n\nTied to jira EBISII-12417 - an example of the bad PDF is attached to the jira\n\nModel this after what MJC does - make it a state change rule saying that an attachment is not stampable.  Look at MjcBusinessRules.checkContractAttachmentCanBeStamped",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]