[
  {
    "id": 196131,
    "title": "A BOC user will see a blue notification when I place a player on the Restricted List from a Submitted Voluntarily Retired List transaction",
    "section_id": 27346,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126621111",
    "created_by": 104,
    "created_on": 1470062693,
    "updated_by": 104,
    "updated_on": 1470074597,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3011,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is a BOC user",
    "custom_steps": "WHEN the user has clicked on the \"Place on Restricted List\" button on a Voluntarily Retired transaction\r\nAND the following have all occurred successfully:  \r\n     - Reject the Place on Voluntarily Retired transaction. \r\n     - Create and approve a Place on Restricted List transaction for the player with a placement date = the placement date from the Place on Voluntarily Retired transaction and a \"Reason for Placement\" of \"Failure to submit Voluntarily Retired Letter\"\r\n     - Add the comment \"Player originally placed on VR list by club.\" to the Restricted List transaction. \r\n     - Load the Place on Restricted List transaction for the player in view mode. ",
    "custom_expected": "THEN the system will display a blue notification stating that the Voluntarily Retired transaction was rejected \r\nAND the Restricted List transaction was approved.",
    "custom_steps_separated": null
  },
  {
    "id": 196132,
    "title": "Being Reinstated from IL will reinstate a player from all Inactive Lists",
    "section_id": 27347,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126629319",
    "created_by": 104,
    "created_on": 1470062757,
    "updated_by": 104,
    "updated_on": 1470074724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3011,
    "display_order": 1,
    "custom_preconds": "GIVEN a player has one or more inactive list status'",
    "custom_steps": "WHEN  a player is reinstated from the Inactive List",
    "custom_expected": "THEN they will be reinstated from ALL inactive lists\r\nAND moved back to the roster status that they had prior to being placed on an Inactive List",
    "custom_steps_separated": null
  }
]