[
  {
    "id": 712640,
    "title": "2: BAS Basic Console Support",
    "section_id": 86350,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements: \r\nTitles must be playable on the most basic retail console configuration.\r\n\r\nIntent:\r\nThe Xbox 360 program provides choices to console purchasers, including the choice to purchase entry-level systems. Consumers expect that games on Xbox 360 will work regardless of what components are attached to the console.\r\n\r\nRemarks:\r\nA title may provide additional functionality and optimizations—for example, faster loading, career modes, and in-game saved pictures—when additional components are available.\r\n\r\nTitles are permitted to require a profile in order to enter gameplay.\r\n\r\nExemption:\r\nTitles are allowed to require the Kinect Sensor",
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 712641,
    "title": "15-1: BAS Sign in Changes",
    "section_id": 86350,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "Requirements:\r\nGames must properly detect and handle player profiles signing in or out in all areas of the game.\r\n\r\nIntent:\r\nThe Xbox Guide allows players to sign in and out of player profiles at all times. Game state should always be associated with the correct profile.\r\n\r\nRemarks:\r\nPlayers may sign in or out at any time via the Xbox Guide. The console issues an XN_SYS_SIGNINCHANGED system notification when this occurs. In addition, games may consult the XUserGetSigninState function. It is sufficient to return to the main menu if the game cannot update its game state to match the new sign-in state. Players may also be signed out of Xbox LIVE because of a duplicate sign-in. Single-player modes that do not rely on Xbox LIVE services can generally ignore Xbox LIVE sign-in changes.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Sign in to gamer profile.\r\n[3] Obtain game progress in any mode, create a game save and return to the main menu. \r\n[4] Enter an offline or online game mode.\r\n[5] During gameplay, sign out of the gamer profile and then sign back in to the same gamer profile.\r\n    [a] If prompted to select a storage device, select the original storage device containing the game save from step [3].\r\n[6] Ensure the game progress saved from step [3] has not been overwritten and game progress has not been unfairly lost.\r\n[7] Repeat steps [4] – [6] for all remaining game modes.\r\n[8] Return to the Dashboard.\r\n[9] Sign out of the gamer profile from step [2] and sign into a new gamer profile.\r\n[1] Boot the title.\r\n[2] Sign in to gamer profile.\r\n[3] Obtain game progress in any mode, create a game save and return to the main menu. \r\n[4] Enter an offline or online game mode.\r\n[5] During gameplay, sign out of the gamer profile and then sign back in to the same gamer profile.\r\n    [a] If prompted to select a storage device, select the original storage device containing the game save from step [3].\r\n[6] Ensure the game progress saved from step [3] has not been overwritten and game progress has not been unfairly lost.\r\n[7] Repeat steps [4] – [6] for all remaining game modes.\r\n[8] Return to the Dashboard.\r\n[9] Sign out of the gamer profile from step [2] and sign into a new gamer profile.\r\n[10] Boot the title.\r\n[11] Enter a game mode.\r\n[12] During gameplay, sign out of the new gamer profile and sign into the gamer profile from step [2].\r\n    [a] If prompted to select a storage device, select the original storage device containing the game save from step [3].\r\n[13 ] Ensure the game progress saved from step [3] has not been overwritten and game progress has not been unfairly lost.\r\n[14 Repeat steps [11] – [13] for all remaining game modes.\r\n",
    "custom_expected": "Titles must not allow the overwriting or loss of game progress as a result of gamer profiles signing in or out of any game mode.\r\n\r\n\r\nFail Examples:\r\n[1] If the user signs out of the current Gamer Profile and then immediately signs back into the same Gamer Profile at step [5], all game save data will be overwritten.\r\n[2] When signing out of the current Gamer Profile and then signing into a different Gamer Profile that already has saved game data from the title in test, the title will enter an unresponsive state on a loading screen at step [15].\r\n[3] When signing out of Gamer Profile A and then signing into Gamer Profile B, which already has saved game data from the title in test, the title will overwrite all of the game save data from Gamer Profile B with the progress of Gamer Profile A. \r\n[4] All game progress is lost upon performing a sign-in change and then completing a Challenge/Level.\r\n[5] The title enters a recoverable unresponsive state when the user signs out and then back into their profile during cut scenes.",
    "custom_steps_separated": null
  },
  {
    "id": 712649,
    "title": "22: VID System UI Framerate",
    "section_id": 86351,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements:\r\nGames must ensure that system UI can be rendered at least every 66 milliseconds in all areas of the game for any display mode.\r\nIn all areas of Kinect-enabled titles where a player is using his or her body to control the title and the player is not holding a controller, the title must ensure that system UI can be rendered at least every 33 milliseconds.\r\n\r\nIntent:\r\nThe Xbox 360 console is designed to provide real-time system notifications to the player, and the Xbox Guide may also be activated at any time. In order for the platform to remain responsive when activating the Xbox Guide or displaying notifications, the game will need to yield the graphics processor periodically.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Sign into a Gamer Profile and navigate through each game mode.\r\n[3] Open and close the Xbox Guide menu in the following areas of the title:\r\n    [a] During the boot sequence.\r\n    [b] Main menu – 5 times.\r\n    [c] During gameplay – At least once per level in each available game mode.\r\n    [d] Within the pre-game lobby of a multiplayer game – Once per game.\r\n    [e] Within the post-game lobby of a multiplayer game – Once per game.\r\n    [f] During loading screens – Once per loading screen.\r\n    [g] Transitions from loading screen to Lobby.\r\n[4] Verify the Xbox Guide menu can be opened at all times and this activity has no negative effects on the title.\r\n[5] For Kinect titles, verify both the Kinect NUI Guide and the standard Xbox Guide can be immediately opened at each area within step [3].",
    "custom_expected": "Titles must allow the Xbox Guide menu to be opened and closed at all times without causing any negative effects.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712650,
    "title": "24: AUD Background Music (NOT APPLICABLE FOR MLBAM STREAMING MEDIA APPS)",
    "section_id": 86351,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "Requirements:\r\nGames must not play their own background music if the player has enabled music playback in the Xbox Guide or Xbox Dashboard.\r\n\r\nIntent:\r\nThe Xbox 360 console is designed to allow player customization of the gameplay experience. Players expect to hear the music they have selected regardless of whether they are navigating in the Xbox Dashboard or playing a game.\r\n\r\nRemarks:\r\nGenerally, background music is anything that would normally be connected to a game's background music volume setting.\r\nGames may use the XACT tool and/or XAudio2 APIs to meet this requirement.\r\nMusic playback in the Xbox Guide and Xbox Dashboard are not enabled by default and must be enabled by the player.\r\n\r\nExemptions:\r\nGames that contain non-interactive FMV sequences where it is not possible to separate the background music from the remainder of the game's audio, such as movie sequences shown during title startup, are allowed to use the XMPOverrideBackgroundMusic function during such sequences.\r\n\r\nGames that are fundamentally rhythm-based or music-based are exempt from this requirement and may use the XMPOverrideBackgroundMusic function.\r\n\r\nGames that include rhythm-based or music-based sections are allowed to use the XMPOverrideBackgroundMusic function during those sections.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Enter the main menu and each available game mode.\r\n[3] Ensure the title plays its own background music in each area.\r\n[4] Using the Xbox Guide, select to play a custom soundtrack and verify the following:\r\n    [a] The titles background music is no longer audible in all areas.\r\n    [b] The selected custom soundtrack is playing.\r\n    [c] Any sound not related to the titles own background music e.g. speech is still audible.\r\n[5] Turn off custom soundtrack and verify the title soundtrack is used. ",
    "custom_expected": "Titles must not play their own background music if the user has enabled custom soundtrack playback in the Xbox Guide.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712653,
    "title": "29: UI Error Messaging",
    "section_id": 86352,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "When an error prevents a game from performing a task dictated by the player or expected under normal gameplay, the game must display a user-friendly message that addresses the error. The game must transparently handle software errors that are not relevant to gameplay.\r\n\r\nExamples of descriptions that are not user-friendly include technical information, such as error codes, module names, network addresses, and debug traces. For example: \r\n•\tUser-friendly: \"Your profile is no longer available.\" \r\n•\tNot user-friendly: \"ERROR 0x80001553 - ACCESS NOT AVAILABLE\" \r\nIn situations in which the player must take action as a result of the error, the message must include information or instructions that help the player correct the problem. \r\n",
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 712654,
    "title": "43: TID Keyboard Support",
    "section_id": 86353,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements:\r\nGames that support a virtual keyboard must also accept input from a physical text input device (TID).\r\n\r\nIntent:\r\nThe console supports input from USB keyboards and other text input devices. Players who see a virtual keyboard in a game context expect that they can use any supported keyboard to enter text.\r\n",
    "custom_steps": "(we need to run through this test to see if it's applicable for MLBAM streaming media apps)\r\n\r\n[1] Connect the console to Xbox LIVE.\r\n[2] Ensure a Controller and Chatpad are connected to the console.\r\n[3] Boot the title.\r\n[4] Sign into Xbox LIVE with the gamer profile.\r\n[5] Visit the following areas of the title.\r\n    [a] The Main Menu screen.\r\n    [b] During gameplay within each game mode.\r\n    [c] During a loading screen.\r\n[6] Press each of the following buttons/button combinations.\r\n    [a] Green Button.\r\n    [b] Orange Button.\r\n    [c] Green and Orange Button together.\r\n    [d] Friends Button.\r\n    [e] Left Arrow Button.\r\n    [f] “G” Button.\r\n    [g] Shift and “G” Button together.    \r\n    [h] Enter Button.\r\n[7] Visit every area of the title where text input is possible, and ensure the Chatpad can be used to input text without error.",
    "custom_expected": "Titles must allow the Chatpad to be used to input text without error, wherever text input is possible within a title. Additionally, use of the Chatpad buttons anywhere within a title must not cause error.\r\n\r\n\r\nFail Examples\r\n[1] If the user has a Chatpad connected to the controller and presses both the Green and Orange buttons simultaneously as stated in step [6-c], the title will instantly crash to a frozen screen.\r\n[2] The title will cache any input made with a Chatpad when it is connected to a controller. Therefore, when reaching an in-game UI that accepts text input for step [5-b], any buttons previously pressed on the Chatpad will be automatically entered into the text box.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712655,
    "title": "49: STR Game Content Persistence",
    "section_id": 86354,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements:\r\nGames must gracefully handle all cases in which stored game content is no longer accessible or available. Games must also gracefully handle all cases in which the console reports the content as invalid or unreadable.\r\n",
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 712656,
    "title": "118: STR Game Save Dependencies",
    "section_id": 86354,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "(Needs confirmation this applies to streaming media apps; game data is not saved to content package or storage device AFAIK))\r\n\r\nRequirements\r\nGame save progress must be associated with a gamer profile and must not have any dependencies on shared content.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] From the title screen, locate the option to download content (this may only be available through Xbox LIVE Marketplace).\r\n[3] Download an available content package for the title to a storage device.\r\n[4] Enter a game mode that makes use of the content package and create a save.\r\n[5] Return to the Dashboard and delete the content package from the storage device.\r\n[6] Reboot the console and attempt to load the save created in step 4.\r\n[7] Repeat steps [1] to [6] for all other available content packages.",
    "custom_expected": "Titles must gracefully handle situations where dependent content packages are no longer available.",
    "custom_steps_separated": null
  },
  {
    "id": 712666,
    "title": "60: CP Content Package Element Transfer",
    "section_id": 86355,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements:\r\nA game must not move or copy any element of a content package to alternate storage locations. \r\n\r\nIntent:\r\nContent packages are stored in a way that allows the player to manage the content effectively. Content packages that are moved to non-standard locations cannot be appropriately managed by the system. \r\n\r\n\r\n*Note: need confirmation if this is even applicable to MLBAM streaming media apps",
    "custom_steps": "[1] Connect 2 Memory Units to the console.\r\n[2] Boot the title.\r\n[3] Download all available content packages for the title in test to the Hard Drive.\r\n[4] Identify the location of each downloaded content package on the Hard Drive.\r\n[5] Load/utilise all of the downloaded content packages in the appropriate game modes.\r\n[6] Access the connected storage devices and verify that each content package is still stored in the locations identified in step [4].\r\n[7] Report any content packages that have been copied or moved.\r\n[8] Repeat steps [1] to [7] but use USB Flash Drives instead. ",
    "custom_expected": "Titles must not move or copy any element of a content package to alternate storage locations.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712667,
    "title": "61: LC Content Sharing Privileges",
    "section_id": 86356,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements\r\nTitles must not transmit or receive any player-created content if the player-created content flag is turned off.\r\n\r\nIntent\r\nMaintain integrity of the privilege system. Players who choose not to see player-created content do not expect to see player-created content.\r\n\r\nRemarks\r\nPlayer-created content refers to content that a player can create or modify in a game. This includes content such as game snapshots, graphics, maps, voice messages and annotations, video messages, images captured from the Xbox LIVE Vision camera or the Xbox 360 Kinect Sensor, skeletal data, and so on.\r\nIn cases in which multiple players are signed in on one console, games must respect the most restrictive sharing settings among all users. This includes situations in which the most restrictive settings are set for a gamer who is idle in a session (that is, signed in to a console but not actively participating in the session).\r\nReal-time video chat, text chat, and voice chat are not considered player-created content.\r\nPlayer-editable strings and text tags are not considered player-created content but must be verified per TCR 92, CMTV Player Text String Verification.\r\nGames must call the XUserCheckPrivilege function with the XPRIVILEGE_USER_CREATED_CONTENT flag to detect the setting.\r\n",
    "custom_steps": "[1] Establish the way the title integrates user created content. \r\n[2] Boot the title.\r\n[3] Sign in a gamer profile, create and upload a form of content.\r\n[4] Exit the current gamer profile and sign in a gamer profile with the Member Content option set to “Blocked”.\r\n[5] Using the information from step 1 access a game mode that utilises user created content.\r\n[6] Verify that no user created content is accessed or an appropriate error message is displayed.\r\n",
    "custom_expected": "Titles must not transmit or receive any user-created content if the Downloadable Content option is set to “Blocked”.",
    "custom_steps_separated": null
  },
  {
    "id": 712668,
    "title": "69-1 No Sharing of Achievements - Inactive Profiles",
    "section_id": 86357,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements\r\nTitles must not award or transfer Achievements and Gamer Score to profiles that have not directly earned them even if multiple profiles are signed in when the achievement is awarded.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Sign in with 4 gamer profiles and note gamer scores for each.\r\n[3] Using gamer profile A (leaving gamer profiles B, C and D inactive) obtain at least one Achievement.\r\n[4] Save progress made and verify the Achievements have only been awarded to gamer profile A and that the Gamerscore has increased by the expected amount.\r\n[5] Return to the Dashboard and navigate to My Xbox/Game Library/Recent Games/<title>/ \r\n[6] Boot the title and load gamer profile A’s game save.\r\n[7] Verify that no Achievements have been awarded to gamer profiles B, C or D and that their gamer scores remain as noted in step 2.\r\n",
    "custom_expected": "Titles must not award or transfer Achievements and Gamer Score to profiles that have not directly earned them even if multiple profiles are signed in when the achievement is awarded.",
    "custom_steps_separated": null
  },
  {
    "id": 712669,
    "title": "69-2 No Sharing of Achievements - Saved Game Transfer",
    "section_id": 86357,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "Requirements\r\nTitles must not award or transfer Achievements and Gamer Score to gamer profiles that have not directly earned them regardless of how saves are manipulated.\r\n",
    "custom_steps": "[1] Sign in with gamer profile B and note B’s gamer score.\r\n[2] Sign out of gamer profile B and then boot the title.\r\n[3] Sign in with gamer profile A.\r\n[4] Obtain at least one Achievement.\r\n[5] Return to the Dashboard and navigate to My Xbox/System Settings/Memory/All Devices/Games/<title>  \r\n[6] After reverting back to gamer profile B, attempt to copy gamer profile A’s game save to the same storage device, and then to an alternate storage device.\r\n[7] Verify that gamer profile A’s Achievement(s) have not been transferred to gamer profile B and that B’s gamer score remains as noted in Step [1].\r\n[8] Reboot the title whilst signed in as gamer profile B.\r\n[9] Load the game save copied from gamer profile A and attempt to earn further Achievements with gamer profile B and that B’s gamer score remains as noted in Step 1.\r\n[10] Verify that no further Achievements can be obtained using gamer profile B.",
    "custom_expected": "Titles must not award or transfer Achievements and Gamer Score to gamer profiles that have not directly earned them regardless of how saves are manipulated.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712680,
    "title": "70-1 Rich Presence",
    "section_id": 86358,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Requirements\r\nTitles must provide accurate presence information to a gamer profile, and update this information to reflect the status and whereabouts of a gamer profile within game at all times.\r\n",
    "custom_steps": "[1] Ensure the gamer profiles being used for this test are friends with each other.\r\n[2] Console A: Sign into an Xbox LIVE enabled gamer profile, boot the title and enter a game mode.\r\n[3] Console B: Sign into a gamer profile that is friends with the gamer profile in use on console A.\r\n[4] Console B: Boot a different title and observe the presence information for the user on console A, verifying it corresponds with that user’s behaviour in game.\r\n[5] If title supports Xbox LIVE multiplayer, on console A send a Cross Game Invite to the user on console B, and verify the invite text received on console B includes the name of the title running on console A.\r\n[6] Report any textual discrepancies in a Cross Game Invite, any failure to update presence information during gameplay, any presence information that displays in an incorrect (i.e. non-selected) language, or any missing characters.\r\n[7] Repeat steps [1] – [6] for all supported languages.",
    "custom_expected": "Titles must provide accurate presence information to a gamer profile, and update this information to reflect the status and whereabouts of a gamer profile within game at all times.",
    "custom_steps_separated": null
  },
  {
    "id": 712642,
    "title": "095-1 Connection Status Notifications - Offline (N/A for media streaming app which is always online)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "[1] Boot the title.\r\n[2] Verify the gamer profile is signed into Xbox LIVE.\r\n[3] Disconnect the hub from the Xbox LIVE service by removing the uplink cable.\r\n[4] Attempt the following actions within the main menu, during offline gameplay and during Xbox LIVE gameplay before the console recognises it has been disconnected from Xbox LIVE (up to 2 minutes):\r\n     [a] Create a game save.\r\n     [b] Reach an auto-save point (if applicable).\r\n     [c] Enumerate a list of game saves.\r\n     [d] Load a game save.\r\n     [e] Change storage device (with save already present).\r\n     [f] Proceed with offline single player gameplay.\r\n[5] Verify the title properly detects and handles loss of network connectivity, and it does not interrupt gameplay (causing data loss) whilst performing each of the above actions.",
    "custom_expected": "Titles must properly detect and handle loss of network connectivity in all offline areas of the title.\r\n\r\n\r\nFail Examples\r\n[1] Disconnecting the network uplink cable from the network hub at step [4] results in a misleading message similar to; “You have signed out of your Gamer Profile and will be returned to the main menu”.\r\n[2] Disconnecting the network uplink cable from the network hub results in the title entering an unresponsive state for approximately 1 minute when reaching gameplay (as indicated in step [4-f]).\r\n[3] Disconnecting the network uplink cable whilst saving or uploading scores to the server at step [4] results in the title entering an unresponsive state.\r\n[4] After disconnecting from Xbox LIVE, if the user then reconnects via the Xbox Guide option, the title returns the user to the main menu without notification as to why.\r\n\r\n[5] ​After disconnecting the network uplink cable, an unresponsive state (with no on-screen messaging or animation) is entered by the title for up to two minutes.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712643,
    "title": "095-2 Connection Status Notifications - System Link (N/A for media app)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "[1] Boot the title on all consoles.\r\n[2] Sign into Xbox LIVE with the gamer profile on all consoles.\r\n[3] Console A: Setup a System Link game session.\r\n[4] Console B: Find and join the game session created on console A.\r\n[5] During gameplay, disconnect the hub from the Xbox LIVE service by removing the uplink cable.\r\n[6] Verify the title properly detects and handles loss of Xbox LIVE connectivity, and it does not interrupt System Link gameplay.",
    "custom_expected": "Titles must properly detect and handle loss of network connectivity in all System Link game modes.\r\n\r\nFail Examples\r\n[1] Disconnecting the network uplink cable from the network hub at step [5] results in the session ending and a misleading message displaying similar to “Game session terminated”.\r\n[2] Disconnecting the network uplink cable from the network hub at step [5] results in the title entering an unresponsive state for approximately 1 or more minutes on both the host and client console.\r\n[3] Disconnecting the network uplink cable whilst saving or uploading scores to the server after step [5] results in the title entering an unresponsive state on both the host and client console.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712644,
    "title": "095-3 Connection Status Notifications - System Link - Graceful Exit (N/A for media app)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "[1] Console A and B: Connect consoles together using a System Link Cable.\r\n[2] Console A and B: Boot the title.\r\n[3] Console A: Setup a System Link game session.\r\n[4] Console B: find and join the game session created by console A.\r\n[5] Console B: Once connected to console A’s game session, exit the game session.\r\n[6] Verify that console B is able to leave the game session without error, and console A is clearly messaged and able to continue or quit without error.\r\n[7] Repeat steps [3] to [6] with console A (the host) leaving the game.",
    "custom_expected": "Titles must allow users to leave a System Link game session without error.\r\n\r\nFail Examples\r\n[1] The game session is instantly ended at step [5] and all users progress to the post-race stats screen.\r\n[2] The title provides an uninformative message similar to “Unable to continue” on the host console, when the game session is ended at step [5].\r\n[3] If the host selects to exit via the pause menu at step [7], the title provides all clients with an uninformative message similar to “Game session error” before ending the game session.\r\n[4] If the last remaining client selects to exit the game session via the pause menu during gameplay, no in-game notification is provided for the host at step [6].\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712645,
    "title": "095-4 Connection Status Notifications - System Link - Power Down (N/A for media app)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "[1] Console A & B: Connect each console together using a System Link Cable.\r\n[2] Console A & B: Boot the title on both consoles.\r\n[3] Console A: Setup a System Link game session.\r\n[4] Console B: Find and join the game session created by console A.\r\n[5] Console B: Once connected to console A’s game session, power-off the console.\r\n[6] Console A: Ensure the user is clearly messaged and able to continue the game session or quit without error.\r\n[7] Console A & B: Repeat steps [3] to [6] powering down console A instead of console B.\r\n[8] Report any instance of the title failing to handle the power down gracefully.",
    "custom_expected": "Titles must handle users powering-off the console during a System Link game session gracefully and without error.\r\n\r\n\r\nFail Examples\r\n[1] The game session is instantly ended at step [5] and all users progress to the post-race stats screen.\r\n[2] The title provides an uninformative message similar to “Unable to continue” on the host console, when the game session is ended at step [5].\r\n[3] If the host powers down at step [7], the title provides all clients with an uninformative message similar to “Game session error” before ending the game session.\r\n[4] If host powers down their console whilst any client is joining the game session at step [4], the console for the client joining the game session will experience game instability.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712646,
    "title": "095-5 Connection Status Notifications - Xbox LIVE (for games)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "[1] Console A & B: Boot the title.\r\n[2] Consoles A & B: Sign into an Xbox LIVE enabled gamer profile.\r\n[3] Console A: Setup an Xbox LIVE game session.\r\n[4] Console B: Find and join the game session created on console A.\r\n[5] During gameplay disconnect the hub from Xbox LIVE (simulating disconnection from the Xbox LIVE service) by removing the uplink cable.\r\n[6] Verify the following:\r\n    [a] The title properly detects and handles loss of Xbox LIVE connectivity. \r\n    [b] A relevant message is displayed notifying all users - host and client(s). \r\n    [c] The title does not handle loss of Xbox LIVE connectivity as a profile sign in change.\r\n    [d] The console to lose connection does not benefit from not finishing the game session. Examples can be not gaining a win, an increase in their DNF (Did Not Finish), Stats reducing or win/loss ratio reducing.\r\n[7] Repeat steps [2] to [6] for all remaining Xbox LIVE game modes.",
    "custom_expected": "Titles must properly detect and handle situations where a loss of network connectivity has occurred between the Xbox LIVE service and any user’s console, across all Xbox LIVE game modes.\r\n\r\nFail Examples\r\n[1] After step [5], both the host and client are exited from gameplay and returned to an in-game menu without any form of notification or displays a message implying the Xbox LIVE service or servers are down.\r\n[2] After step [5], both the host and client are exited from gameplay and returned to an in-game menu without any form of notification and furthermore, both users will have their Leaderboard score negatively impacted.\r\n[3] If the host console attempts to create an Xbox LIVE game session after being exited from gameplay at step [5], but selects to create a new game session before the console displays pop up toast notifying of Xbox LIVE disconnection, game instability will be observed.\r\n[4] After disconnecting the hub from the Xbox LIVE service by removing the network uplink cable during Xbox LIVE gameplay, quitting participants are awarded a win, and/or a positive increase in their win/loss ratio.\r\n\r\n[5] Game sessions created by a Host that lost connection to Xbox LIVE and reconnected while in the same session cannot be joined by any Client.\r\n\r\n[6] The player is messaged that they won the match when the uplink cable is pulled from the hub. This allows the player to earn progress towards an achievement for winning a specific number of ranked matches.\r\n\r\n[7] After disconnecting the hub from the Xbox LIVE service by removing the network uplink cable during Xbox LIVE gameplay, leaderboards are not updated for any participant in the session.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712647,
    "title": "095-6 Connection Status Notifications - Xbox LIVE - Graceful Exit (N/A for media app)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 6,
    "custom_preconds": null,
    "custom_steps": "[1] Consoles A & B: Connect to Xbox LIVE.\r\n[2] Consoles A & B: Boot the title and sign into an Xbox LIVE enabled gamer profile.\r\n[3] Consoles A & B: Make a note of Leaderboard scores and ranking.\r\n[4] Console A: Setup an Xbox LIVE multiplayer ranked game session.\r\n[5] Console B: Find and join the game session created by console A.\r\n[6] Console B: Once connected to console A’s game session, exit the game session.\r\n[7] Console B: Verify that you are able to leave the game session without error, and console A is clearly messaged and able to continue or quit without error.\r\n[8] Verify that the Leaderboards update within 30 minutes and the following behaviour occurs;\r\n    [a] Console A is awarded with a win, or their win/loss ratio is not negatively impacted. The position of console A on the Leaderboards must not be negatively impacted.\r\n    [b] Console B is penalised and in no way benefits for not finishing the game session. Examples can be a loss, DNF (Did Not Finish), Stats reducing or win/loss ratio reducing.\r\n    [c] If console B quits but does not incur any penalty, ensure console A benefits with regards to their overall statistics.\r\n[9] Repeat steps [1] to [6] but set up a (non-ranked) multiplayer game in step 3.\r\n[10] Repeat steps [1] to [8] with console A (the host) leaving the game session. Player matches and other non-arbitrated Xbox LIVE game sessions are exempt from the leaderboard aspect at step [8].",
    "custom_expected": "Titles that allow users to exit an Xbox LIVE game session in progress must do so without error.\r\n\r\nFail Examples\r\n[1] The game session is instantly ended at step [6] and all users’ progress to the post-race stats screen without notification.\r\n[2] The title provides an uninformative message similar to “Unable to continue” on the host console, when the game session is ended at step [7].\r\n[3] If the host selects to exit via the pause menu at step [10], the title provides all clients with an uninformative message similar to “Game session error” before ending the game session.\r\n[4] If the last remaining client selects to exit the game session via the pause menu during gameplay, no in-game notification is provided for the host at step [10].\r\n[5] The client at step [6] is not penalised in any way for not finishing the game session and/or the host’s Leaderboard position is negatively affected with an inferior win/loss ratio.\r\n[6] After the host has quit the game session and the title has migrated the host privileges to another user, upon completion of the game session no stats have been recorded for any user.\r\n\r\n[7] After the player on console B quits via the pause menu, leaderboards are not updated for any participant in the session.\"\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712648,
    "title": "095-7 Connection Status Notifications - Xbox LIVE - Power Down (N/A for media app)",
    "section_id": 86359,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 7,
    "custom_preconds": null,
    "custom_steps": "[1] Consoles A & B: Connect to Xbox LIVE.\r\n[2] Consoles A & B: Boot the title.\r\n[3] Consoles A & B: Sign into and Xbox LIVE enabled gamer profile.\r\n[4] Consoles A & B: Make a note of Leaderboard scores and ranking. \r\n[5] Console A: Setup an Xbox LIVE multiplayer ranked game session.\r\n[6] Console B: Find and join the game session created by console A.\r\n[7] Console B: Once connected to Console A’s game session, power-off the console.\r\n[8] Console A: Verify that you are clearly messaged and able to continue the game session or quit without error.\r\n[9] Verify that the Leaderboards update within 30 minutes and the following behaviour occurs;\r\n    [a] Console A is awarded with a win, or their win/loss ratio is not negatively impacted. The position of console A on the Leaderboards must not be negatively impacted.\r\n    [b] Console B is penalised and in no way benefits for not finishing the game session. Examples can be a loss, DNF (Did Not Finish), Stats reducing or win/loss ratio reducing.\r\n    [c] If console B quits but does not incur any penalty, ensure console A benefits with regards to their overall statistics.\r\n[10] Repeat steps [1] to [9] with console A (the host) powering-off their console in step [7].\r\n[11]Repeat steps [1] to [9] but set up a (non-ranked) multiplayer game in step 4. Player matches and other non-arbitrated Xbox LIVE game sessions are exempt from the leaderboard aspect at step [9].\r\n",
    "custom_expected": "Titles must handle the user powering-off the console during an Xbox LIVE game session gracefully and without error.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712651,
    "title": "Kinect: 158-1 Single Player Jump In, Jump Out",
    "section_id": 86360,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "The user experience must not be negatively affected during single player Kinect gameplay, if other users move in and out of the sensor’s field of view.\r\n\r\nConfiguration:\r\nBiometric Gamer Profiles can be created by navigating through the Xbox Dashboard to Settings > Kinect > Kinect ID Setup.\r\n",
    "custom_steps": "[1] Boot the title and proceed to an area where the title requests the addition of a player using Kinect.\r\n    [a] If the game supports hybrid gameplay with Kinect and controller input, determine whether it is possible to reach each Kinect join point without being requested to sign-in using the controller. Kinect identity is not required if the user’s profile has already been determined via earlier controller input.\r\n[2] Sign-in using a biometric profile and ensure the title correctly identifies the user within the field of view. \r\n    [a] The title is required to provide feedback and a correction opportunity once signed into the gamer profile for situations where the result of a misidentification would have an effect on a player's profile data (see Documentation section). Testers are required to make sure this occurs.\r\n[3] Select a single player game mode that supports the use of Kinect (modes supporting only VUI are exempt from this particular FTC).\r\n[4] During single player gameplay, have secondary and tertiary players walk across the play space at various points during gameplay and ensure the title gracefully handles the situation.\r\n    [a] Areas of concern would be the title unnecessarily loading an in-game calibration each time, repetitive messaging hindering progression each time a secondary or tertiary players enters the play space, or other issues that unnecessarily prevent gameplay from continuing. \r\n[5] Repeat steps [1] – [4] for each of the single player game modes.\r\n[6] Repeat steps [1] – [5] but this time use a Gamer Profile with no associated biometric data.\r\n    [a] In a case where a user is signing in without biometric data, ensure the title notifies the user about the sign-in result. The title must also offer an obvious path to correct their identity if desired, before the user has the opportunity to start any profile related actions. Testers are required to make sure this occurs when signing in at various stages during the title.",
    "custom_expected": "The user experience must not be negatively affected if other people walk into the sensor’s field of view in single player gameplay. Titles must handle this in a graceful way, such as allowing gameplay to continue or pausing the title if an occlusion occurs. The game mode must not be ended, or progress lost, or calibration occurring each time as a result of other players being within the field of view.\r\n\r\n\r\nPass Examples\r\n[1] Where a second player walks behind the primary player during single player gameplay, the title allows gameplay to continue uninterrupted.\r\n[2] Where a second player walks in-front of the primary player during single player gameplay, the title pauses and informs the user why this has occurred.\r\n\r\nFail Examples\r\n[1] Where a second player walks behind the primary player during single player gameplay, the title interrupts gameplay and enters a calibration mode for several seconds each time.\r\n[2] When signing into a non-biometric profile midway through the title, the title does not notify the player as to the result of the identification operation.\r\n[3] When signing into a gamer profile within an in-game menu/gameplay, the title does not offer any opportunity for the user to correct their identity prior to earning achievements, posting to leaderboards or creating an in-game save.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712652,
    "title": "Kinect: 158-2 Multiplayer Jump In, Jump Out",
    "section_id": 86360,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "The user experience must not be negatively affected during single player or multiplayer Kinect gameplay, if the user leaves and then returns to the sensor’s field of view.\r\n\r\nConfiguration\r\nAt least two biometric Gamer Profiles must be created to perform this test. This can be performed by navigating through the Xbox Dashboard to Settings > Kinect > Kinect ID Setup.\r\n",
    "custom_steps": "Part A\r\n[1] Boot the title and proceed to an area where the title requests the addition of a player using Kinect.\r\n    [a] If the game supports hybrid gameplay with Kinect and controller input, determine whether it is possible to reach each Kinect join point without being requested to sign-in using the controller. Kinect identity is not required if the user’s profile has already been determined via earlier controller input.\r\n[2] Sign-in using a biometric profile and ensure the title correctly identifies the user within the field of view. \r\n    [a] The title is required to provide feedback and a correction opportunity once signed into the gamer profile for situations where the result of a misidentification would have an effect on a player's profile data (see Documentation section). Testers are required to make sure this functionality occurs.\r\n[3] Select a single player game mode that supports the use of Kinect (modes supporting only VUI are exempt).\r\n[4] During single player gameplay, leave the sensor’s field of view from the left side, right side, and then rear of the play space. In each instance, wait until tracking has been lost and then re-enter the play space, ensuring that the title gracefully handles the situation.\r\n    [a] The title must correctly recognise the player as the person signed in from step [2] and allow the user to progress onwards to perform a profile related action (see Documentation section).\r\n[5] Repeat steps [1] – [4] for each of the single player game modes.\r\n[6] Repeat steps [1] – [5] but this time use a Gamer Profile with no associated biometric data.\r\n    [a] In a case where a user is signing in without biometric data, ensure the title notifies the user about the sign-in result. The title must also offer an obvious path to correct their identity if desired, before the user has the opportunity to start any profile related actions. Testers are required to make sure this occurs when signing in at various stages during the title.\r\n \r\nPart B\r\n[7] Re-launch the console and once again proceed to an area where the title requests the addition of a player using Kinect.\r\n    [a] If the game supports hybrid gameplay with Kinect and controller input, determine whether it is possible to reach each Kinect join point without being requested to sign-in using the controller. Kinect identity is not required if the user’s profile has already been determined via earlier controller input.\r\n[8] Have each player sign-in using a biometric profile and ensure the title correctly identifies the user within the field of view. \r\n    [a] The title is required to provide feedback and a correction opportunity once signed into the gamer profile for situations where the result of a misidentification would have an effect on a player's profile data. Testers are required to make sure this functionality is occurs.\r\n[9] Enter a game mode which supports Kinect-based multiplayer gameplay and fill all player slots.\r\n    [a] If the multiplayer mode supports save game progress and/or achievements for any additional players joining and signing in, biometric sign-in must be supported for those additional players. Kinect identification and profile selection is not required if saving and achievements are not supported for additional players.\r\n[10] During multiplayer gameplay, leave the sensor’s field of view from the left side, right side, and then rear of the play space. In each instance, wait until tracking has been lost and then re-enter the play space, ensuring that the title gracefully handles the situation.\r\n    [a] The title must correctly recognise each player as the person signed in from step [8] and allow the users to continue on to perform a profile related action, such as saving game progress, earning an achievement, unlocking an avatar award etc.\r\n[11] Repeat step [10], but on this occasion have both players leave the play space for a short period of time, before re-entering from a different side to which they previously left. For example, player 1 leaves from the left side before returning from the right side or player 2 leaves from the rear of the play space before returning from the left side.\r\n",
    "custom_expected": "The user experience must not be negatively affected if the user leaves and then returns to the sensor’s field of view in any single player game or multi-player game. Titles must handle this in a graceful way, such as pausing the title when the player leaves, and/or allowing the user to continue gameplay when they return. The game mode must not be ended or progress lost as a result of active players leaving and then returning to the play space during a game session.\r\n \r\nWhere game saves, achievements or avatar awards are available for users to obtain and the Gamer Profile has not already been established, users should be correctly identified using the Kinect sensor. It is not expected that titles should allow all profiles to obtain achievements and create progress based game saves. It is acceptable for only the primary, active profile to be awarded achievements or game progress. If additional profiles are able to create game saves or earn achievements, then they must be identified by the Kinect sensor.\r\n \r\nOnce users have been established for a game session, it is acceptable to allow other players to stand-in for the original user.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712657,
    "title": "Generic: 000-2 Language Support",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "Titles must boot correctly and display all game critical text for all Dashboard language settings.\r\n",
    "custom_steps": "[1] Boot the console.\r\n[2] Navigate to Dashboard language settings.\r\n[3] Set language to each of the following, ensuring the title boots correctly and exhibits the correct localization for each in game:\r\n    [a] English.\r\n    [b] English (QWERTY).\r\n    [c] Japanese.\r\n    [d] German.\r\n    [e] French.\r\n    [f] Spanish.\r\n    [g] Italian.\r\n    [h] Korean.\r\n    [i] Chinese.\r\n    [j] Portuguese.\r\n    [k] Russian.\r\n    [l] Polish.\r\n[4] For all additional languages (e.g. Swedish) supported by the title, ensure the correct localisation for each in game.\r\n[5] Ensure all game critical text that is essential for gameplay progression within the title is legible when viewed in High Definition, Standard Definition and when using CRT TV’s.\r\n",
    "custom_expected": "Titles must boot correctly in all Dashboard language settings, and exhibit the correct localisation for all supported languages in game. Where text for all supported languages is displayed, this must remain legible regardless of the display setup.",
    "custom_steps_separated": null
  },
  {
    "id": 712658,
    "title": "Generic: 000-4 Maximum Controllers",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "Titles must function correctly with up to and including the maximum number of controllers connected to the console.",
    "custom_steps": "[1] Connect 2 x Wired Controllers and 2 x Wireless Controllers.\r\n[2] Boot the title.\r\n[3] Navigate through all menus and progress through gameplay and use any of the other three controllers to provide input both independently and simultaneously during the following scenarios;\r\n    [a] During standard gameplay.\r\n    [b] When entering and exiting menus.\r\n    [c] Within saving and loading screens.\r\n    [d] When browsing the leaderboards.\r\n[4] Ensure that the extra connected controllers have no adverse effect on the application.\r\n[5] Return to the Dashboard, disconnect two controllers and then replace with a Kinect sensor and a universal media remote.\r\n[6] Repeat step [3] whilst offering input both independently and simultaneously across all devices\r\n    [a] Where input is provided via the Kinect sensor, ensure both Natural User Input (NUI) and Vocal User Input (VUI) is utilised. \r\n    [b] Ensure connection, disconnection and/or input from other standard controllers does not cause negative affects with the application.\r\n    [c] Where natural input via a Kinect sensor and input via a standard Xbox 360 controller are allowed, attempt to select two different menu options simultaneously.",
    "custom_expected": "Titles must function correctly with up to and including the maximum number of controllers connected to the console. Where multiple input devices are connected to the console, titles must be able to support input independently and simultaneously across controllers, NUI, VUI and the universal media remote.\r\n\r\nPass example:\r\n[1] The application allows input from any connected device when navigating between menus, or during full-screen media playback.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712659,
    "title": "Generic: 000-5 Navigation & Option Buttons",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 3,
    "custom_preconds": "The Navigation Buttons used in Options screens and Menu screens must function as expected.\r\n",
    "custom_steps": "[1] Boot the application with a controller and Kinect sensor connected to the console.\r\n[2] Navigate through all Menu and Option screens (Front End, In-game and other areas) with the Xbox 360 controller, ensuring that all the Navigation buttons function as expected.\r\n    [a] If button labels or command prompts are displayed within any menu UI, verify that each command can be issued correctly.\r\n[3] Repeat step [2] with the Kinect sensor, if supported.\r\n[4] Repeat step [2] with Natural User Input (NUI) and VUI input.\r\n    [a] If additional Vocal User Input (VUI) commands are available for use other than the default commands, verify all VUI commands are accurate.",
    "custom_expected": "The Navigation Buttons used in Options screens and Menu screens must function as expected.",
    "custom_steps_separated": null
  },
  {
    "id": 712660,
    "title": "Generic: 000-6 Option Settings",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 4,
    "custom_preconds": "All Option settings within a title must function as expected.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Set a spread of various Options across the team such that every available value is tested for each option setting. \r\n    [a] This should cover options both within the game, and based on Dashboard audio/visual settings (where applicable).\r\n    [b] Check all settings and options within the title’s menus are correctly reflected during gameplay. Examples being laps/weapons/difficulty.\r\n[3] In addition, have users change their Option settings in all areas of the application, and verify these are accurately reflected throughout the test cycle.",
    "custom_expected": "All Option settings within a title must function as expected.\r\n\r\nPass Examples\r\n[1] With the in-game language option set to Dutch, the title only uses Dutch subtitles and leaves the audio in English.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712661,
    "title": "Generic: 000-7 Stability in Idle State",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 5,
    "custom_preconds": "Titles must remain stable at all times when left in an idle state.\r\n",
    "custom_steps": "[1] Console A: Boot the title.\r\n[2] Console A: Enter a single player game mode and leave the title idle (not paused) for 30 minutes, ensuring the title remains stable throughout, and gameplay can be resumed afterwards.\r\n    [a] Have each member of the test team leave the application in an idle state within a unique area.\r\n[3] Console A: Repeat step [2] for all remaining single player game modes.\r\n[4] Console B: Boot the title.\r\n[5] Console A: Create a multiplayer game session of no less than 30 minutes duration.\r\n[6] Console B: Join the multiplayer game session created on console A.\r\n[7] Console A & B: Leave the title idle (not paused) for 30 minutes ensuring the title remains stable throughout, and gameplay can be resumed afterwards.\r\n[8] Repeat steps [5] to [7] for all remaining multiplayer game modes, including System Link and Xbox LIVE, Versus and Cooperative.",
    "custom_expected": "Titles must remain stable at all times when left in an idle state.\r\n\r\nFail Examples\r\n[1] If the user opens the Xbox Guide menu during any cut scene and then leaves the title in an idle state with the Guide menu open, the title crashes to a frozen screen after 30+ minutes of inactivity.\r\n[2] When creating a Multiplayer game session set to one hour or more at step [5] or [8], the title will terminate the game session if all participants leave gameplay in an idle state for approximately 15 minutes.\r\n[3] The title enters an unresponsive state at step [3] after having been left in an idle state for 30+ minutes whilst streaming any in-game news updates via Xbox LIVE.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712662,
    "title": "Generic: 000-8 Install to Storage Device (N/A for media streaming app)",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 6,
    "custom_preconds": "Disc based full titles must correctly install to and function without issue from the hard drive and USB Flash Drive. It must also be possible to delete an installed title from the hard drive and USB Flash Drive.",
    "custom_steps": "[1] Insert the title’s disc into the console.\r\n[2] Select the title from the Game Library.\r\n[3] Select “Install to Hard Drive”.\r\n[4] Verify installed game\r\n    [a] Navigate to the Game Library.\r\n    [b] Navigate to Collections/Xbox 360 Games.\r\n    [c] Select the title.\r\n    [d] Select “Play from Hard Drive”.\r\n[5] Verify save game functionality:\r\n    [a] Create a save at first available point (profile creation, option saving, game progress).\r\n    [b] Exit the title.\r\n    [c] Re-launch the title and verify the saved game loads without issue.\r\n[6] Verify gameplay quality:\r\n    [a] Proceed into gameplay.\r\n    [b] Verify there are no major graphical or audio issues.\r\n    [c] Verify the title doesn’t crash.\r\n    [d] Verify user can successfully exit the title and return to the Game Library.\r\n[7] Verify deletion of installed game:\r\n    [a] Make note the available space on the Hard Drive in the System/Memory section of the Dashboard.\r\n    [b] Navigate to the Game Library.\r\n    [c] Navigate to Collections/Xbox 360 Games.\r\n    [d] Select the title.\r\n    [e] Select “Delete from Hard Drive”.\r\n[8] Repeat steps [3] to [7] using a USB Flash Drive.",
    "custom_expected": "Disc based full titles must correctly install to and function without issue from the hard drive and USB Flash Drive. It must also be possible to delete an installed title from the hard drive and USB Flash Drive.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712663,
    "title": "Generic: 000-35 Background Download",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 7,
    "custom_preconds": "Titles must properly detect and handle downloadable content downloading in the background whilst the title is running.\r\n\r\nNA Examples\r\n[1] Any title which suspends background downloading during all featured game modes.\r\n",
    "custom_steps": "[1] Sign into an Xbox LIVE enabled gamer profile.\r\n[2] Proceed to Xbox LIVE Marketplace and download a piece of content between 50MB and 100MB (the content should not belong to the title in test – publishers should seek to download a generic video from Marketplace or content from another one of their own titles).\r\n[3] While the content is downloading, boot the title and proceed into gameplay.\r\n[4] Allow the background download to complete.\r\n[5] Ensure the user is able to continue with gameplay and the title is not affected by the background download completing.\r\n    [a] Report any instances of gameplay entering an unresponsive state, or the user being exited from gameplay. \r\n[6] Repeat steps [1] to [5] for all game modes.",
    "custom_expected": "Titles must properly detect and handle downloadable content downloading in the background whilst the title is running.\r\n\r\nFail Examples\r\n[1] After the user has selected to download any content in step [2] and then entered into gameplay, upon download completion the title will exit the user from gameplay without any notification.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712664,
    "title": "Generic: 000-47 Controller Disconnection",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 8,
    "custom_preconds": "Titles must not exhibit any negative reactions when a controller is disconnected.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Sign into a gamer profile.\r\n[3] Begin a play through.\r\n[4] Disconnect the Wired Controller at random points within the following areas (minimum of two times in each) –\r\n    [a] Normal gameplay.\r\n    [b] Loading.\r\n    [c] Saving.\r\n    [d] Transition screens.\r\n    [e] Full Motion Videos.\r\n    [f] Cut-scenes.\r\n    [g] Pause menu.\r\n    [h] Main menu.\r\n[5] Repeat step [4] using a Wireless Controller.\r\n[6] Repeat step [4] with Kinect if supported.",
    "custom_expected": "Titles must not exhibit any negative reactions when a controller is disconnected.\r\n\r\nPass Examples\r\n[1] No controller disconnection pop-up toasts are displayed on a Kinect Required title, resulting in the inability to navigate using the Xbox 360 controller until the controller is reconnected.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712665,
    "title": "Xbox LIVE: 000-95 Interoperability - Cross-Region",
    "section_id": 86361,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 9,
    "custom_preconds": "Faq\r\n[1] Consider completion of this test case to be when game invitations have been sent, received, accepted and declined by ALL versions of the title, and ALL versions have engaged in gameplay against one another. When accepting a game invitation, ensure the game session is launched and multiplayer gameplay is initiated. \r\n[2] The corresponding consoles for each region signing of the title will need to be used when testing; and where a version of the title supports more than 1 region, ensure the tests are performed on each console as follows:\r\n    - TITLE SIGNING = CONSOLE REGION\r\n        A-signed = North America\r\n        E-signed = Europe\r\n        J-signed = Asia\r\n        L-signed = North America & Europe\r\n        K-signed = North America & Asia\r\n        H-signed = Asia & Europe    \r\n        W-signed = North America, Asia & Europe\r\n",
    "custom_steps": "[1] Boot a different version of the title on each console.\r\n[2] Sign into Xbox LIVE with a gamer profile on each console.\r\n[3] Console A: Setup an Xbox LIVE multiplayer game session and invite all other consoles.\r\n[4] Verify the following on each console:\r\n    [a] Access the Xbox Guide menu and decline the game invitation.\r\n    [b] Access the Xbox Guide menu, accept the game invitation, and verify you are automatically connected to console A’s game session without having to search for it.\r\n[5] Console A: Start the game and verify all other consoles enter the game session as expected.\r\n[6] Verify that all versions are able to complete the game session without error. \r\n[7] Repeat steps [3] to [6] on all remaining versions until all have hosted and joined a game session.",
    "custom_expected": "Titles that support Cross Region multiplayer gameplay over Xbox LIVE must be able to play against/with other versions of the same title being distributed in different regions (i.e. E-signed version Vs. A-signed version, E-signed version Vs. a different E-signed version, etc).",
    "custom_steps_separated": null
  },
  {
    "id": 712670,
    "title": "000-37 User Interface Accessibility",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 1,
    "custom_preconds": "All aspects of a title’s user interface (UI) must be fully accessible to users when reasonably positioned within the sensor’s field of view.\r\n\r\nNA Examples\r\n[1] Titles that do not support the use of Kinect in any way are exempt from this requirement.\r\n",
    "custom_steps": "[1] Boot the title with the Kinect sensor positioned below 100cm in height and ensure changes in the following appearance characteristics do not result in in any negative effects through steps [1] – [5];\r\n[2] Verify you can successfully navigate through each of the featured NUI menus under the following scenarios;\r\n    [a] Ensuring that you are within the field of view, stand as close to the front of the play space as possible.\r\n    [b] Ensuring that you are within the field of view, move to within 15cm of the back left of the play space.\r\n    [c] Ensuring that you are within the field of view, move to within 15cm of the back right of the play space.\r\n[3] For all of the above steps, if the title cannot accommodate your position within the play space, ensure the title does not react in a negative manner and optionally provides troubleshooting advice to the user where appropriate.\r\n    [a] Troubleshooting can be an in-game advice message or an in-game calibration mode, but ultimately, titles must offer direction towards the Kinect Tuner when a blocking issue occurs. Titles may only invoke the NUI Tuner in response to a player action within the title.\r\n[4] Repeat steps [1] – [3] but this time ensuring the Kinect sensor is placed between 101cm and 150cm.\r\n[5] Repeat steps [1] – [3] but this time ensuring the Kinect sensor is placed between 151cm and 190cm.",
    "custom_expected": "All aspects of a title’s user interface (UI) must be fully accessible to users when reasonably positioned within the sensor’s field of view.",
    "custom_steps_separated": null
  },
  {
    "id": 712671,
    "title": "000-38 Gameplay Accessibility",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 2,
    "custom_preconds": "All aspects of gameplay must be fully accessible to users regardless of their body type.\r\n\r\n\r\nNA Examples\r\n[1] Titles that do not support the use of Kinect in any way are exempt from this requirement.\r\n",
    "custom_steps": "[1] Boot the title with the Kinect sensor positioned below 100cm in height and ensure changes in the following appearance characteristics do not result in in any negative effects through steps [1] – [6];\r\n    [a] Clothing.\r\n    [b] Hair length.\r\n    [c] Height.\r\n    [d] Body mass.\r\n    [e] Skin colour.\r\n    [f] Jewellery.\r\n[2] Verify you can successfully navigate through the initial identification process and can participate within all gameplay under the following scenarios;\r\n    [a] Ensuring that you are within the field of view, stand as close to the front of the play space as possible.\r\n    [b] Ensuring that you are within the field of view, move to within 15cm of the back left of the play space. Leave the play space during gameplay and then re-enter to continue gameplay.\r\n    [c] Ensuring that you are within the field of view, move to within 15cm of the back right of the play space. Leave the play space during gameplay and then re-enter to continue gameplay.\r\n[3] For all of the above steps, if the title cannot accommodate your position within the play space, ensure the title does not react in a negative manner and optionally provides troubleshooting advice to the user where appropriate.\r\n    [a] Troubleshooting can be an in-game advice message or an in-game calibration mode, but ultimately, titles must offer direction towards the Kinect Tuner when a blocking issue occurs. Titles may only invoke the NUI Tuner in response to a player action within the title.\r\n    [b] Users must not be blocked from progressing through the identification process when standing within specific zones if the field of view.\r\n[4] Repeat steps [1] – [3] but this time ensuring the Kinect sensor is placed between 101cm and 150cm.\r\n[5] Repeat steps [1] – [3] but this time ensuring the Kinect sensor is placed between 151cm and 190cm.\r\n[6] Repeat steps [2] – [6] for all remaining game modes.",
    "custom_expected": "All aspects of gameplay must be fully accessible to users regardless of their body type.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712672,
    "title": "000-39 Player Laterality",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 3,
    "custom_preconds": "The user must be able to use the hand of their choice for hand gestures, and the foot of their choice for foot gestures, when performing game specific actions.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Select a game mode that supports the use of Kinect.\r\n[3] Verify that you are able to perform all actions with your right and left foot, hand etc. (as applicable) unless clearly directed to use the left or right as part of a specific gaming scenario.\r\n[4] Repeat steps [2] – [3] for all remaining game modes that support the use of Kinect.",
    "custom_expected": "The user must be able to use the hand of their choice for hand gestures, and the foot of their choice for foot gestures, when performing game specific actions.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712673,
    "title": "000-40 Jump In Jump Out",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 4,
    "custom_preconds": "User experience should not be negatively affected if the user leaves and then returns to the sensor’s field of view.",
    "custom_steps": "[1] Boot the title.\r\n[2] Select a game mode that supports the use of Kinect.\r\n[3] During gameplay, leave the sensor’s field of view from the left, right and then rear of the play space.\r\n[4] Verify that the title gracefully handles each scenario.\r\n[5] Re-enter the field of view from a different position after performing each scenario is step [3].\r\n[6] Verify that you are able to continue gameplay.\r\n    [a] If the active user is unable to resume with gameplay, ensure the title provides the user with the relevant means to continue.\r\n[7] Leave the field of view again and have another tester enter the field of view.\r\n[8] Verify that the second user is either able to continue gameplay or is instructed that they are unable to continue due to a player change.\r\n    [a] If the new user is unable to continue from where the previous user left the play space, ensure the title provides the relevant messaging indicating as such, or allows the player to override and resume.\r\n[9] Repeat steps [2] - [8] for all remaining game modes.\r\n    [a] For game modes that support two or more players, ensure users are able to leave the play space and then return without issue.",
    "custom_expected": "User experience should not be negatively affected if the user leaves and then returns to the sensor’s field of view.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712674,
    "title": "000-42 Light Levels",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 5,
    "custom_preconds": "Titles must be fully functional when played in a low lit, reasonably lit and high lit room.\r\n",
    "custom_steps": "[1] Simulate home lighting by placing an up-light lamp at the far corner of the play space from the sensor.\r\n    [a] Ranges that should be simulated are 10 lux (lumen/m2) to 2,500 lux (lumen/m2).\r\n[2] Turn on the up-light and turn off any other lighting.\r\n[3] Boot the title.\r\n[4] Select a game mode that supports the use of Kinect.\r\n[5] Verify that all elements of the game mode can be completed without any impact from the lighting.\r\n[6] For all of the above steps, if the title cannot continue as intended, ensure the title does not react in a negative manner and provides troubleshooting advice to the user.\r\n    [a] Troubleshooting can be an in-game advice message, an in-game calibration mode or direction to navigate to the Kinect Tuner.\r\n[7] Repeat steps [1] – [6] for all remaining game modes.",
    "custom_expected": "Titles must be fully functional when played in a low lit, reasonably lit and high lit room.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712675,
    "title": "000-43 Unexpected Grammar and Gestures",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 6,
    "custom_preconds": "Titles must not show any negative effects as a result of users performing gestures or giving voice commands when they are not expected.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Navigate to an area of the title that supports the use of gestures or voice recognition.\r\n[3] Perform all supported gestures and issue all recognised voice commands from the publisher provided list.\r\n    [a] Verify all commands can be performed as expected. Where commands are inaccurately reflected in gameplay, make a note of the area and command used before consulting a test lead.\r\n[4] When performing gestures not expected by the title, verify the title does not exhibit any negative behaviour as a result of the performed gestures or issued voice commands.\r\n    [a] This should include performing actions and speaking grammar that is not expected and will not contribute to gameplay progression. For example, where asked to throw a ball, perform a kicking action instead. Where asked to speak a number, say a colour instead etc…\r\n[5] Repeat steps [3] – [4] for all remaining game modes.\r\n[6] Repeat steps [1] – [4] but have another user speak supported instructions from outside of the Kinect sensor field of view.\r\n    [a] Ensure the title correctly handles instructions spoken by another user not involved in the game. If the title does not allow progression due to interference, ensure the correct messaging is given and the user is helped to troubleshoot.\r\n",
    "custom_expected": "Titles must not show any negative effects as a result of users performing gestures or giving voice commands when they are not expected.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712676,
    "title": "000-44 Text Size",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 7,
    "custom_preconds": "Titles must ensure in-game text for all supported languages is readable from all positions within the play space.",
    "custom_steps": "[1] Boot the title.\r\n[2] Navigate to an area of the title that supports the use of natural input gestures.\r\n[3] Ensure in-game text is legible when standing centrally within the play space (approx. 180cm from the TV).\r\n[4] If the title requests that the user repositions themselves to the rear of the play space as part of gameplay (approx. 285cm from the TV), ensure all critical in-game text required for game progression is legible.\r\n    [a] Ensure in-game text is legible when using High Definition and/or Standard Definition TV of 32” or more.\r\n[5] Repeat steps [2] – [3] for all remaining game modes and in all supported languages.",
    "custom_expected": "Titles must ensure in-game text for all supported languages is readable from all positions within the play space.\r\n\r\nPass Examples\r\n[1] The text which displays within the options menu only, is marginally too small to read when standing at the rear of the play space.\r\n\r\nFail Examples\r\n[1] When the user is asked to stand at the back of the play space area, in-game text critical to gameplay progression is in a font size too small to read on a 32” TV.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712677,
    "title": "000-45 Speech Control Functionality",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 8,
    "custom_preconds": "If the title supports voice commands via the Kinect microphone sensor array, or secondary voice peripheral, all controls and commands must function without issue.\r\n",
    "custom_steps": "[1] Boot the title.\r\n[2] Enter a game mode and verify the functionality of all voice commands using the Kinect sensor and/or supported voice peripheral.\r\n[3] Verify that the title allows access to all game functions and commands using the Kinect microphone, without the use of any additional Headset/voice peripheral if not directed to.\r\n    [a] Ensure as many differing accents and dialects are tested against throughout gameplay and menus.\r\n[4] Repeat steps [2] – [3] in any remaining game modes.\r\n[5] If the Kinect title only supports voice control via a secondary peripheral rather than via the Kinect microphone array, ensure this is clearly messaged to the user within the title.\r\n[6] Repeat steps [2] – [5] for all supported modes.\r\n[7] Report any instances of the user’s speech going unrecognised or actions being received differently to how they have been given.",
    "custom_expected": "If the title supports voice commands via the Kinect microphone sensor array, or secondary voice peripheral, all controls and commands must function without issue.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712678,
    "title": "000-46 Controller Use",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 9,
    "custom_preconds": "Controller functionality should match that of the controller configuration UI displayed in game.\r\n",
    "custom_steps": "[1] Ensure a controller is connected to the console.\r\n[2] Boot the title.\r\n[3] Navigate to a controller configuration UI, (if available)\r\n[4] Enter a game mode and verify the button functionality against the controller configuration UI.\r\n[5] Repeat steps [1] to [4] for all other controller configurations.\r\n[6] Repeat steps [1] to [5] using Kinect for all supported gestures and actions.",
    "custom_expected": "Controller functionality should match that of the controller configuration UI displayed in game.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 712679,
    "title": "000-84 Profile Recognition",
    "section_id": 86362,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 130,
    "created_on": 1481739177,
    "updated_by": 130,
    "updated_on": 1481739177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13980,
    "display_order": 10,
    "custom_preconds": "If the title does not call XShowNuiSigninUI before entering an area of the title where a misidentification would have an effect on the player’s profile data, the title must recognise a gamer profile as valid for use in gameplay when signed in via auto sign-in, or via an Xbox 360 controller.",
    "custom_steps": "[1] Before booting the title, navigate to the Xbox Dashboard.\r\n[2] Sign into a gamer profile via Auto sign-in.\r\n     [a] Auto sign-in can be enabled by navigating to My Xbox > Profile > Profile > Sign-in Preferences > Xbox LIVE Auto Sign-in.\r\n[3] Boot the title, navigate past the initial interactive state and progress towards a game mode known to make a game save.\r\n[a] If the title opens the Sign-in UI to request that a user selects their gamer profile (by calling XShowNuiSigninUI), skip to step [5].\r\n[4] Verify the title recognises the user’s gamer profile is active by providing adequate feedback on-screen.\r\n     [a] Prior to taking the first profile-related action based on the result of an identification operation, the title must visually indicate the identification result to the player and provide him or her with a way to correct the result. If the title does not recognise the gamer profile signed in at step [2] as active, ensure the title provides the user with a notification that they currently have guest status, and that the user is required to sign-in to their gamer profile to save and/or unlock achievements.\r\n[b] For the above step, the title must not require the user to enter the Kinect Guide and manually confirm their identity.\r\n[5] Play far enough through the title until a game save is made and the criteria needed to unlock an achievement is fulfilled.\r\n[6] Open the Xbox Guide menu and verify the achievement has been successfully unlocked.\r\n[7] Repeat steps [1] – [6], this time signing in to a gamer profile using an Xbox 360 controller.",
    "custom_expected": "If the title does not call XShowNuiSigninUI before entering an area of the title where a misidentification would have an effect on the player’s profile data, the title must recognise a gamer profile as valid for use in gameplay when signed in via auto sign-in, or via an Xbox 360 controller.\r\n\r\nPass Examples\r\n[1] Although the title does not immediately identify a signed-in gamer profile when signed in via an Xbox 360 controller or auto sign-in, the title visually indicates the identification result to the player and offers a clear in-game option to correct the result.\r\n[2] Before reaching an area where misidentification would have an effect on a user’s profile data, users who are initially identified as signed-out are given the ability to correct their identity back to a signed-in gamer profile.\r\n[3] Although the title does not initially recognise the gamer profile signed in at step [2] as active, the title opens the NUI Guide menu when reaching step [3] to allow the user to re-select their identity.\r\n",
    "custom_steps_separated": null
  }
]