[
  {
    "id": 1213928,
    "title": "As a user I want to be able to search for Employee Transactions",
    "section_id": 146202,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153203260",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN the BOC or CLUB user logs in with Employee Transaction Permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on Search Type dropdown in Advance search \r\n\r\n",
    "custom_expected": "THEN \"Employee Transactions\" will appear as an option on the dropdown(in alphabetical order) for anyone that has Employee Transaction permissions\r\nAND The filters available when \"Employee Transactions\" has been selected will match the provided specs. \r\nAND Clicking search will search the database for any Employee Transactions that meet the applied filters.\r\nAND After results are found, the results will display according to the requirements.\r\nAND Users will be able to export these results to excel.\r\nAND Users will be able to export these results to pdf. \r\nAND Users will be able to use the type to filter option\r\nAND For BOC Users, all transactions are returned (with the exception of Suppressed, which are only returned if the user specifically adds that filter). \r\nAND For Club Users, only transactions that are in an Approved or higher state (Reversed) are returned if their Org does not match the Org of the transaction. \r\nAND For Club users, they can see employee transactions in any state that are for their own Org.\r\n\r\nSearch Requirements: \r\nhttps://wiki.mlbam.com/display/EBIS/Search+-+Employee+Transactions",
    "custom_steps_separated": null
  },
  {
    "id": 1212512,
    "title": "As a user I want a player's Approved for Next Season contract to be moved to Approved when the previous contract expires",
    "section_id": 146203,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151311110",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "Expired Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Expired+-+State+Change+Rules\r\nGIVEN a user is logged in as BOC approver\r\nAND an employee has a UEC with an Approved for Next Season status",
    "custom_steps": "WHEN currently Approved UEC is expired(either manually or via the Contract Expiration Batch)",
    "custom_expected": "THEN system should check to see if the employee has a UEC with an Approved for Next Season status\r\nAND if yes, the Approved for Next Season UEC should be moved to an Approved status",
    "custom_steps_separated": null
  },
  {
    "id": 1213926,
    "title": "As a user I do not want to be able to see UECs converted from 1 that I should not have permission to see",
    "section_id": 146203,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152948590",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "Permissions: \rhttps://wiki.mlbam.com/display/EBIS/UEC+-+Permissions\r\rAcceptance Criteria: \r* All UECs converted from ebis1 will need to follow he new permissions breakdown. The provided mapping should be used to determine which of the new \"permission groups\" should be able to view the historical UECs.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1213902,
    "title": "As a user I want to be able to run the Expire UEC batch",
    "section_id": 146203,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153202674",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN CLUB and BOC user  has employee permission \r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user navigates to \"Major Contracts\" section on the batch screen\r\n\r\n",
    "custom_expected": "THEN user should see \"UEC Expiration Batch\" option \r\nAND Clicking \"UEC Expiration Batch\" opens the batch in the batch screen. \r\nAND The batch parameters display per the batch requirements. \r\nAND A \"Run\" button is available. \r\nAND Clicking \"Run\" will run the batch according to the selected parameters. \r\nAND When the batch is run: \r\n    - Get all approved contracts to be expired (contracts whose latest service end date is in the past.)\r\n    - Iterate over contracts\r\n    - If there are no options - expire the contract\r\n    - If the last year is an option year - expire the contract only if none of the options are exercised.\r\n    - Any employees' whose contracts were expired and have contracts that were in \"Approved for Next Season\" state are updated to \"Approved\" state\r\n    - If the employee has an Approved, Approved for Next Season, or Submit Signed UEC for and it is for the same organization as the contract being expired, then if the employee‰Ûªs current position is different than the position in the contract not being expired, a reassign to org transaction is generated for the employee and Submitted to BOC.\r\n    - If any of the contracts being moved to an \"Approved\" state overlap with a current Approved contract, then update the status of the existing Approved contract to \"Superseded\" \r\n    - Any employees' whose contracts were expired who do NOT have an Approved, Approved for Next Season, or Submit Signed UEC for the same organization as the contract being expired should have a Remove Employee from Org transaction generated for them and Submitted to BOC.      \r\nAND Results will only include employees who had a contract updated by the batch and should display in the \"Batch Results\" widget. Available columns should be Errors, Player ID, Name (Last, Roster), Org (current Org), Contract ID, Signing Org (Org contract is with), \r\nStart Year, Non Option Yrs, Option Yrs, Status (Contract Status)\r\nAND Batch run information should display in the batch history widget.\r\n\r\nBatch Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/11.+UEC+Expiration+Batch",
    "custom_steps_separated": null
  },
  {
    "id": 1213893,
    "title": "As a BOC user I want expiring a contract to create a Remove from Org transaction, if applicable",
    "section_id": 146203,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152705529",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 4,
    "custom_preconds": "Expired Rule changes: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Expired+-+State+Change+Rules\r\nRemove Employee from Org Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4.+Remove+Employee+from+Org\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to expire a UEC (either manually or via expiration batch)\r\nAND the employee whose contract is being expired does NOT have an Approved, Approved for Next Season, or Submit Signed UEC for the same organization as the contract being expired",
    "custom_steps": "WHEN UEC is moved to an Expired state, either manually or via the batch",
    "custom_expected": "THEN a Remove Employee from Org transaction should be auto-created and submitted to the BOC\r\nAND all On Submit rules and updates should be made appropriately\r\nBUT if the employee DOES have an Approved, Approved for Next Season, or Submit Signed UEC for the same organization as the contract being expired then no Remove from Org should be created\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1216270,
    "title": "As a user I only want an Assign/Reassign transaction created on Submit Signed if the associated UEC will not be moved to Approved for Next Season on Approve",
    "section_id": 146203,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153612172",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516975890,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC or Club user logs in with UEC permission\r\nAND user is creating a UEC Approved for Next Season\r\nAND the position on the UEC is different from employee's current position\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user moves the UEC to Submit Signed Status\r\n\r\n",
    "custom_expected": "THEN system should not auto-create an Assign/Reassign for the employee",
    "custom_steps_separated": null
  },
  {
    "id": 1177590,
    "title": "As a User, I want the system to calculate the Employee-centric fields",
    "section_id": 146204,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150809692",
    "created_by": 103,
    "created_on": 1505155008,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "Wire:\r\nhttp://hri2kq.axshare.com/#p=employee_profile\r\nDate Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Employee+Profile+Header\r\nGIVEN a user is attempting to Create a new Employee Profile\r\nOR user is viewing an existing Employee Profile",
    "custom_steps": "WHEN user views the Employee Profile Header section",
    "custom_expected": "THEN the system should calculate and populate the following fields on the employee profile:\r\n   -- Contract Years\r\n   -- Years with Club\r\n   -- Years in Position\r\nAND these fields should be match the wirerame",
    "custom_steps_separated": null
  },
  {
    "id": 1216267,
    "title": "As a User, I want to see a Employee Bio Update reflected in the Player History",
    "section_id": 146204,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150636293",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516975913,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC or Club user logs in with Employee permission\r\nAND user opens an employee profile\r\n\r\n",
    "custom_steps": "WHEN Any of the following fields are updated and saved:\r\nDOB\r\nRoster Name\r\nFirst Name\r\nMiddle \r\nLast\r\nExtended Last\r\nAny field within the National ID section",
    "custom_expected": "THEN a line appears in the history of employees for the Bio Update of selected fields\r\nAND the Code = Employee Profile, the Date = date update is made, Description should be \"Bio update by *username*. \"\r\n\r\nNOTE: This story should include the ETL from 1 of any pre-existing history items. \r\n\r\nWire:\r\nhttp://hri2kq.axshare.com/#p=employee_profile\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Employee+Profile+Header\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212483,
    "title": "As a user I want submitting a UEC to auto-create an Assign/Reassign transaction for the employee",
    "section_id": 146205,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152357814",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN a club and BOC user is logged with edit employee contract permissions \r\nAND user is submitting a employee contract",
    "custom_steps": "When user clicks \"Submit\" button",
    "custom_expected": "THEN If the employee's current position does not match that contained in the UEC, then an Assign/Reassign Transaction is auto-created and submitted by the system for the position contained on the UEC.\r\nAND When a UEC is moved to a submit signed state, an Assign/Reassign Employee transaction is auto-created and submitted for the employee for the position indicated on the UEC. \r\nAND All stateflow changes and submission/approval updates should follow the Assign/Reassign rules as though it were created manually.",
    "custom_steps_separated": null
  },
  {
    "id": 1212549,
    "title": "As a user I want to be able to create a new Place on Temporarily Inactive List transaction for an employee",
    "section_id": 146206,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535073",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nWireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_temporary_inactive_list\r\nGIVEN a club or BOC user is logged in with Create New Permissions for Temp Inactive list tx",
    "custom_steps": "WHEN user navigates to an Employee Profile\r\nAND selects Create New",
    "custom_expected": "THEN \"Employee Transactions\" should be an option in the top-level dropdown\r\nAND \"Inactive List\" should be an option under Employee Transactions\r\nAND \"Place on Temporarily Inactive List\" should be an option in the third level dropdown\r\nAND selecting \"Place on Temporarily Inactive List\" from the Create New should check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Place on Temporarily Inactive List transaction for the same employee created within 10 days of the current date\r\nAND if a preliminary or rejected transaction already exists, the system should load the existing transaction in Edit Mode instead of opening a new transaction\r\nAND if a submitted transaction already exists, the system should load the existing transaction in View Mode\r\nBUT if no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system should load a new Preliminary transaction\r\nAND transaction should follow the wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1213911,
    "title": "As a user I want to submit a Place on Temporarily Inactive List transaction to the BOC for approval",
    "section_id": 146206,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535000",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN a club or BOC user is logged in with create/submit permissions for Place on Temporarily Inactive List transaction",
    "custom_steps": "WHEN user opens a new preliminary or rejected Place on Temporarily Inactive List transaction\r\n",
    "custom_expected": "THEN a Submit to BOC button is available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is blue. \r\nAND Submit button is available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is grey.\r\nAND clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND after the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \r\nAND system reloads the transaction in view mode, and displays a successful submit blue notification.  \r\nAND once the transaction has successfully been submitted, the system sets the employee's pending Status to \"Temporarily Inactive\".\r\nAND when a transaction reaches a status of \"Submitted to BOC\" an approval item will be generated and display on the BOC - Employee Transactions - Admin's Approvals widget. \r\nAND If a file is attached to the transaction, that is displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated on the transaction, they display in the Comments column of the Approvals widget.\r\nAND employee name is a hyperlink in the Approvals widget. Clicking on the employee name will open the profile (defaults to History tab) in the same window/tab. \r\nAND Type\" will be a hyperlink. Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.\r\nAND once the transaction has been successfully submitted, system creates an entry in employee's History in green font. Code = EETMPIN, Description = Place on Temporarily Inactive List, From Org.\r\n\r\nSee Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213912,
    "title": "As a BOC user I want to approve or reject a Place on Temporarily Inactive List transaction",
    "section_id": 146206,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535002",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions",
    "custom_steps": "WHEN the user is viewing Place on Temporarily Inactive List transaction (in view or edit mode) in Preliminary or Submitted",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved.  \r\nAND Update Player's Player History: Code = EETMPIN , Description = Place on Temporarily Inactive List , From Org/Club fields to be in black font. \r\nAND Update employee's Status to be Temporarily Inactive. \r\nOR BOC Approves see  \"Reject\" button when Temporarily Inactive List tx is in Submitted states \r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. See Messages #15.\r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Remove pending history entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1213919,
    "title": "As a user I want to edit an existing Place on Temporarily Inactive List transaction for an employee",
    "section_id": 146206,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534999",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 4,
    "custom_preconds": "See Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nGIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List transaction\r\n",
    "custom_steps": "WHEN user opens a Place on Temporarily Inactive List transaction",
    "custom_expected": "THEN an Edit button should be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state\r\nAND clicking  Edit should reload the form in edit mode, and a Save button should appear in place of the Edit button (no edit button displayed in edit mode)\r\nAND in Preliminary or Rejected state, Club users should be able to edit all portions displayed on the form\r\nAND BOC should be able to edit all fields in all states except for Approved and Reversed transactions\r\nAND in Approved and Reversed transactions, edit should only give Clubs access to attach new files, but they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND in Approved and Reversed transactions, edit should only give BOC access to attach new files or edit existing attachments. They should also be able to update \"Comments\" and \"BOC Notes\" fields, but they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND a Save button should be available anytime the form is in edit mode\r\nAND clicking Save should save the transaction and it's current values and reload the form in View mode\r\nAND transaction status should be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status should not change\r\nAND after a successful save the system should display a successful save blue notification\r\nAND whenever the form is in edit mode, the user should see a \"Cancel\" button on the form in grey\r\nAND clicking \"Cancel\" should prompt the user to confirm that they wish to cancel the changes they have made\r\nAND if they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction\r\nBUT if they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected\r\nAND if they do not confirm the cancellation then the user should be returned to the form and no action will be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1212551,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions - Basic",
    "section_id": 146207,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Temporarily Inactive list tx",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List tx",
    "custom_expected": "THEN user should be able to view and print all Temp InactiveList transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAnd user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. **Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org**\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212553,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions - Admin",
    "section_id": 146207,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 103,
    "created_on": 1510588707,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in with viewer permissions for Temporarily Inactive list tx",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive list tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view or print Transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. **Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org**\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1212544,
    "title": "As a user I want to receive an error if the employee I am creating a Place on Deceased List transaction for has an approved transaction after the entered assignment date",
    "section_id": 146208,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534707",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "Business Rule #7.06: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #3: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in with edit permissions for Deceased List tx\r\nAND user is attempting to submit or approve a Place on Deceased List tx\r\nAND Employee the tx is being created for has an approved transaction dated after the assignment date of the Deceased List tx\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should check if the Assignment date is before the latest approved transaction date for the player\r\nAND if the above condition is met on Clicking submit system should display Messages #3 as follows:\r\n \"A transaction cannot **be scheduled** before the date of the player's latest approved or pending transaction, on <TX Date>.\"\r\nAND \"Ignore and Continue\" button should be available (only for BOC and only on submit)\r\nAND clicking \"Ignore and Continue\" should continue with transaction submission\r\nAND \"Back\" button should be available \r\nAND clicking back should return user to point of entry\r\nBUT if the above condition is met on clicking Approve, system should display messages #3 as follows:\r\n\"A transaction cannot **occur** before the date of the player's latest approved or pending transaction, on <TX Date>.\"\r\nAND \"Back\" button should be available \r\nAND clicking back should return user to point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1212541,
    "title": "As a user I want to submit a Place on Deceased List transaction to the BOC for approval",
    "section_id": 146208,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152741305",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "Submission Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\nGIVEN a club or BOC user is logged in with create/submit permissions for Place on Deceased list tx\r\n",
    "custom_steps": "WHEN user opens a new preliminary or rejected Place on Deceased list tx in view or edit mode from create new\r\n",
    "custom_expected": "THEN a Submit to BOC button should be available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button should be blue\r\nAND Submit button should be available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button should be grey\r\nAND clicking Submit should run a required field and format check according to the data discovery\r\nAND if any fields are missing or formatted incorrectly, user should receive an error message\r\nAND clicking Submit will run the On Submit rules check (each covered in other test cases - this test case assumes they all pass)\r\nAND after the rules have passed, the system should update the status of the transaction to \"Submitted to BOC\"  \r\nAND system should reload the transaction in view mode, and display a successful submit blue notificationd\r\nAND once the transaction has successfully been submitted, the system should set the player's pending Status to \"Deceased\".\r\nAND when a transaction reaches a status of \"Submitted to BOC\" an approval item should be generated and display on the BOC - Employee Transactions - Admin's Approvals widget\r\nAND if a file is attached to the transaction, that should be displayed and available for download from the Attachments column of the Approvals widget\r\nAND if Comments are populated on the transaction, they should display in the Comments column of the Approvals widget\r\nAND player name should be a hyperlink in the Approvals widget. \r\nAND clicking on the player name should open the Player Profile (should default to Player History tab) in the same window/tab \r\nAND \"Type\" should be a hyperlink\r\nAND clicking on the type hyperlink of a submitted transaction should open the submitted transaction in view mode in the same window/tab\r\nAND once the transaction has been successfully submitted, system should create an entry in Player's Player History in green font. Code = DEAD (Not displayed on the front end), Description = Place on Deceased List, From Org.",
    "custom_steps_separated": null
  },
  {
    "id": 1212540,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Place on Deceased List transaction",
    "section_id": 146208,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534717",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "Reverse/Suppress Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nGIVEN a user is logged in as BOC approver\r\nAND a Place on Deceased List tx has been approved for an Employee\r\n",
    "custom_steps": "WHEN BOC approver opens the Approved Place on Deceased List tx",
    "custom_expected": "THEN user should see a \"Reverse\" button in grey (in view or edit mode)\r\nAND clicking \"Reverse\" should run all required field and formatting checks and display any relevant error or warning messages. On Submit rules should not be run\r\nAND a successful reverse notification should be displayed\r\nAND the transaction status should be updated to \"Reversed\"\r\nAND reversed transaction should display in player history with \"Voided\" in front of the transaction description. Example:\"Voided: Place on Deceased List\"\r\nAND system should set the employee's Status, Club and Org to their values from prior to the transaction approval\r\nAND users that have permission to suppress the form should see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode\r\nAND clicking \"Reverse and Suppress\" should first reverse, and then suppress the transaction\r\nAND clicking \"Suppress\" should suppress the transaction\r\nAND when a transaction is suppressed it should be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI\r\nAND clicking \"Reverse\" or \"Reverse and Suppress\", should check if the current transaction is the most recent approved transaction\r\nAND if the transaction is not the most recent approved transaction for the player, then the user should receive an error message\r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND user should ONLY have the back option\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1212519,
    "title": "As a user I want to be able to run the Contract Listing by Team Report",
    "section_id": 146209,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152122193",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN the Club/BOC user is in Reporting Widget\r\n\r\n",
    "custom_steps": "WHEN the user clicks the \"Contract Listing by Team\" report\r\n",
    "custom_expected": "THEN Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"Employees\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Contract+Listing+By+Team+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Contract+Listing+By+Team+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=118482784\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Contract+Listing+By+Team+-+Prompts\r\n\r\nView Story: #152122195",
    "custom_steps_separated": null
  },
  {
    "id": 1212515,
    "title": "As a user I want to be able to run the Employee Allowances - BOC Report",
    "section_id": 146209,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152124195",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN the BOC user is in Reporting Widget\r\n\r\n",
    "custom_steps": "WHEN the user clicks the Employee Allowances Report \r\n\r\n",
    "custom_expected": "THEN Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"Employees\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+BOC+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+BOC+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=118481678\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+BOC+-+Prompts\r\n\r\nView Story: #152124196",
    "custom_steps_separated": null
  },
  {
    "id": 1212516,
    "title": "As a user I want to be able to run the Employee Allowances - Club Report",
    "section_id": 146209,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152124333",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN the Club user is in Reporting Widget\r\n\r\n",
    "custom_steps": "WHEN the user clicks the Employee Allowances Report\r\n",
    "custom_expected": "THEN Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"Employees\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+Club+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+Club+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=118481822\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Allowances+Club+-+Prompts\r\n\r\nView Story: #152124334",
    "custom_steps_separated": null
  },
  {
    "id": 1212517,
    "title": "As a user I want to be able to run the Salary Survey - BOC Report",
    "section_id": 146209,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152121684",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 4,
    "custom_preconds": "GIVEN the BOC user is in Reporting Widget\r\n\r\n",
    "custom_steps": "WHEN the user clicks the \"Salary Survey - BOC\" report\r\n\r\n",
    "custom_expected": "THEN Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"Employees\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+BOC+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+BOC+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=118482559\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+BOC+-+Prompts\r\n\r\nView Story: #152121664",
    "custom_steps_separated": null
  },
  {
    "id": 1212518,
    "title": "As a user I want to be able to run the Salary Survey - Club Report",
    "section_id": 146209,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152122659",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 5,
    "custom_preconds": "GIVEN the Club user is in Reporting Widget\r\n",
    "custom_steps": "WHEN the user clicks the \"Salary Survey - Club\" report\r\n\r\n",
    "custom_expected": "THEN Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"Employees\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+Club+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+Club+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=118482687\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Salary+Survey+Club+-+Prompts\r\n\r\nView Story: #152122661",
    "custom_steps_separated": null
  },
  {
    "id": 1213935,
    "title": "As a user I want to submit a Place on Suspended List transaction to the BOC for approval",
    "section_id": 146210,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393970",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1515600141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN CLUB or BOC user logs in with Employee Transaction permission\r\n\r\n\r\n",
    "custom_steps": "WHEN the user opens a Place on Suspended List transaction in a preliminary or rejected state (in edit mode or view mode)\r\n\r\n\r\n",
    "custom_expected": "THEN Submit to BOC button is available to Club users in blue. \r\nAND Submit button is available for BOC users in grey.\r\nAND Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \r\nAND System reloads the transaction in view mode, and displays a successful submit blue notification.  \r\nAND Once the transaction has successfully been submitted, the system sets the employee's pending Status to \"Suspended\".\r\nAND When a transaction reaches a status of \"Submitted to BOC\" an approval item will be generated and display on the BOC - Employee Transactions - Admin's Approvals widget. \r\nAND If a file is attached to the transaction, that is displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated on the transaction, they display in the Comments column of the Approvals widget.\r\nAND Employee name is a hyperlink in the Approvals widget. Clicking on the employee name will open the profile (defaults to History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink. Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.\r\nAND Once the transaction has been successfully submitted, system creates an entry in employee's History in green font. Code = EESUSPD, Description = Place on Suspended List, From Org.\r\n\r\nSee Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/5.+Place+on+Suspended+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Suspended+List\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1216268,
    "title": "Place on Suspended List Permissions - Club - Employee Transactions - Basic",
    "section_id": 146210,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534771",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516982212,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Place on Suspended List tx",
    "custom_steps": "WHEN user attempts to do anything with Place on Suspended List tx",
    "custom_expected": "THEN user should be able to  view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view Transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able t see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1217400,
    "title": "Place on Suspended List Permissions - Club - Employee Transactions - Admin",
    "section_id": 146210,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 156,
    "created_on": 1516981895,
    "updated_by": 156,
    "updated_on": 1516982220,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN a club user is logged in with Admin permissions for Temporarily Inactive list tx",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions.\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1216272,
    "title": "As a user I want to be able to delete a Reinstate from Inactive List transaction",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520259",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516645616,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN the BOC or Club user logs in with create/edit Employee Transaction permission\r\nAND user opens a new preliminary or rejected Reinstate from Inactive List in view or edit mode",
    "custom_steps": "WHEN user click \"Delete\" button",
    "custom_expected": "THEN system will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1216271,
    "title": "As a user I want to be able to create a new Reinstate from Inactive List transaction for an employee",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520261",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516645624,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN the BOC or Club user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on create new menu icon for an employee\r\n\r\n\r\n",
    "custom_expected": "THEN \"Employee Transactions\" should an option in the top-level dropdown (already built)\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Reinstate from Inactive List\" should be an option in the third level dropdown.\r\nAND Selecting \"Reinstate from Inactive List\" from the Create New will check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Reinstate from Inactive List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary or rejected transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If a submitted transaction already exists, the system will load the existing transaction in View Mode.\r\nOR If no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List",
    "custom_steps_separated": null
  },
  {
    "id": 1216273,
    "title": "Reinstate from Inactive List Permissions - BOC - Employee Transactions - Admin",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534769",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516646413,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Reinstate from Inactive List Admin Permissions",
    "custom_steps": "WHEN user attempts to do anything with Reinstate from Inactive List tx",
    "custom_expected": "THEN user can view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND user can view all flags for all transactions and transaction attachments in all states.\r\nAND user can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND user can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.",
    "custom_steps_separated": null
  },
  {
    "id": 1217316,
    "title": "Reinstate from Inactive List Permissions - BOC - Employee Transactions - Basic",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534769",
    "created_by": 156,
    "created_on": 1516646197,
    "updated_by": 156,
    "updated_on": 1516646389,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 4,
    "custom_preconds": "GIVEN a club user is logged in with Employee Reinstate from Inactive List Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with Reinstate from Inactive List tx",
    "custom_expected": "THEN user can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1216269,
    "title": "As a user I want to view an existing Reinstate from Inactive List transaction",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520263",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516646437,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC or Club user logs in with Employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on Reinstate from Inactive List transaction in an employee's History or Advanced Search\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC: The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List",
    "custom_steps_separated": null
  },
  {
    "id": 1216274,
    "title": "Reinstate from Inactive List Permissions - Club - Employee Transactions - Basic",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534768",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516648343,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 6,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Reinstate from Inactive List transaction",
    "custom_steps": "WHEN user attempts to do anything with a Reinstate from Inactive List tx",
    "custom_expected": "THEN users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND users should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org.  Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1217317,
    "title": "Reinstate from Inactive List Permissions - Club - Employee Transactions - Admin",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534768",
    "created_by": 156,
    "created_on": 1516647710,
    "updated_by": 156,
    "updated_on": 1516648362,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 7,
    "custom_preconds": "GIVEN a club user is logged in with Club Admin permissions for Reinstate from Inactive List transaction",
    "custom_steps": "WHEN user attempts to do anything with a Reinstate from Inactive List tx",
    "custom_expected": "THEN users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND users should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should not be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1216275,
    "title": "As a user I want to submit a Reinstate from Inactive List transaction to the BOC for approval",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520258",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516648639,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 8,
    "custom_preconds": "GIVEN a club user is logged in with Admin permissions for a Reinstate from Inactive List transaction\r\n",
    "custom_steps": "WHEN user opens a new preliminary or rejected a Reinstate from Inactive List transaction",
    "custom_expected": "THEN Submit to BOC button is available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is blue. \r\nAND Submit button is available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is grey.\r\nAND Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \r\nAND System reloads the transaction in view mode, and displays a successful submit blue notification.  \r\nAND Once the transaction has successfully been submitted, the system sets the employee's pending Status to whatever it was prior to their being placed on the Inactive List. \r\nAND When a transaction reaches a status of \"Submitted to BOC\" an approval item will be generated and display on the BOC - Employee Transactions - Admin's Approvals widget. \r\nAND If a file is attached to the transaction, that is displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated on the transaction, they display in the Comments column of the Approvals widget.\r\nAND Employee name is a hyperlink in the Approvals widget. Clicking on the employee name will open the profile (defaults to History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink. Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.\r\nAND Once the transaction has been successfully submitted, system creates an entry in employee's History in green font. Code = EERSTIL, Description = Reinstate from (Inactive List) - with (Inactive List) replaced with the type of inactive list they are being reinstated from, From Org.\r\n\r\nSee Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1216276,
    "title": "As a BOC user I want to approve or reject a Reinstate From Inactive List transaction",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520257",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516649008,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 9,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Transaction Permissions",
    "custom_steps": "WHEN the user is viewing a Reinstate from Inactive List transaction (in view or edit mode) in Preliminary or Submitted",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue when they are viewing a transaction (in view or edit mode) in Preliminary or Submitted to BOC if applicable. \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved.  \r\nAND Update Player's Player History: Code = EERSTIL , Description = Reinstate from (Inactive List) , From Org fields to be in black font. \r\nAND Update employee's Status to be Suspended. \r\nOR BOC Approves see \"Reject\" button when Reinstate from Inactive tx is in Submitted states\r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. \r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Remove pending history entry.\r\n\r\nSee Approval/Rejection Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\r\n\r\nSee Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1216277,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Reinstate from Inactive List transaction",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520254",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516653301,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions",
    "custom_steps": "WHEN the user is viewing a Reinstate from Inactive List (in View or Edit mode) in the Approved state",
    "custom_expected": "THEN BOC Approvers see a \"Reverse\" button in grey\r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Major/Minor Outrightâ€￾\r\nAND Set the employee's Status, Club and Org to their values from prior to the transaction approval.\r\nAND Users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the employee's History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\nAND Clicking \"Reverse\" or \"Reverse and Suppress\", will check if the current transaction is the most recent approved transaction. \r\nAND If the transaction is not the most recent approved transaction for the employee, then the user will receive an error message. \r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND User will ONLY have the back option. Clicking Back will close the modal and return the user to the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1216278,
    "title": "As a Club user I want to be prevented from initiating a Reinstate from Inactive List transaction for an employee that does not belong to my Club",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520252",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516653501,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 11,
    "custom_preconds": "GIVEN a club user is logged in with create permissions for a Reinstate from Inactive List transactions",
    "custom_steps": "When user Selects \"Reinstate from Inactive List\" on  the Employee Transaction create new menu",
    "custom_expected": "THEN system will check if the employee's Current Org is set to the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nAND If the Org of the initiating user is not BOC or the Current Org of the employee, then display message #1.",
    "custom_steps_separated": null
  },
  {
    "id": 1216279,
    "title": "As a user I want to edit an existing Reinstate from Inactive List transaction for an employee",
    "section_id": 146212,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520239",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516653803,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 12,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for Reinstate from Inactive List Transaction",
    "custom_steps": "WHEN user opens a Reinstate from Inactive List Transaction",
    "custom_expected": "THEN an Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \r\nAND Clicking  Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode). \r\nAND In Preliminary or Rejected state, Club users will be able to edit all portions displayed on the form. \r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions. \r\nAND In Approved and Reversed transactions, edit only gives Clubs access to attach new files, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND Clicking Save will save the transaction and it's current values and reload the form in View mode.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \r\nAND After a successful save the system will display a successful save blue notification. \r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nBUT If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nAND If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List",
    "custom_steps_separated": null
  },
  {
    "id": 1216280,
    "title": "As a user I want to be able to view a Disqualified List transaction for an employee",
    "section_id": 146213,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153993608",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516717396,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in with Viewer permissions for a Disqualified List transaction for an employee\r\nAND users Advance search for Disqualified List Transaction ",
    "custom_steps": "WHEN user opens a Disqualified List transaction",
    "custom_expected": "THEN If any Disqualified List transactions existed for employees in ebis1, we need to build the UI and ETL them to ebis2. \r\nAND  the UI should matches player transaction.\r\nAND user should not be able to enter new, edit, save these transactions.\r\n\r\nWireframe:\r\nhttps://r6vcv1.axshare.com/#p=place_on_disqualified_list\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1216320,
    "title": "As a user I want to be able to edit an existing trainer/agent profile",
    "section_id": 146215,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154040281",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516730673,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for trainer/agent profiles \r\nAND user navigates to L1 Reg tab under International\r\nAND user select a trainer/agent from the widget\r\n",
    "custom_steps": "WHEN user click \"Edit\" button",
    "custom_expected": "THEN System will loads the trainer/agent profile in edit mode, per the wire and data discovery. \r\nAND When on the trainer/agent form in edit mode there is a save button and a cancel button available. \r\nAND Clicking \"Cancel\" will prompt the user to confirm that they are OK losing their changes. If they confirm, the system will discard the profile and return the user to the point of entry. If they do not confirm, they are returned to the profile in edit mode. \r\nOR Clicking \"Save\" will run a required field and format check for the profile and save the profile. \r\nAND Any updates made to the trainer/agent profile will be reflected in the Trainer/Agent widget as well as on the relevant International Amateur profiles.\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=trainer_agent_profile\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347878\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1216296,
    "title": "As a prod user I don't want to see any of the new International Amateur functionality until we are going to production",
    "section_id": 146215,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154065106",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516983434,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 27,
    "custom_preconds": "GIVEN prod user is logged in",
    "custom_steps": "WHEN user attempts to view new International Amateur functionality anywhere in the system",
    "custom_expected": "THEN Developers should have a way to show/hide the new International Amateur code without impacting the existing code/functionality.",
    "custom_steps_separated": null
  },
  {
    "id": 1216284,
    "title": "As a user I want to see a warning on a MN Reinstate from DL (for Concussion) if the player is on option",
    "section_id": 146216,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154072297",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516724228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC or club user logs in with approve/edit permissions for a MN Reinstate from DL (for Concussion)\r\nAND user select player that currently on Option with a MN Reinstate from DL (for Concussion) transaction in preliminary or Submitted to BOC status",
    "custom_steps": "WHEN user click Submit or Approve on a MN Reinstate from DL transaction",
    "custom_expected": "THEN system will check to see if the player is also currently on Option. \r\nAND If yes, and the player is being reinstated from a DL placement that includes a concussion, then display Messages #91. \r\nAND A flag should also appear on the BOC Approvals widget.\r\n\r\nMessages #91: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nBusiness Rules #20.12.1: \r\nhttps://wiki.mlbam.com/display/EBIS/20.+Reinstate+from+DL\r\n\r\nFlags: \r\nhttps://wiki.mlbam.com/display/EBIS/23.+DL+Flags",
    "custom_steps_separated": null
  },
  {
    "id": 1216285,
    "title": "As a user I want to see a warning on submit of a transfer to 60 Day MN DL transaction if the player is currently on Option",
    "section_id": 146216,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154072258",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516724214,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC or club user logs in with edit permissions for a transfer to 60 Day MN DL transaction\r\nAND user select player that currently on Option with a transfer to 60 Day MN DL transaction in preliminary status",
    "custom_steps": "WHEN user click Submit or Approve on a Mn Transfer to 60 Day DL transaction",
    "custom_expected": "THEN System will check to see if the player is also currently on Option. \r\nAND If yes, and the player is being transferred to the 60 Day DL for a concussion, then display Messages #90. \r\nAND A flag should also appear on the BOC Approvals widget.\r\n\r\nMessages #90: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nBusiness Rules #16.11: \r\nhttps://wiki.mlbam.com/display/EBIS/16.+Transfer+to+60-Day+DL\r\n\r\nFlags: \r\nhttps://wiki.mlbam.com/display/EBIS/23.+DL+Flags",
    "custom_steps_separated": null
  },
  {
    "id": 1216286,
    "title": "As a user I want to see a warning on submit of a 60 Day MN DL Placement if the player is currently on Option",
    "section_id": 146216,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154072250",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516724198,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC or club user logs in with edit permissions for a 60 Day MN DL Placement transaction\r\nAND user select player that currently on Option with a 60 Day MN DL Placement transaction in preliminary status",
    "custom_steps": "WHEN user click Submit or Approve on a MN Place on 60 Day DL transaction",
    "custom_expected": "THEN System will check to see if the player is also currently on Option. \r\nAND If yes, and the player is being placed on the 60 Day DL for a concussion, then display Messages #90. \r\nAND A flag should also appear on the BOC Approvals widget.\r\n\r\nMessages #90: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nBusiness Rules #15.11.1: \r\nhttps://wiki.mlbam.com/display/EBIS/15.+Place+on+60-Day+DL\r\n\r\nFlags: \r\nhttps://wiki.mlbam.com/display/EBIS/23.+DL+Flags",
    "custom_steps_separated": null
  },
  {
    "id": 1216287,
    "title": "As a user I want to see a warning on submit of a 7 Day MN DL Placement if the player is currently on Option",
    "section_id": 146216,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154072249",
    "created_by": 103,
    "created_on": 1515600202,
    "updated_by": 156,
    "updated_on": 1516975789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20286,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC or Club user logs in with DL permission\r\nAND user initiated a 7 Day MN DL transaction for a player who is currently on Option\r\n\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" on a MN Place on 7 Day DL transaction\r\n",
    "custom_expected": "THEN system will check to see if the player is also currently on Option. \r\nAND If yes, and the player is being placed on the 7 Day DL for a concussion, then display Messages #90. \r\nAND A flag should also appear on the BOC Approvals widget.\r\n\r\nMessages #90: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nBusiness Rules #14.11.1: \r\nhttps://wiki.mlbam.com/display/EBIS/14.+Place+on+7-Day+DL\r\n\r\nFlags: \r\nhttps://wiki.mlbam.com/display/EBIS/23.+DL+Flags\r\n\r\n",
    "custom_steps_separated": null
  }
]