[
  {
    "id": 1225567,
    "title": "As a BOC user I want to add a form to the System Forms widget",
    "section_id": 148404,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156901416",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with System Forms widget edit permissions\r\nWHEN user navigated to the System Forms widget",
    "custom_steps": "WHEN user click on \"Create New\" button on the System Forms widget",
    "custom_expected": "THEN user clicking this button allows the user to select \"Form\" \r\nAND If they click \"Form\" then a new row is added to the widget in edit mode.\r\nAND There should be a \"Save\" button and a \"Cancel All Changes\" button in the widget footer.\r\nAND The user should be able to populate the widget, per the data discovery, including uploading a new form. \r\nAND Clicking the red x on the row should cancel the addition of the form, and the entire row should be discarded. \r\nAND Clicking \"Save\" should run a required field check on the newly added form and, assuming the required field check passes, store the uploaded form with the entered information. \r\nAND Once the form has been saved, the form should be available for download from the widget by clicking on the paperclip icon.\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=forms\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+System+Forms+widget",
    "custom_steps_separated": null
  },
  {
    "id": 1225575,
    "title": "As a BOC user I want to add a new Country/Region to the system forms widget",
    "section_id": 148404,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156901509",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user logs in with system forms widget edit permission",
    "custom_steps": "WHEN user clicks on \"Create New\" button on the System Forms widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN system will allows the user to select \"Country/Region\" \r\nAND If they click \"Country/Region\" the system opens up a pop-up, per the provided wireframe and data discovery. \r\nAND The user has the ability to indicate if they are adding a new single country, or a new region composed of multiple countries.\r\nAND If they select Single, then the provided dropdown only allows them to select a single country. \r\nBUT If they select Multiple Countries/Parts of a Country, then a \"Label\" text field is available in addition to a multi-select dropdown where they can pick a number of countries. \r\nAND If \"Single Country\" is selected, they should only be allowed to select countries that are not already available as a single country in the System Forms widget. (The full list available should be composed of the same list of countries we use everywhere in the system)\r\nBUT If \"Multiple Countries\" is selected, they should be able to select any country - but should not be able to select any single country more than once for the SAME Region (in other words, Dominican Republic can be in 3 different regions - but can only appear once in each). \r\nAND Once the required values have been entered, the \"Save\" button becomes enabled. \r\nAND The \"Cancel\" button is always enabled. \r\nAND Clicking Cancel will close the modal and no new country or region is stored.\r\nAND Clicking Save will store the new Country/Region.\r\nAND The new Country/Region will be available for use when creating new and editing existing system forms.\r\nAND When viewing the system forms widget, if a \"Region\" is selected for a form, in view mode there should be an information i icon that allows the user to view the full list of countries associated with that Region.\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=new_country_region\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89350246",
    "custom_steps_separated": null
  },
  {
    "id": 1227668,
    "title": "As a BOC user I want the Level 2 Possibles widget to be prepopulated",
    "section_id": 148615,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155302618",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531940438,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Possible+L2+Widget+-+Data+Discovery\r\nGIVEN a BOC user is logged in with permission view the Level 2 Possibles widget",
    "custom_steps": "WHEN user navigates to L2 Possibilities Widget",
    "custom_expected": "THEN the L2 Possibilities widget should be automatically prepopulated with any player that has an International Workout report approved for them that identifies them as a Group 1, Group 2 or Group 3 player\r\nAND this also means that approving an International Workout report that identifies the player as a Group 1, 2 or 3 player should auto-check the L2 Possibility checkbox on the player's profile\r\nAND the delivery of this story should also include the removal of the \"Report\" column from the widget\r\nAND if a player is manually removed from the widget, they should not reappear just because they have the report on file - but approving a NEW report for them should cause them to reappear\r\nAND players added to the widget that have a scouting report on file should have the OFP and Group columns populated appropriately, even if they were not automatically added to the widget, and regardless of the OFP/Group identification\r\nAND if the player has more than one, system should use the latest Approved",
    "custom_steps_separated": null
  },
  {
    "id": 1227685,
    "title": "As a BOC user I want to see Unregistered players in the Registration Admin",
    "section_id": 148617,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157988853",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531942583,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC reg admin user is logged in with permission to view the Reg Admin Widget\r\n",
    "custom_steps": "WHEN user navigates to the Reg Admin Widget",
    "custom_expected": "THEN Unregistered International Prospects should only appear in the Registration Admin widget if they are Approved\r\nAND International Suspects should now appear in the widget under the \"Unregistered\" filter, or if the filter is set to \"All\"",
    "custom_steps_separated": null
  },
  {
    "id": 1225594,
    "title": "As a user I want to be able to run the International Consolidated Search Report",
    "section_id": 148406,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156903010",
    "created_by": 103,
    "created_on": 1525440653,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 3,
    "custom_preconds": "Report Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Intl+Consolidated+Search+-+Report+Layout\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Intl+Consolidated+Search+-+Report+Details\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347957\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Intl+Consolidated+Search+-+Report+Prompts\r\nReport Security: \r\nhttps://wiki.mlbam.com/display/EBIS/Intl+Consolidated+Search+-+Security+-+Frequency\r\nGIVEN \"International Consolidated Search\" is a report in the Report listing widget",
    "custom_steps": "WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND the category of this report should be \"International\"\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should continue to use the existing LDAP",
    "custom_steps_separated": null
  },
  {
    "id": 1226108,
    "title": "As a user I want running the All Registered Players List Report to download a pdf",
    "section_id": 148406,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157988667",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 4,
    "custom_preconds": "GIVEN user logs with permission to print reports\r\nAND the user is in Reporting widget\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user selects the report from the widget",
    "custom_expected": "THEN system will launch the prompts according to the requirements. \r\nAND Entering the desired prompts and running the report will download a pdf of the selected report to the user's computer. ",
    "custom_steps_separated": null
  },
  {
    "id": 1225581,
    "title": "As a BOC user I want Create New International Amateur player attempts tracked",
    "section_id": 148407,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902067",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user is logged in with Edit International Amateur permissions\r\nAND user is creating new Intl amateur player",
    "custom_steps": "WHEN user clicks \"Next\" or \"Register\" from the New Player form for international amateurs\r\n",
    "custom_expected": "THEN the system will keep a record of every time a user hits \"Next\" or \"Register\" from the New Player form for international amateurs. \r\nAND the system will keep a record of the following information about each attempt: \r\n - Username of the user conducting the search\r\n - Org of the user conducting the search\r\n - Date of the search\r\n - Time of the search (EST)\r\n - The value entered for First Name\r\n - The value entered for Last Name\r\n - The value entered for National ID\r\n - The value entered for Home Country\r\n - The value entered for Birth Country\r\n - The value entered for DOB\r\n - The value entered for Birth District/Province\r\n - The value entered for Birth City\r\n - The value entered for Birth Sector\r\n - The value entered for Twin Count\r\n - How many results were returned\r\nAND Each time the user hits \"Next\", \"Register\" or \"Check Registration\" is considered a new and unique search. \r\nAND Spreadsheet upload is also considered a Check Registration workflow and should be tracked accordingly.",
    "custom_steps_separated": null
  },
  {
    "id": 1226048,
    "title": "As a BOC user I want the actions taken after an International Amateur Create New attempt tracked",
    "section_id": 148407,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902114",
    "created_by": 103,
    "created_on": 1526931591,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Create New International Profile permissions\r\nAND user navigated to the International Amateur Create New Tab\r\n\r\n",
    "custom_steps": "WHEN user tries to Create New International Amateur Profile",
    "custom_expected": "THEN the system will need to keep a record of the following information about the actions taken for each search: \r\n - Profiles opened as a result of the search. (Last, First and Player ID)\r\n - Whether the user \"tagged\" the player as a result of the search.\r\n - Whether the user created a Contract as a result of the search. \r\n - Whether the user registered the player as a result of the search.",
    "custom_steps_separated": null
  },
  {
    "id": 1226102,
    "title": "As a BOC user I want the actions taken after an International Amateur advanced search tracked",
    "section_id": 148407,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902113",
    "created_by": 103,
    "created_on": 1528213632,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 4,
    "custom_preconds": "GIVEN logic is in place to track International Advanced Search attempts and Actions taken after International Advance Search",
    "custom_steps": "WHEN a user Advanced Searches for an International player\r\n",
    "custom_expected": "THEN system should keep a record of the following information about the actions taken for each search: \r\n - Profiles opened as a result of the search. (Last, First and Player ID)\r\n - Whether the user \"tagged\" the player as a result of the search.\r\n - Whether the user created a Contract as a result of the search. \r\n - Whether the user registered the player as a result of the search.\r\nAND this tracked data can be verified via the International Consolidated Search Report",
    "custom_steps_separated": null
  },
  {
    "id": 1225612,
    "title": "As a scouting user I want to create an Unregistered player profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156057844",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur\r\nGIVEN a new LDAP has been created that allows users to see the Create New tab on the Scouting Dashboard",
    "custom_steps": "WHEN a scouting user that has this LDAP logs in",
    "custom_expected": "THEN user should see Scouting as an option on the Left Nav\r\nAND the user should be able to see a \"Create New\" tab on the \"Scouting\" dashboard\r\nAND loading the Create New tab on the Scouting Dashboard should load the create new international player form per the provided wireframe (Option should read \"Unregistered International Amateur\")\r\nAND there should only be one option available right now  \r\nAND the \"Next\" button should enable once all required fields have been entered\r\nAND clicking \"Next\" with a date of birth entered that indicates that the player is subject to registration (after-09/01/1995) should load a new International Amateur profile per the provided wireframe and data discovery. (Use the MLSB column for required fields and fields to display)\r\nAND the Scouting Status for these players should default to International Prospect\r\nAND users should only be able to manually change this to International Suspect\r\nAND LDAP should be added to test_ebis_user73@mlb.com through test_ebis_user76@mlb.com users created in #156057810 (77 and 78 purposely left off)\r\n\r\n*For now - ONLY test by entering players who are genuinely subject to registration -  We are going to trigger an error for grandfathered players but that is covered in another test case",
    "custom_steps_separated": null
  },
  {
    "id": 1225613,
    "title": "As a scouting user I want to save an Unregistered International Amateur profile as Preliminary",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156057851",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 2,
    "custom_preconds": "GIVEN Scouting user logs in with Permission to create/edit Unregistered International Amateur profile",
    "custom_steps": "WHEN the user is creating a new Unregistered International Amateur profile\r\n\r\n",
    "custom_expected": "THEN there should be a \"Save\" button as well as a \"Cancel\" button. \r\nAND Clicking Cancel will ask the user to confirm that they wish to lose their changes. If they confirm, then the creation process should be canceled, the profile should be discarded and the user should be returned to their point of entry.\r\nAND Clicking \"Save\" will save the profile as \"Preliminary\".\r\nAND No required field or formatting checks are run when saving a profile in preliminary\r\nAND Preliminary scouting profiles should appear on the Scout's Clipboard\r\n\r\n*NOTE: The stateflow for international amateurs is different depending on the Scouting Status. This test case refers to the creation of International Prospects, so the Scouting Status MUST be set to that for this flow.*",
    "custom_steps_separated": null
  },
  {
    "id": 1225711,
    "title": "As a scouting user I want to Submit a new International Amateur profile for review(International Prospects)",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156328629",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 3,
    "custom_preconds": "**NOTE: The stateflow for international amateurs is different depending on the Scouting Status. This test case refers to the creation of International Prospects, so the Scouting Status MUST be set to that for this flow.**\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to Submit new International Amateur profiles",
    "custom_steps": "WHEN scouting user opens a preliminary player profile in view mode",
    "custom_expected": "THEN user should have an Edit, Submit and Close button\r\nAND clicking Close should close the profile\r\nBUT when the profile is in Edit Mode, user should have a Save, Submit and Cancel button\r\nAND clicking \"Save\" should save any edits made to the profile\r\nAND no required field and formatting checks should be run given that the profile is in a Preliminary state\r\nAND the profile's status should not update\r\nAND clicking \"Cancel\" should ask the user to confirm that they wish to lose any changes\r\nAND if the user confirms, the profile's status should remain preliminary and the profile should reload in view mode\r\nAND clicking \"Submit\" should run a required field and formatting check per the data discovery\r\nAND once the profile has passed the required field and formatting checks, if the profile was in edit mode, it should be reloaded in view mode\r\nAND the player's status should update to \"Submitted\"\r\nAND the status should be reflected on the creating scout's Clipboard\r\nAND the player profile should appear for review on the scouting Admin's Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1225614,
    "title": "As a scouting admin I want to Approve a new Unregistered player profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156328637",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 4,
    "custom_preconds": "GIVEN a new permission has been created to control the approval of Unregistered International Amateur profiles\r\n\r\n\r\n",
    "custom_steps": "WHEN a user with approval permissions is viewing an Unregistered International Amateur profile that is in a Preliminary, Submitted or Rejected status",
    "custom_expected": "THEN an Approve button should be available in edit or view mode\r\nAND clicking \"Approve\" should save any edits made to the profile\r\nAND all required field and formatting checks should be run at this point \r\nAND once the field checks pass, the profile's status should be updated to \"Approved\"\r\nAND if the form was in edit mode, it should reload in view mode\r\nAND the player profile should appear as an Unregistered player in the Registration Admin widget\r\n\r\n**NOTE:New User set up to test this with: Org of BOC, Pro Player Viewer role, as well as the new intl-user LDAP and the new LDAP mentioned in the first AC, should be posted in the comments on attached story**\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1226031,
    "title": "As a scouting user I want to create an International Suspect profile for a player",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329676",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 5,
    "custom_preconds": "GIVEN Scouting user logs in with Permission to create an International Suspect profile for a player\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on Create New tab",
    "custom_expected": "THEN system will load the create new international player form\r\nAND The \"Next\" button will enable once all required fields have been entered.\r\nAND Clicking \"Next\" will load the appropriate profile based on whether or not the player is subject to registration.\r\nAND The Scouting Status will default to International Prospect. Users will only be able to manually change this to International Suspect. \r\nAND Changing the Scouting Status to \"International Suspect\" will remove the \"Submit\" button from the profile form. \r\nAND The required field markers should also update to only show the fields required to create an International Suspect.\r\nAND Switching back to \"International Prospect\" should re-display the Submit button and adjust the required field markers. \r\nAND When \"International Suspect\" is set as the Scouting Status, clicking \"Save\" will run a required field and format check per the data discovery. \r\nAND Fields required for saving a profile as a Suspect are indicating in the data discovery by the note \"req'd for suspect\". \r\nAND On successful save, the system will display a successful save notification and reload the profile in View mode. \r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226032,
    "title": "As a scouting user I want to convert an International Suspect profile to an International Prospect",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329771",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 6,
    "custom_preconds": "GIVEN Scouting user logs in\r\n\r\n",
    "custom_steps": "WHEN user loads an existing \"International Suspect\" profile",
    "custom_expected": "THEN Scouts will see an \"Edit\" and \"Close\" button. \r\nAND In edit, the scout will be able to update the scouting status to \"International Prospect\", which should display the Submit button and adjust the required field markers. There should not be a \"Save\" button. \r\nAND Clicking \"Submit\" should run a required field and format check, just as though the scout were creating and submitting a new international amateur profile. \r\nAND The player should appear as a Submitted New Player on the Scout Clipboard, and the Admin Clipboard.\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226109,
    "title": "As a scouting user I want to see a warning if I am attempting to enter a new unregistered player profile that matches another profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329416",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 7,
    "custom_preconds": "GIVEN Scouting user logs in with permission to create unregistered player profile\r\n\r\n\r\n",
    "custom_steps": "WHEN user tries to create unregistered player profile that matches another profile\r\n\r\n",
    "custom_expected": "THEN Clicking \"Next\" on the Create New when creating a new Unregistered player profile will run a duplicate check according to the provided rules. \r\nAND If a match is found to another international player profile that the user has permission to see as a match, then the user gets an error. See Messages #7. \r\nAND The same visibility rules should also apply to the \"Add Player\" check on Daily Reports.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1227655,
    "title": "As a scouting user I want to see an error if I attempt to create a Grandfathered profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499595",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1529442970,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 8,
    "custom_preconds": "Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scout is logged in with permission to create unregistered profiles",
    "custom_steps": "WHEN user loads the Create New tab on the Scouting Dashboard ",
    "custom_expected": "THEN system should load the create new international player form per the provided wireframe (Option should read \"Unregistered International Amateur\")\r\nAND the \"Next\" button should enable once all required fields have been entered\r\nAND clicking \"Next\" with a date of birth entered that indicates that the player is NOT subject to registration (pre-9/1/95), should result in an error (Messages # 50):\r\n\"You may not create an Unregistered profile for a player who is not subject to registration. Please use the New Player form on the International dashboard to create a grandfathered profile.\" \r\nAND only \"Back\" button should be available\r\nAND clicking \"Back\" should return user to point of entry\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227656,
    "title": "As a scouting user I want to delete a preliminary International Amateur profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156328653",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1530279319,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 9,
    "custom_preconds": "GIVEN a scouting user is logged in",
    "custom_steps": "WHEN user opens a Preliminary International Amateur Profile",
    "custom_expected": "THEN user should see a Delete button in view or edit mode\r\nAND clicking \"Delete\" should prompt the user to confirm that they wish to delete the profile\r\nAND confirming the delete should assign the profile a deleted status and throw a blue notification \"Successfully deleted\"\r\nAND this action can also be done via the Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1227658,
    "title": "As a Club user I no longer want to see the MLSB Group 1 or Group 2 field or Scouting Status field on international amateur profiles",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953914",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531933272,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 10,
    "custom_preconds": "GIVEN a club user is logged in with permission to view international amateur profiles",
    "custom_steps": "WHEN user navigates to an international amateur profile",
    "custom_expected": "THEN the \"Group 1 or Group 2\" field on the international amateur player profile should no longer be visible to non-BOC users\r\nAND the Scouting Status field on the international amateur player profile should no longer be visible to non-BOC users",
    "custom_steps_separated": null
  },
  {
    "id": 1227688,
    "title": "As a Scout I want to view an existing International Amateur Player profile",
    "section_id": 148408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157956180",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531943010,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 11,
    "custom_preconds": "GIVEN a scout user is logged in \r\n",
    "custom_steps": "WHEN user attempts to view an existing Intl Amateur Player profile",
    "custom_expected": "THEN opening an existing Unregistered profile should display per the provided wireframe and data discovery\r\nAND opening an existing Registration profile should display per the provided wireframe and data discovery\r\nAND these users should not see BOC or Club entered Contact Information\r\nBUT these users should see \"Scout\" entered Contact Information\r\nAND opening an existing Grandfathered profile should display the same as if the user were a Club or regular BOC user\r\nAND if the user IS NOT identified as a Scout, then the international player profiles should load as they always have for a regular registration user",
    "custom_steps_separated": null
  },
  {
    "id": 1225616,
    "title": "As a user I want to view an existing International Signable Report",
    "section_id": 148409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155455072",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and Club user logs in with International Signable Report permission\r\nAND an international ama player has existing International Signable Report\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in international player's Scouting History widget",
    "custom_expected": "THEN the Report Type should be clickable hyperlink on the player's Scouting History widget. \r\nAND Clicking the hyperlink for International Signable reports opens the report in the same window.\r\nAND The report follows the provided wireframe and data discovery.  \r\nAND The browser tab text says \"Signable Report(or if a code exists for this use that instead) - Last, First\"\r\nAND There is a Close button on the Report in view mode. Clicking close will return the user to their point of entry.\r\n\r\n*Note that there are 2 different sets of fields/layouts depending on the position used for the report. If the player report is for a pitching position, use the pitching fields provided - otherwise use the position player fields*\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=prospect_report\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Prospect+or+Signable+Report+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1225622,
    "title": "As a scouting user I want to create a new Daily Report",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271617",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report\r\nhttps://s8xnnx.axshare.com/#p=daily_report_1\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to create Daily Reports",
    "custom_steps": "WHEN user navigates to the International \"Create New\" screen",
    "custom_expected": "THEN the \"Type\" dropdown should contain \"Daily Report\"\r\nAND selecting \"Daily Report\" should display per the provided wireframe\r\nAND clicking \"Next\" should take the user to a new Daily report, per the provided data discovery and wireframe\r\nAND the \"Add Player\" button should enable if all of the required fields are populated\r\nAND clicking \"Add Player\" should add a new player block to the top of the Report per the provided wireframe\r\nAND the user should be able to populate the block accordingly\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1226027,
    "title": "As a scouting user I want to Submit a new Daily Report for review",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499928",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 4,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to submit a new Daily Report",
    "custom_steps": "WHEN scouting user opens a preliminary daily report in view mode",
    "custom_expected": "THEN user should have an Edit, Submit and Close button\r\nAND clicking Close should close the report\r\nAND when the report is in Edit Mode, they should have a Save, Submit and Cancel button\r\nAND clicking \"Save\" should save any edits made to the report\r\nAND no required field and formatting checks should be run given that the report is in a Preliminary state\r\nAND the report's status should not update\r\nAND clicking \"Cancel\" should ask the user to confirm that they wish to lose any changes\r\nAND if the user confirms, the report's status should remain preliminary and the report should reload in view mode\r\nAND clicking \"Submit\" should run a required field and formatting check per the data discovery\r\nAND once the report has passed the required field and formatting checks, if the report was in edit mode, it should be reloaded in view mode\r\nAND the report's status should update to \"Submitted\", and the status should be reflected on the creating scout's Clipboard\r\nAND the report should appear for review on the scouting Admin's Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1225625,
    "title": "As a scouting user I want to approve a new Daily Report",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271808",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 5,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to approve Daily Reports",
    "custom_steps": "WHEN user is viewing a Daily Report that is in a Preliminary status in Edit Mode ",
    "custom_expected": "THEN Save, Approve, and Cancel buttons should be available\r\nAND clicking \"Cancel\" should prompt the user to confirm that they wish to lose their changes\r\nAND if they confirm, the report should be reloaded in view mode and no changes should be saved\r\nAND clicking \"Save\" should save any edits made to the report\r\nAND no required field and formatting checks should be run given that the report is in a Preliminary state\r\nAND the report's status should not update\r\nAND clicking \"Approve\" should save any edits made to the report\r\nAND at this point all required field and formatting checks should be run\r\nAND once the field checks pass, the form should be reloaded in View Mode, and the report's status should be updated to \"Approved\"\r\nAND the report should appear in the Scouting History widget of any existing player that is contained in the report\r\n\r\n*A submitted state MAY be added in the future, but for now we can assume that anyone who can create/edit an International Daily Report can Approve them.*",
    "custom_steps_separated": null
  },
  {
    "id": 1226115,
    "title": "As a scout admin I want to reject a new Daily Report",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157829427",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 8,
    "custom_preconds": "GIVEN a scout admin is logged with the permissions to reject a new Daily Report\r\nAND a scout admin navigated to their Admin Clipboard \r\nAND a scout admin opens the submitted report from the Clipboard in edit mode",
    "custom_steps": "WHEN a scout admin click \"Reject\" button ",
    "custom_expected": "THEN system will save any edits made to the report. No required field or format checks are run. \r\nAND A blue notification will be thrown \"Successfully Rejected\"\r\nAND The report's status should be updated to \"Rejected\". \r\nAND The report entry should be removed from the Admin Clipboard.\r\nAND The Scout's Clipboard entry should be updated to \"Rejected\".\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227653,
    "title": "As a scout I want to see an error if attempting to submit a Daily Report without at least one player",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955254",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1529440700,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 9,
    "custom_preconds": "Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scout is logged in with permission to submit daily reports\r\nAND user has a new daily report open in edit mode",
    "custom_steps": "WHEN user clicks \"Submit\" on a Daily Report",
    "custom_expected": "THEN system should verify that at least one player has been added to the report\r\nAND if not system should display an error(Messages #49):\r\n\"You must include at least one player.\"\r\nAND only a \"Back\" button should be available\r\nAND clicking \"Back\" should take user back to point of entry\r\nAND this check should also be run on approve",
    "custom_steps_separated": null
  },
  {
    "id": 1227661,
    "title": "As a scouting user I want submitting a Daily Report to automatically create profiles for any players included in the report that do not yet exist in the system",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953827",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531934881,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 11,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_1\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in\r\nAND user is attempting to submit a Daily report with one or more players added that were manually added to the report (did not already have a profile in the system)",
    "custom_steps": "WHEN user clicks \"Submit\" on a Daily Report ",
    "custom_expected": "THEN system should automatically create an International Suspect profile for any player included in the report that was manually added to the report\r\nAND the profile created should have a scouting status of International Suspect\r\nAND the profile's information should be populated according to the information entered by the Scout on the Daily Report\r\nAND the profile should be automatically Approved\r\nAND this should ALSO be done on Approve in case any new profiles were added to a Submitted report\r\nAND the International Suspect profile should show the Daily Report in their Scouting History",
    "custom_steps_separated": null
  },
  {
    "id": 1227672,
    "title": "As a scout I want to see an error if attempting to submit a Daily Report for a future date",
    "section_id": 148410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955250",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531940467,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 12,
    "custom_preconds": "GIVEN a scouting user is logged in with permission to Submit Daily Report\r\nAND user opens a preliminary Daily Report in view or edit mode\r\n",
    "custom_steps": "WHEN user click \"Submit\" button",
    "custom_expected": "THEN The system will verify that the Report Date is not in the future. If the date is in the future, display an error. See Messages #48. \r\nAND This check should also be run on approve.\r\n\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226026,
    "title": "International Daily Report - Permissions",
    "section_id": 148411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499660",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in that has any of the following permissions, AND the new intl-user LDAP: \r\n  - EBIS-INTL-DAILY-REPORT-EDITORS\r\n  - EBIS-INTL-DAILY-REPORT-APPROVERS (This is a new LDAP and needs to be created)\r\n  - EBIS-INTL-DAILY-REPORT-VIEWERS",
    "custom_steps": " WHEN user attempts to run International Daily Reports",
    "custom_expected": "THEN International Daily Reports should ONLY be visible to those users (that have permission to view the reports)\r\nAND the following user IDs should be set up with the permissions listed: \r\n  - test_ebis_user73@mlb.com should have the editors permission (Scout)\r\n  - test_ebis_user74@mlb.com should have the approvers permission (Scout Admin)\r\n  - test_ebis_user77@mlb.com should have the viewers permission (Scout Viewer)\r\n  - test_ebis_user75@mlb.com should have the approvers permission (BOC Admin and Scout Admin)\r\n  - test_ebis_user76@mlb.com should have the editors permission (BOC Admin and Scout)\r\n  - test_ebis_user78@mlb.com should have the viewers permission (BOC Viewer and Scout Viewer)",
    "custom_steps_separated": null
  },
  {
    "id": 1227660,
    "title": "As a scouting user I want to see an error if the entered OFP is not between 20 and 80",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637196",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531935128,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in \r\nAND user has an intl workout report open in edit mode\r\nAND user has entered an OFP Adjusted or OFP Basic value that is NOT between 20 and 80(inclusive)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should checks that the OFP Adjusted and Basic entered is a value between 40 and 80 (inclusive)\r\nAND if not,  system should display an error, Messages #45:\r\n\"The following fields contain invalid data: 1. Field Name - Value must be between 20 and 80.\"\r\nAND only Back button should be available\r\nAND clicking back should return user to entry point ",
    "custom_steps_separated": null
  },
  {
    "id": 1225618,
    "title": "As a scouting user I want to create a new International Workout report for a player",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329815",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 2,
    "custom_preconds": "GIVEN scouting user logs in with permission to create International Workout report\r\n\r\n",
    "custom_steps": "WHEN user is in \"Create New\" screen",
    "custom_expected": "THEN the \"Type\" dropdown contains \"International Workout Report\".\r\nAND Selecting \"international Workout Report\" displays per the provided wireframe.\r\nAND The user should be able to use the player field to pick a player to create the report for.\r\nAND The population of players available here should be all players that the user has permission to see in QuickSearch. \r\nAND Selecting a player should enable the \"Next\" button.\r\nAND Clicking \"Next\" should take the user to a new International Workout report, per the provided data discovery and wireframe. \r\nAND Changing the Position on the report should appropriately update the report to display the appropriate fields.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_workout_report\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1225619,
    "title": "As a scouting user I want to save as preliminary an International Workout report for a player",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271494",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 3,
    "custom_preconds": "GIVEN scouting user logs in with permission to create International Workout report\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user is creating a new International workout report on create new screen\r\n",
    "custom_expected": "THEN there is a \"Save\" button as well as a \"Cancel\" button. \r\nAND Clicking Cancel will ask the user to confirm that they wish to lose their changes. If they confirm, then the creation process is canceled, the profile discarded and the user returned to their point of entry.\r\nAND Clicking \"Save\" will save the report as \"Preliminary\" and a blue successful save notification will be thrown.\r\nAND No required field or formatting checks are run when saving a report in preliminary.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1225620,
    "title": "As a scout admin I want to approve a new International Workout report for a player",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271491",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 5,
    "custom_preconds": "GIVEN scouting user logs in with permission to Approve International Workout report\r\n\r\n",
    "custom_steps": "WHEN user is viewing an International Workout Report that is in a Preliminary status in Edit Mode",
    "custom_expected": "THEN there should be Save, Approve, and Cancel buttons available.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the report is reloaded in view mode and no changes are saved.\r\nAND Clicking \"Save\" will save any edits made to the report. No required field and formatting checks should be run given that the report is in a Preliminary state. The report's status will not update.\r\nAND Clicking \"Approve\" will save any edits made to the report. All required field and formatting checks should be run. Once the field checks pass, the form should be reloaded in View Mode, and the report's status should be updated to \"Approved\" and a blue notification should be thrown.\r\nAND The required field checks will differ based on the Position entered on the report (not necessarily the same as the player's position on their profile). \r\nAND The report should appear in the player's Scouting History widget. \r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1226043,
    "title": "As a Scouting user I want to see an error if I am attempting to submit a player report without first submitting the player profile",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329929",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 6,
    "custom_preconds": "GIVEN Scouting user logs in\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"Submit\" on a new International Workout report\r\n\r\n",
    "custom_expected": "THEN system should check that the associated player profile is not a Preliminary or Rejected profile. \r\nAND If the player profile has a status of Preliminary or Rejected, display an error. Messages # 33\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226044,
    "title": "As a Scout Admin I want to see an error if I am attempting to approve a player report without first approving the associated player profile",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329940",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 7,
    "custom_preconds": "GIVEN Scouting user logs in\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"Approve\" on a new International Workout report\r\n",
    "custom_expected": "THEN system should check that the associated player profile is an Approved profile. \r\nAND If the player profile has a status other than Approved, display an error. Messages # 34\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226105,
    "title": "As a scouting user I want the system to calculate a player's OFP and Group on an International Workout Report",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271654",
    "created_by": 103,
    "created_on": 1528213632,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 8,
    "custom_preconds": "Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/Scouting+Calculations\r\nGIVEN a scouting user is logged in with permission to create/edit International Workout Reports\r\nAND user currently has an International Workout Report open in edit mode",
    "custom_steps": "WHEN user enters values into the Workout info fields in the Future(F) column",
    "custom_expected": "THEN system should calculate the OFP Basic and the Group number displayed on the International Workout report on the fly (as the user enters grades) per the provided calculations(see business rules above)\r\nAND the calculation is different depending on if the report is for a position player or a pitcher",
    "custom_steps_separated": null
  },
  {
    "id": 1226113,
    "title": "As a scout admin I want to reject a new International Workout report for a player",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157829412",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 9,
    "custom_preconds": "GIVEN a scouting Admins user is logged in with permission to reject new International Workout Reports\r\nAND user opens a workout report in edit mode with a submitted status from the admin clipboard",
    "custom_steps": "WHEN user click \"Reject\" button",
    "custom_expected": "THEN system will save any edits made to the report. No required field or format checks are run. \r\nAND  A blue notification will be thrown \"Successfully Rejected\"\r\nAND The report's status should be updated to \"Rejected\". \r\nAND The report entry should be removed from the Admin Clipboard.\r\nAND The Scout's Clipboard entry should be updated to \"Rejected\".\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=international_amateur\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1226118,
    "title": "As a user I want to be able to search for International Player Reports",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157796613",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 10,
    "custom_preconds": "Search Requirements: \r\nhttps://wiki.mlbam.com/display/EBIS/Search+-+International+Player+Report\r\nGIVEN a user is logged in with permission to view International Player Reports",
    "custom_steps": "WHEN user navigates to advanced search",
    "custom_expected": "THEN \"International Player Reports2\" should be an option \r\nAND this advanced search should have the filters available per the above requirements document\r\nAND the available columns should match the requirements document\r\nAND Export to excel and pdf should work for the results set\r\nAND by default, only Approved reports are shown in results UNLESS the user purposefully adds a status filter to the search to look for other statuses\r\nNOTE:This functionality should not impact the existing \"International Player Report\"  advanced search - that will be 'turned off' at a later date\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227662,
    "title": "As a scouting user I want to see an error if the entered velocity does not fall within the allowable range",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637185",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531935090,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 11,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in \r\nAND user is attempting to submit an intl workout report for a player\r\nAND user has entered a value in one or more of the velocity fields that does NOT fall within allowed ranges (per DD)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check that the values entered in the Velocity fields fall within the allowed ranges (see data discovery)\r\nAND if not, system should display an error, Messages #44:\r\n\"Maximum velocity must be greater than or equal to minimum velocity.\"\r\nAND only Back button should be available\r\nAND clicking Back should return user to point of entry\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227663,
    "title": "As a scouting user I want to see an error if maximum velocity entered is not equal to or greater than minimum velocity",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637182",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531936400,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 12,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in \r\nAND user is attempting to submit or approve an intl workout report \r\nAND user has entered values in the Maximum Velocity fields that are greater than or equal to the values entered in the minimum velocity fields ",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check that the values entered in the Maximum Velocity fields are greater than or equal to the values entered in the Minimum velocity fields\r\nAND if not, system should display an error, Messages #43:\r\n\"Maximum velocity must be greater than or equal to minimum velocity.\"\r\nAND only Back button should be available\r\nAND clicking Back should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1227664,
    "title": "As a scouting user I want to see an error if the value entered in any OFP category does not have a value of 0 or 2-8",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637167",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531937329,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 13,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in\r\nAND user is attempting to submit an intl workout report \r\nAND user has entered a value in one or more of the OFP category fields that does not have a value of 0 or 2-8",
    "custom_steps": "WHEN a present or future grade field loses focus (user clicks out of the field or tabs out)",
    "custom_expected": "THEN system should check that the value entered in the field is either 0, or a value between 2 and 8 (inclusive)\r\nAND if not, system should display an error, See Messages #42:\r\n\"The following fields contain invalid data: 1. Field Name - Please enter a value of 0 or 2-8. \"\r\nAND only Back button should be available\r\nAND clicking Back should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1227665,
    "title": "As a scouting user I want to see an error if the present value in any OFP category is not less than or equal to the Future value",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637156",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531937615,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 14,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in\r\nAND user has entered a Present Value in any OFP category that is NOT less than or equal to the Future Value",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check that the values entered in the Future grade fields are greater than or equal to the values entered in the Present grade fields\r\nAND if not, system should display an error, Messages #41:\r\n\"The Future OFP must be greater than or equal to the Present OFP\" \r\nAND only Back button should be available\r\nAND clicking Back should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1227666,
    "title": "As a scouting user I want to see an error if the OFP Adjusted entered is not within 3 points of the OFP Basic",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157637154",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531937984,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 15,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in\r\nAND user is attempting to submit or approve an intl workout report\r\nAND user has entered a value in the OFP Adjusted field that is NOT within three points of calculated OFP Basic",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check that the value entered in the OFP Adjusted field is within three points of the calculated OFP Basic\r\nAND if not, and no comments are entered in the OFP Adjusted comments field, then system should display an error, Messages #40:\r\n\"You must enter a comment if OFP Adjusted is not within 3 points of OFP Basic.\"\r\nAND only Back button should be available \r\nAND clicking Back should return user to the point of entry\r\n*Example: if the OFP Basic is 50, the user can enter 47-53 without needing to enter comments, but if they enter a value outside of that range they need to provide comments*",
    "custom_steps_separated": null
  },
  {
    "id": 1227684,
    "title": "As a user I want approving an International Workout report to set the player's Scouting Status",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157988640",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531942463,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 16,
    "custom_preconds": "GIVEN a scout admin user is logged in with permission to approve Intl Workout Reports \r\n",
    "custom_steps": "WHEN user Approves an International Workout report ",
    "custom_expected": "THEN the player's Scouting Status should be set to International Prospect if it was not already set\r\nAND once this status has been set, it should always appear under Scouting Info section for BOC and Scouting users\r\nBUT it should no longer display at all for Club users",
    "custom_steps_separated": null
  },
  {
    "id": 1227687,
    "title": "As a user I want to edit an existing Player Report",
    "section_id": 148412,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953904",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531942779,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 17,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scout or scout admin user is logged in",
    "custom_steps": "WHEN user attempts to edit an existing player report",
    "custom_expected": "THEN Scouts (editors) should only be able to edit International Workout Reports in the Preliminary and Rejected statuses\r\nAND Scout Admins (approvers) should be able to edit Approved and Submitted International Workout reports\r\nAND no one should be able to edit the historical International Prospect or International Workout reports",
    "custom_steps_separated": null
  },
  {
    "id": 1226033,
    "title": "As a Scout I want to view an existing trainer/agent profile",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156059435",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 1,
    "custom_preconds": "GIVEN a Scouting user logs in with View/Edit trainer/agent permission\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN navigates to trainer/agent widget\r\n\r\n",
    "custom_expected": "THEN user should be able to open trainer/agent profiles from trainer/agent widget\r\nAND The profile appears for scouting users just like it does for BOC users. ",
    "custom_steps_separated": null
  },
  {
    "id": 1226034,
    "title": "As a Scouting user I want to save a new trainer/agent profile as preliminary",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058401",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 2,
    "custom_preconds": "GIVEN Scouting user logs in with scouting and trainer/agent edit permissions",
    "custom_steps": "WHEN user is viewing the trainer/agent widget\r\n\r\n",
    "custom_expected": "THEN user should see a Create New button there.\r\nAND Clicking on the Create New button will launch a new trainer/agent profile form. \r\nAND The scout will have a \"Save\", \"Submit\" and \"Cancel\" button on the form, assuming that they are not also a Registration analyst/admin. \r\nAND Clicking \"Cancel\" will ask the user that they wish to confirm. If they confirm, the new profile will be discarded and the user will be returned to the point of entry.\r\nAND Clicking \"Save\" will save the profile as Preliminary. At least one name field is required to save the profile as preliminary. No other fields are required to save as preliminary.\r\nAND The trainer/agent profile will reload in view mode, and the trainer/agent's status will be set to \"Preliminary\". \r\nAND The trainer/agent profile will appear on the Scout's Clipboard with a status of \"Preliminary\"\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347878\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=create_a_new_trainer_agent",
    "custom_steps_separated": null
  },
  {
    "id": 1226035,
    "title": "As a Scouting user I want to submit a new trainer/agent profile for review",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058490",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 3,
    "custom_preconds": "GIVEN Scouting user logs in with scouting and trainer/agent edit permissions",
    "custom_steps": "WHEN user opens a preliminary trainer/agent profile in view mode\r\n \r\n",
    "custom_expected": "THEN there should be Edit, Submit and Close button\r\nAND Clicking Close will close the profile.\r\nAND When the profile is in Edit Mode, they will have a Save, Submit and Cancel button. \r\nAND Clicking \"Cancel\" will ask the user to confirm that they wish to lose any changes. If the user confirms, the profile's status will remain preliminary and the profile will reload in view mode.\r\nAND Clicking \"Submit\" will run a required field and formatting check per the data discovery. \r\nAND Once the profile has passed the required field and formatting checks, if the profile was in edit mode, it is reloaded in view mode.\r\nAND The trainer/agent's status will update to \"Submitted\", and the status will be reflected on the creating scout's Clipboard. \r\nAND The trainer/agent profile will appear for review on the Scouting Admin's Clipboard.\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347878\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=create_a_new_trainer_agent",
    "custom_steps_separated": null
  },
  {
    "id": 1226037,
    "title": "As a Scout Admin I want to Reject a new Trainer/Agent profile",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058503",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 5,
    "custom_preconds": "GIVEN Scouting admin logs in with scouting and trainer/agent edit permissions\r\n\r\n\r\n",
    "custom_steps": "WHEN user is viewing their Admin Clipboard",
    "custom_expected": "THEN Scouting Admins should see any trainer/agent profile with a Submitted status on their Admin Clipboard. \r\nAND Opening the submitted trainer/agent profile from the Clipboard should open the item in Edit Mode.\r\nAND Clicking \"Reject\" will save any edits made to the profile. No required field or format checks are run. \r\nAND The profile's status should be updated to \"Rejected\". \r\nAND The trainer/agent entry should be removed from the Admin Clipboard.\r\nAND The Scout's Clipboard entry should be updated to \"Rejected\".",
    "custom_steps_separated": null
  },
  {
    "id": 1226038,
    "title": "As a Scout I want to resubmit a new trainer/agent profile for review",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058511",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 6,
    "custom_preconds": "GIVEN Scout logs in\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN they are viewing their Scout Clipboard",
    "custom_expected": "THEN Scouts see any trainer/agent profiles created by them on their Scout Clipboard when they are in a Rejected status.\r\nAND Opening a Rejected trainer/agent profile from the Clipboard opens the profile in edit mode with a \"Save\" \"Cancel\" and \"Submit\" button available.\r\nAND The scout should be able to edit the profile and save changes without a required field or formatting check.\r\nAND Clicking \"Submit\" from a rejected profile should save any edits made, run a required field and format check and complete the submission, just as though the profile were in a Preliminary status. \r\nAND The profile should have its status updated to Submitted, and appear on the Admin Clipboard and Scout Clipboard as Submitted.",
    "custom_steps_separated": null
  },
  {
    "id": 1226039,
    "title": "As a Scouting user I want to delete a trainer/agent profile",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156059464",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 7,
    "custom_preconds": "GIVEN Scouts and Scout Admins logs in \r\n\r\n",
    "custom_steps": "WHEN user is viewing a trainer/agent profile in a Preliminary state",
    "custom_expected": "THEN Scouts and Scout Admins see a \"Delete\" button \r\nAND Clicking the \"Delete\" button will prompt the user to confirm that they wish to delete the item.\r\nAND If they confirm, the item is assigned a \"Deleted\" status, and no longer appears on any Clipboard, or in any search unless the user has specifically searched for Deleted profiles. \r\nAND Scouts or Scout Admins that also have BOC permissions can delete profiles in any state.",
    "custom_steps_separated": null
  },
  {
    "id": 1226040,
    "title": "As a scouting user I want to include a Preliminary or Submitted trainer/agent on a new International Player Profile",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329034",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 8,
    "custom_preconds": "GIVEN scouting user logs in\r\nAND the user has created a preliminary trainer/agents\r\n\r\n\r\n",
    "custom_steps": "WHEN the scouting user creates a new International Amateur profile",
    "custom_expected": "THEN the \"trainer/agent\" dropdown should include preliminary trainer/agents that the scout has created. They should not see preliminary trainer/agents created by other Scouts. \r\nAND When a scouting user is creating a new International Amateur profile, the \"trainer/agent\" dropdown should include submitted trainer/agents that the scout has created. They should not see submitted trainer/agents created by other Scouts. \r\nAND BOC users should continue to not see ANY Preliminary or Submitted trainer/agent profiles when creating or editing Registration profiles. (they can view the information on the submitted player profiles if they pull them up)",
    "custom_steps_separated": null
  },
  {
    "id": 1226041,
    "title": "As a Scouting user I want to see an error if I am attempting to submit a player profile without first submitting the trainer/agent",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329290",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 9,
    "custom_preconds": "GIVEN scouting user logs in\r\n\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" on a new International Amateur profile\r\n",
    "custom_expected": "THEN system should check that the trainer/agent selected in the profile is not a Preliminary or Rejected profile. \r\nAND If the trainer/agent has a status of Preliminary or Rejected status, display an error. Messages # 31\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226042,
    "title": "As a Scout Admin I want to see an error if I am attempting to approve a player profile without first approving the trainer/agent",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329293",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 10,
    "custom_preconds": "GIVEN scouting user logs in\r\n",
    "custom_steps": "\r\nWHEN user clicks \"Approve\" on a new International Amateur profile\r\n",
    "custom_expected": "THEN system should check that the trainer/agent selected in the profile is Approved. \r\nAND If the trainer/agent has a status other than \"Approved\", display an error. Messages # 32\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226106,
    "title": "As a user I want to edit an existing trainer/agent profile",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955010",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1529352667,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC, Club and Scouts user logs with trainer/agent editors or approvers permissions\r\n\r\n",
    "custom_steps": "WHEN user opens an existing trainer/agent profile",
    "custom_expected": "THEN all users with the trainer/agent editors or approvers permissions are able to edit Approved trainer/agent profiles.\r\nAND Users with the trainer/agent editors permission are able to create new trainer/agent profiles.\r\nAND If  the user is identified as being a Scout, then they must submit the profile for approval. \r\nAND If the user is not identified as being a Scout, then they can only save the profile as Approved. \r\nAND Users with the trainer/agent editors permission that are NOT scouts are able to view preliminary and submitted trainer/agent profiles and edit them. Clicking \"Save\" on these profiles will automatically approve the profile. \r\nAND Users with the trainer/agent editors permission that ARE scouts are not able to edit Submitted trainer/agent profiles. \r\nAND Users with the trainer/agent editors permission that ARE scouts are not able to edit Preliminary or Rejected trainer/agent profiles that they are not the creating scout for. (They also shouldn't really be able to see these).\r\nAND No one should be able to edit a deleted profile.",
    "custom_steps_separated": null
  },
  {
    "id": 1227667,
    "title": "As a user I want to see an error if I enter in an invalid email address",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157607272",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531939629,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 12,
    "custom_preconds": "Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a user is logged in with permission to edit Trainer/Agent profiles",
    "custom_steps": "WHEN user clicks \"Save\" on a trainer/agent profile",
    "custom_expected": "THEN system should verify that an email address entered in the profile is in a proper email address format\r\nAND if not, system should display Messages #51:\r\n\"You have entered an invalid email address.\"\r\nAND only Back button should be available\r\nAND clicking Back should return user to the point of entry\r\n*Note that this does not guarantee that this is a valid email address that will work - just that it is formatted like an email*",
    "custom_steps_separated": null
  },
  {
    "id": 1227683,
    "title": "As a scouting user I want to be able to create a new Trainer/Agent while editing a Workout Report",
    "section_id": 148415,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157617178",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1531940841,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20476,
    "display_order": 13,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\nGIVEN a scouting user is logged in with permission to edit intl Workout Reports\r\n",
    "custom_steps": "WHEN user opens an intl Workout Report open in edit mode \r\n",
    "custom_expected": "THEN there should be an \"Add New Trainer\" hyperlink (See wireframe for placement)\r\nAND clicking \"Add New Trainer\" should open a new trainer/agent form in a new tab/window for the user to complete the profile\r\nAND the buttons available should depend on if the user is a scout or not\r\nAND clicking \"Save\" or \"Submit\" on the new trainer/agent form should store the trainer/agent profile appropriately, just as though it were created through the normal \"Create New\" workflow\r\nAND after the new trainer/agent has been saved - it should be prepopulated in the \"Agents involved in workout\" field of the Workout Report\r\nAND this should not remove any trainer/agent names that have already been selected",
    "custom_steps_separated": null
  }
]