[
  {
    "id": 1031140,
    "title": "As a user I want to be able to view a player's Contracts and Investigation History tab on the player profile",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250569",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN \"Contracts Tab\" on player profile has been updated to indicate the presence of the Investigation History\r\nAND a user is logged in as club or boc ",
    "custom_steps": "WHEN user navigates player profile contracts tab\r\n",
    "custom_expected": "THEN if the player has an Investigation History to display, then the user should see the tab as \"Contracts & Inv\"\r\nAND if user is a BOC user and the player has at least one investigation request or investigation on file, then they should have an Investigation History displayed\r\nAND if user is a club user and the player has at least one investigation on file OR a request from this Club, then they should have an Investigation History displayed\r\nAND title attribute on the tab should be set to title=\"Contracts & Investigations\" so hovering over the tab displays a browser tooltip",
    "custom_steps_separated": null
  },
  {
    "id": 1031141,
    "title": "As a user I want to be able to view a player's Investigation History",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390543",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN the user is in Player's profile\r\n",
    "custom_steps": "WHEN user selects \"Contracts\" tab of a player profile",
    "custom_expected": "THEN Investigation History widget will appear beneath the Contract History, and follows the provided wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1031142,
    "title": "As a Club user I want to create a new Investigation Request",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512519",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 3,
    "custom_preconds": "GIVEN a Club user wants to create a new investigation request for International Amateur players or Professional players",
    "custom_steps": "WHEN user selects \"Investigation Request\" option in the Create New top-level menu for Club users on International Amateur players or Professional players\r\n\r\n",
    "custom_expected": "THEN system will launch a new Investigation Request for the player. \r\nAND the form will follow the wireframe and data discovery.\r\nAND Investigation Type is defaulted based on whether or not the Club submitting the request has a submitted contract for the player. If there is a Terms Submitted or higher contract for the player from the submitting Club, then the default is \"Contract\". Otherwise it is \"Pre-Contract\".",
    "custom_steps_separated": null
  },
  {
    "id": 1031143,
    "title": "As a user I want to see which files are required within the label dropdown",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140964417",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN a user opens an investigation request form\r\nAnd uploaded a file(s)",
    "custom_steps": "WHEN user clicks on the label  \r\n\r\n",
    "custom_expected": "THEN a red \"*\" will appear after the required document labels within the label dropdown.",
    "custom_steps_separated": null
  },
  {
    "id": 1031144,
    "title": "As a Club user I want to be able to save an Investigation Request",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139511133",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN a Club user logs into the system ",
    "custom_steps": "WHEN Club creates or opens an Investigation Request form in Edit mode\r\n\r\n",
    "custom_expected": "THEN\r\n\r\nSAVE\r\n* A Save button will be available anytime the form is in edit mode. \r\n* Clicking Save will save the form and its current values and reload the form in view mode. \r\n* The request's status will be set to \"Preliminary\" if this is the first time the request is being saved. Otherwise the status will not change.  \r\n* After a successful save the system will display a successful save blue notification. \r\n\r\nCANCEL\r\n* Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \r\n* Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\n* If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\n* If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\n* If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1031145,
    "title": "As a user I want to be able to delete an Investigation Request",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512675",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN the user has edit permissions for the form in Preliminary states",
    "custom_steps": "WHEN user clicks on 'Delete' button(Grey) on the Investigation Request form in view or edit mode\r\n\r\n",
    "custom_expected": "THEN system will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? \r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown confirming the deletion.\r\nOr If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted requests should not appear on the front end or be searchable.",
    "custom_steps_separated": null
  },
  {
    "id": 1031146,
    "title": "As a Club user I want to be able to submit an Investigation Request to the BOC",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512957",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 7,
    "custom_preconds": "GIVEN a Club user logs in",
    "custom_steps": "WHEN the user opens a preliminary Investigation form in edit or view mode\r\n\r\n",
    "custom_expected": "THEN 'Submit to BOC' button will available. The button will be blue. \r\nAND Submit button is available for BOC users when the preliminary form is in edit mode or view mode. The button is grey.\r\nAND Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the request to \"Submitted\"  \r\nAND System reloads the request in view mode, and displays a successful submit blue notification. \r\nAND Once the request has been successfully submitted, system creates an entry in green font in Player's Investigation History.",
    "custom_steps_separated": null
  },
  {
    "id": 1031147,
    "title": "As a BOC user I want to receive an approvals item for a submitted Investigation Request",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139595277",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 8,
    "custom_preconds": "GIVEN an Investigation Request has been Submitted by Club",
    "custom_steps": "WHEN BOC checks the BOC - Investigations - Admin's Approvals widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN an approval item will be generated and displayed in the widget\r\nAND The files attached are displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated, they display in the Comments column of the Approvals widget.\r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink.\r\nAND Clicking on the type hyperlink will open the submitted request in view mode in the same window/tab. \r\nAND This Approvals item should display under the \"Micellaneous\" filter in the approvals widget.",
    "custom_steps_separated": null
  },
  {
    "id": 1031148,
    "title": "As a Club user I want to see Investigation Requests in my Pending Approvals widget",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140973431",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 9,
    "custom_preconds": "GIVEN a club user submitted waiver request\r\nAND has investigation editors role ",
    "custom_steps": "WHEN user is on Pending Approvals Widget\r\n\r\n",
    "custom_expected": "THEN Club users should see the submitted waiver request in their Pending Approvals widget.\r\nAND it should match the BOC version of the Approvals item, including rolling off when the request is approved, rejected or sent for update.",
    "custom_steps_separated": null
  },
  {
    "id": 1031149,
    "title": "As a BOC user I want to be able to send an Investigation Request back to the Club for updates",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513741",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 10,
    "custom_preconds": "GIVEN a Investigation Request is in Submitted States\r\n",
    "custom_steps": "WHEN BOC opens the Investigation Request in view or edit mode",
    "custom_expected": "THEN BOC Approver should see an \"Update Needed\" button in grey.\r\nAND clicking \"Update Needed\" will not run any rule checks. \r\nAND any changes to the form are saved, and the request's status is updated to \"Update Needed\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the request was saved.\r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Update Player's Investigation History entry to reflect the new status, but it should remain green. \r\nAND An Action Item should be generated for the submitting Club's Investigations Admin. (#4)",
    "custom_steps_separated": null
  },
  {
    "id": 1031150,
    "title": "As a user I want to see Investigation Waiver Requests differently than Investigation Requests",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140983965",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 11,
    "custom_preconds": "GIVEN user logs into the system",
    "custom_steps": "WHEN a Club submits an investigation waiver\r\n\r\n",
    "custom_expected": "THEN the blue successful submit notification should indicate that an Investigation Waiver Request was submitted - not just an investigation request. \r\nAND the Approvals item, and corresponding Pending Approvals item, should say \"Investigation Waiver Request\" as the Type instead of Investigation Request. \r\nAND When a BOC user opens a submitted investigation waiver request, it should match the wireframe, instead of looking the same as a submitted waiver request. \r\nAND The Investigation Waiver Request should appear in the player's investigation history as an Investigation Waiver Request.",
    "custom_steps_separated": null
  },
  {
    "id": 1031151,
    "title": "As a BOC user I want to be able to approve or reject an Investigation Waiver Request",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515599",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 12,
    "custom_preconds": "GIVEN a Club user submitted an Investigation Waiver Request",
    "custom_steps": "WHEN BOC opens the Investigation Waiver Request in View or Edit mode\r\n\r\n",
    "custom_expected": "THEN\r\nAPPROVE:\r\n* BOC Approvers see an \"Approve\" button in blue when they are viewing a request (in view or edit mode) in Preliminary, Submitted to BOC and Update Needed states. \r\n* Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\n* Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\n* If the item was in edit mode, it is reloaded in view mode. \r\n* A successful blue notification is displayed that states the request was approved.\r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\n* Update Player's Investigation History entry for this request to be in black font. \r\n\r\nREJECT:\r\n* BOC Approvers see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in the Submitted state. \r\n* Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\n* Once all On Save rules have passed or been overridden, the status is updated to \"Rejected\"\r\n* Successful reject notification is displayed. \r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\n* Remove pending investigation history entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1031152,
    "title": "As a Club user I want to be prevented from creating a request for a player I do not have permission to request an inviestigation for",
    "section_id": 122008,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515725",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 13,
    "custom_preconds": "GIVEN A club user is viewing different org's player profile ",
    "custom_steps": "WHEN Club Selects \"Investigation Request\" for that player\r\n\r\n",
    "custom_expected": "THEN system will know player is currently under contract with a different Org, then an error will display. \r\n**Error Message:**\r\nThis player is currently under contract with another Organization. You may not request an investigation for this player. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1031154,
    "title": "As a BOC user I want approving an investigation request to automatically create a new, preliminary Investigation for a player",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513527",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN an investigation request has been submitted to BOC ",
    "custom_steps": " WHEN BOC user clicks \"Approve\" on the Investigation Request ",
    "custom_expected": "THEN the system should save any changes made to the request\r\nAND system should mark the request as approved and display a successful approval notification\r\n AND system should close the request and open an Investigation Form for the player with the Final results for Age and ID set to Pending\r\n AND investigation Type and Org should be populated from the Request\r\n AND oif the Investigation Type = Contract then the Investigation Visibility should default to All Orgs\r\n BIUT if the Investigation Type = Pre-Contract, then the Investigation Visibility should default to Requesting Org(s)\r\n AND the Investigation Form should automatically be saved as preliminary\r\nAND any Attached Files should be carried from the Request to the Form \r\nAND the player's Investigation History should be updated \r\nAND club should be notified of the approval\r\nAND notification should state \"Investigation Request Approved\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031155,
    "title": "As a BOC user I want approving an investigation waiver request to automatically create a new, preliminary waived Investigation for a player",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139514573",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN an investigation waiver request has been submitted to BOC",
    "custom_steps": " WHEN BOC user clicks \"Approve\" from the  Investigation Waiver Request",
    "custom_expected": "THEN the system should save any changes made to the request\r\nAND system should mark the waiver request as approved and display a successful approval notification\r\n AND system should remove the Approvals item for the BOC user\r\n AND system should close the waiver request and open an Investigation Form for the player for which the waiver was requested with the Final results for Age and ID set to Waived\r\n AND investigation Type and Org should be populated from the Request\r\n AND if the Investigation Type = Contract then the Investigation Visibility should default to All Orgs\r\n AND the Investigation Form should automatically be saved as preliminary\r\nAND any Attached Files should be carried from the Request to the Form\r\n AND the player's Investigation History should be updated\r\n AND club should be notified of the approval\r\nAND notification should state \"Investigation Waiver Request Approved\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031156,
    "title": "As a user I want to be able to search for Investigations",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250111",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 3,
    "custom_preconds": "GIVEN the user is in advance search tab",
    "custom_steps": "WHEN user select 'Investigation' under Advanced Search\r\n\r\n",
    "custom_expected": "THEN the available filters should match the requirements. \r\nAND the columns displayed should match the requirements. \r\nAND The \"Date\" column should be hyperlink to the Investigation form for BOC users only.",
    "custom_steps_separated": null
  },
  {
    "id": 1031157,
    "title": "As a BOC user I want to be able to create a new Investigation",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390963",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "WHEN the user clicks Create New menu for professional, domestic amateur and international amateur players\r\nAND selects Investigation\r\n\r\n",
    "custom_expected": "THEN a new Investigation form is opened for the player. \r\nAND the Investigation Form matches the wireframe and data discovery. (http://tb5api.axshare.com/#p=investigation_form)",
    "custom_steps_separated": null
  },
  {
    "id": 1031158,
    "title": "As a BOC user I want to be able to save a new Investigation",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390993",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user logs in\r\n",
    "custom_steps": "When the user is viewing a new Investigation Form\r\n\r\n",
    "custom_expected": "THEN \"Save\" and \"Cancel\" will be available.\r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery,  will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1031159,
    "title": "As a BOC user I want to be able to edit an existing Investigation (converted from 1)",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608635",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "When the user is viewing an existing Investigation Form\r\n\r\n",
    "custom_expected": "THEN an \"Edit\" button will be available. \r\nAND Clicking \"Edit\" will place the form into edit mode with the fields editable per the data discovery \r\nAND \"Save\" and \"Cancel\" buttons will be available. \r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery,  will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1031160,
    "title": "As a BOC user I want to be able to edit an existing Investigation (new in 2)",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608657",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 7,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "When the user is viewing an existing Investigation Form\r\n\r\n",
    "custom_expected": "THEN an \"Edit\" button will be available. \r\nAND Clicking \"Edit\" will place the form into edit mode with the fields editable per the data discovery \r\nAND \"Save\" and \"Cancel\" buttons will be available. \r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery, will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1031161,
    "title": "As a BOC user I want an Investigation to automatically be linked to an existing Minor Contract",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390995",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC user logs in",
    "custom_steps": "WHEN an Investigation is first created by the user \r\n\r\n",
    "custom_expected": "THEN the system should locate any contracts in the system for the player with a status of \"Terms Submitted\" or \"Terms Accepted\". If one exists, then this contract should be pre-populated in the Contract ID field of the Investigation Form.\r\nOr If no \"Terms Submitted\" or \"Terms Accepted\" contracts exist for the player then the system should check for any Approved contracts - if one exists then the contract with the latest Approval stamp should be pre-populated in the Contract ID field of the Investigation Form. \r\nAND The \"Signing Bonus\" field should be prepopulated with the signing bonus from the linked contract if no value has been entered. \r\nAND The \"Org\" field on the Investigation should be prepopulated with the Signing Org from the contract. If a different Org has already been selected, this Org should be added.",
    "custom_steps_separated": null
  },
  {
    "id": 1031162,
    "title": "As a BOC user I want to be able to link an Investigation to a Contract",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253001",
    "created_by": 103,
    "created_on": 1494869716,
    "updated_by": 103,
    "updated_on": 1494869716,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 9,
    "custom_preconds": "GIVEN BOC user logs in\r\n",
    "custom_steps": "WHEN user opens an investigation form in edit more\r\n\r\n",
    "custom_expected": "THEN users should see a \"Select\" button associated with the Contract ID field (see wire). \r\nOR If no contract exists for this player, the button should not display.\r\nAND Clicking this button will launch a pop-up for the user to select the associated contract to link to this investigation (see 2nd wire). \r\nAND The popup will contain a complete list of the Major and Minor League Contracts that exist for this player. \r\nAND The Status of the Contract, Signing Org, Type and the Date Created will display. \r\nAND The Status will be a hyperlink to navigate the user to the contract. \r\nAND The user will only be able to select one contract to link. \r\nAND The button \"Select\" should be disabled until 1 contract is selected\r\nAND Clicking \"Select\" will populate the Contract ID field with the ID of the selected contract. \r\nAND If a contract ID already existed in this field, it is overwritten. \r\nAND The \"Signing Bonus\" field should be prepopulated with the signing bonus from the linked contract if no value has been entered. \r\nAND The \"Org\" field on the Investigation should be prepopulated with the Signing Org from the contract. If a different Org has already been selected, this Org should be added.",
    "custom_steps_separated": null
  },
  {
    "id": 1032129,
    "title": "As a user I want to only see Investigations that I have permission to see within the player's Investigation History (updated for ebis2 investigations)",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250327",
    "created_by": 103,
    "created_on": 1494958763,
    "updated_by": 103,
    "updated_on": 1494958763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 10,
    "custom_preconds": "GIVEN a user is logged in and attempting to view a player's Investigation History",
    "custom_steps": "WHEN user navigates to Investigation History Table on Player Profile ",
    "custom_expected": "THEN Investigation requests should only be visible to the submitting Org, and BOC Investigations\r\nAND Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History.",
    "custom_steps_separated": null
  },
  {
    "id": 1032130,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created in EBIS2)",
    "section_id": 122009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 103,
    "created_on": 1494958763,
    "updated_by": 103,
    "updated_on": 1494958763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in and attempting to Adv Search for an Investigation created in ebis2",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History",
    "custom_steps_separated": null
  },
  {
    "id": 1031163,
    "title": "Investigation History - Permissions",
    "section_id": 122010,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390755",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN a CLUB or a BOC user has limited Investigation Permission\r\n(test_boc_approver@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com, Test-NYY-admin@mlb.com, Test-NYY-viewer@mlb.com, and test-basic-stl@mlb.com)\r\n",
    "custom_steps": "WHEN the user is in a players profile under 'Contracts' tab\r\n\r\n\r\n",
    "custom_expected": "THEN user should only be able to view what they have permission to. ",
    "custom_steps_separated": null
  },
  {
    "id": 1031164,
    "title": "Investigations Search - Permissions",
    "section_id": 122010,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139251803",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN a CLUB or BOC user with/without Investigation permission logs in",
    "custom_steps": "WHEN user is in advance search\r\n",
    "custom_expected": "THEN only users that have Investigations permissions should see \"Investigations\" as an option in advanced search. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031165,
    "title": "Investigation Form - Permissions",
    "section_id": 122010,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138391269",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 3,
    "custom_preconds": "GIVEN Investigation permission varies for different user (Test-ARI-viewer@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com and test_boc_approver@mlb.com)",
    "custom_steps": "WHEN the users logs in \r\n",
    "custom_expected": "THEN the following should be true \r\n-The form has a view only permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but cannot edit anything.  Users without the permission cannot view the form anywhere in the system.\r\n-The form has a \"registration\" permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but can only edit/create Investigations with a type = Registration. Users without this permission or the admin permission cannot edit or create Investigations anywhere in the system. \r\n-The form has an admin permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, and can edit/create any Investigation type. Users without this permission cannot edit or create non-Registration Investigations anywhere in the system. ",
    "custom_steps_separated": null
  },
  {
    "id": 1031166,
    "title": "As a user I want to only see Investigations that I have permission to see within the player's Investigation History (Historical Only)",
    "section_id": 122010,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390719",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN Club and BOC wants to only see Investigations that they have permission to",
    "custom_steps": "WHEN user tries to see an investigation on the investigation history\r\n\r\n",
    "custom_expected": "THEN Club users will only able to see an investigation on the investigation history if the following are ALL true:\r\n     * They are the requesting Club for the investigation. (The Org on the Investigation Form is their Organization)\r\n     * The player is currently under contract with the org OR the player is a Free Agent\r\n     * The investigation was entered on or after January 1, 2011. \r\nAND BOC Investigations users are able to see all investigations in the player's Investigation History, regardless of when they were entered or who requested them.",
    "custom_steps_separated": null
  },
  {
    "id": 1031167,
    "title": "As a Club user I want to be able to see that a player has an investigation on file even if I do not have permission to see the Investigation",
    "section_id": 122010,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390647",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN Club user has permission to view a player's Investigation History\r\nAND the player has at least one Investigation (not request) in ebis\r\nAND Club user doesn't have permission to view ANY of the Investigations in the player's history",
    "custom_steps": "WHEN user is in player's Investigation History\r\n\r\n",
    "custom_expected": "THEN display the text \"Investigation on file - please contact the BOC for more information\" in the Investigation History widget.",
    "custom_steps_separated": null
  },
  {
    "id": 1031168,
    "title": "As a user I want saving a new investigation to send the player profile information to LARI",
    "section_id": 122011,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253905",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN a new investigation has been created for a player",
    "custom_steps": "WHEN the investigation is saved\r\n",
    "custom_expected": "THEN  the player's profile information is sent to LARI. If the profile had previously been sent to LARI it is sent as a \"player update\".\r\nAND fields and methods of communication should follow documentation found here:https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1031169,
    "title": "As a user I want profile updates on profiles that have been sent to LARI to a registration profile to be sent to LARI",
    "section_id": 122011,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464591",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN a player profile has been previously sent to LARI",
    "custom_steps": "WHEN one or more fields updated that are typically sent to LARI\r\n\r\n\r\n",
    "custom_expected": "THEN the updates should be sent to LARI as a player update. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031171,
    "title": "As a user I want saving a new investigation to send the investigation information to LARI",
    "section_id": 122011,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608327",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN a new investigation has been created for a player\r\nAND Age/ID results are NOT set to N/A",
    "custom_steps": "WHEN the investigation is saved",
    "custom_expected": "THEN the investigation should be sent to LARI\r\nAND fields and methods of communication should follow documentation found here:https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1031172,
    "title": "As a user I want certain Investigation results to be communicated back to LARI",
    "section_id": 122011,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464573",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN an investigation has been created for a Player in ebis",
    "custom_steps": "WHEN the investigation result is updated in ebis to be \"Waived\" ",
    "custom_expected": "THEN this result should be communicated back to LARI",
    "custom_steps_separated": null
  },
  {
    "id": 1031173,
    "title": "As a user I want files attached to an Investigation Form to be communicated back to LARI",
    "section_id": 122011,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464571",
    "created_by": 103,
    "created_on": 1494869774,
    "updated_by": 103,
    "updated_on": 1494869774,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN an investigation has been created for a player and saved\r\nAND user has opened the investigation form in edit mode\r\nAND user has attached new files",
    "custom_steps": "WHEN user clicks Save on the investigation form ",
    "custom_expected": "THEN system should check for the presence of any new attached files since the last save\r\nAND system should send newly attached files to LARI",
    "custom_steps_separated": null
  },
  {
    "id": 1031204,
    "title": "User wants to submit a Waiver Request",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "118955695",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC or Club user has navigated to the \"Waivers\" screen from the left nav\r\nAND page is open in edit mode\r\nAND \"Submit to BOC\" or \"Save\" button is available",
    "custom_steps": "WHEN user clicks \"Save\" or \"Submit to BOC\"",
    "custom_expected": "THEN system should run a required field and format check according to the data discovery\r\nAND if any fields are missing or formatted incorrectly, user should receive an error message\r\nAND system should refresh the page and sort the players alphabetically\r\nAND system should check for any On Submit rules violations \r\nAND system should show successful waiver request submission notification and \"Submitted On\" and \"Submitted By\" fields are populated\r\nAND these fields should be  updated if request submitted subsequent times\r\nAND system should go back to view mode when complete",
    "custom_steps_separated": null
  },
  {
    "id": 1031208,
    "title": "Submit a Waiver Request Permissions - BOC - Basic",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121693189",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is logged in with BOC basic permissions\r\n",
    "custom_steps": "WHEN BOC basic user attempts to do anything with a Waiver Request",
    "custom_expected": "THEN user should be able to view all waiver requests \r\nBUT user should NOT be able to make any changes",
    "custom_steps_separated": null
  },
  {
    "id": 1031209,
    "title": "Submit a Waiver Request Permissions - Club - Basic",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121693613",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN a user is logged in with Club Basic permissions",
    "custom_steps": "WHEN user attempts to do anything with a Waiver Request",
    "custom_expected": "THEN the user should be able to view all waiver requests for their own players (It does not matter if the BOC or the club initiated the request)\r\nBUT user should not be able to make any changes",
    "custom_steps_separated": null
  },
  {
    "id": 1031210,
    "title": "User wants PDF of Request Bulletin attached to notification",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129842337",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 7,
    "custom_preconds": "GIVEN user is logged in as Club or BOC \r\nAND a Waiver Request Bulletin containing one or more waiver requests has been sent, or notifications re-sent\r\n",
    "custom_steps": "WHEN user receives notification on their clipboard that the Request Bulletin is available ",
    "custom_expected": "THEN description of the notification generated by the sending of the request bulletin or the resending of notifications should be clickable\r\nAND clicking on the description should download the associated pdf of the request bulletin",
    "custom_steps_separated": null
  },
  {
    "id": 1031174,
    "title": "Release from Roster tx automatically created for Unconditional Release Waiver Requests",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120776297",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 9,
    "custom_preconds": "GIVEN a user is attempting to submit a Waiver Request for a player\r\nAND the request is a UR Waiver Request",
    "custom_steps": "WHEN user submits the UR Waiver Request",
    "custom_expected": "THEN user should be alerted with message \"The Release from Roster transaction for <Lastname, Firstname> has been changed to Approved state successfully\"\r\nAND Effective Date should be set from the \"As Per Release on\" date\r\nAND Player's player history should be updated with: Code = URREL Description = Release from Roster, From Org/Club To Org/Club fields to be in black font, To Org/Club fields blank\r\nAND automatically created \"As per Release....\" comment from waiver request should be saved in the tx\r\nAND player's MJ Roster status should be set to \"Released from Roster\"\r\nAND system should ensure that a 2nd transaction is not created if set of requests are submitted a 2nd time with UR included",
    "custom_steps_separated": null
  },
  {
    "id": 1031175,
    "title": "BOC user wants to send a Request Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120322043",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 10,
    "custom_preconds": "GIVEN user is logged in as a BOC user\r\nAND user has navigated to the waivers screen\r\nAND a submitted waiver request bulletin exists for the selected request date\r\nAND it is after 2PM on request date\r\nAND \"Send Request Bulletin\" button is displayed",
    "custom_steps": "WHEN user clicks \"Send Request Bulletin\"\r\n",
    "custom_expected": "THEN system should store the current Request Bulletin as it currently exists\r\nAND blue notification should display stating that the request bulletin has been sent successfully\r\nAND screen should be reloaded in View mode, with the Org filter set to \"All\" and with the \"Players with Requested Waivers\" section as the only one expanded\r\nAND \"Claim\" button should appear in the left most column of the Players with Requested Waivers table\r\nAND \"Pending\" text should be removed from the Bulletin\r\nAND \"Results\" section should now appear on the form, but collapsed\r\nAND \"Resend Notification Emails\" button should now be visible",
    "custom_steps_separated": null
  },
  {
    "id": 1031176,
    "title": "Club user wants to see Players with Requested Waivers",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126195643",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in as a Club user\r\nAND user has navigated to the waivers screen on transactions dashboard\r\n\r\n",
    "custom_steps": "WHEN the user navigates to a Request Date for which the Request Bulletin has been sent",
    "custom_expected": "THEN a \"Players with Requested Waivers\" collapsible section should be displayed and expanded by default\r\nAND this section should NOT be visible to Clubs prior to the Bulletin being sent\r\nAND \"Players with Requested Waivers\" section should match the provided wireframe and data discovery\r\nAND \"Players with Requested Waivers\" section should contain all of the players for whom waivers were requested by all Orgs for the currently selected Request Date\r\nAND the table should be sorted by Org and then by the player's name (Last, First)\r\nAND the \"Request Entry\" section should be collapsed by default\r\nAND expanding \"Request Entry\" should display the players that the Club has requested waivers on for the \"Request Date\" being viewed\r\nAND if no players are found in the Request Entry section, there should be a line of text stating \"No Waiver Requests Found\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031178,
    "title": "BOC User wants to submit a Waiver Claim on behalf of a club",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "123962681",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND user is attempting to submit a Waiver Claim on behalf of a club\r\n",
    "custom_steps": "WHEN user navigates to \"Players with Requested Waivers\" section of Waivers screen on transactions dashboard\r\n",
    "custom_expected": "THEN a Claim button should be displayed for all players if 'All' is chosen in Org dropdown\r\nBUT if user chooses a specific Org, the Claim button should not appear for players from that Org\r\nAND clicking the Claim button should launch a pop-over that allows the user to select a single Org\r\nAND the player's Org should not appear in the dropdown, nor should any other Orgs that have already submitted a waiver claim for the player\r\nAND clicking Cancel should close the popover and take no action\r\nAND selecting an Org and clicking \"Claim\" should  prompt the user to confirm the claim\r\nAND once user has confirmed they wish to proceed with the claim, modal and popover should be dismissed and user should be returned to \"Players with Submitted Requests\" table\r\nAND the Claim button should remain for the player\r\nAND if BOC user were to expand the \"Results\" section of form at this time, they would see \"Claimed by ORG date/time\" information just as though a Club had performed the Claim\r\nAND if BOC user has entered a Claim on behalf of a club and it is after 1:00PM on the Claim Expiration Date, result should show Claim Expiration Date as mm/dd/yyyy in the result and 12:59 pm as the time in the result",
    "custom_steps_separated": null
  },
  {
    "id": 1031180,
    "title": "BOC User wants to view Waiver Claim results",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126195967",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 15,
    "custom_preconds": "GIVEN a user is logged in as BOC user\r\nAND user has navigated to Waivers screen on Transactions dashboard\r\nAND user has selected a Request Date for which the Request Bulletin has already been sent ",
    "custom_steps": "WHEN user has selects a Request Date for which the Request Bulletin has already been sent ",
    "custom_expected": "THEN the \"Results\" collapsible section should be available\r\nAND this section should be open by default, with the remaining sections collapsed when the current date is equal to the Claim Period expiration date\r\nAND the Results table should match the provided data discovery and wireframe\r\nAND the Results Bulletin Comments text area should be available and visible per the wireframe\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031193,
    "title": "User wants sending Waiver Results Bulletin to properly set results for players who have secured waivers",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128294001",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 16,
    "custom_preconds": "GIVEN Waivers have been requested for a player\r\nBUT these requested waivers do not yet have a result\r\nAND these requested waivers have NOT been claimed or cancelled\r\n",
    "custom_steps": "WHEN Waiver Result Bulletin is sent",
    "custom_expected": "THEN results should be set according to the following criteria:\r\nFor UR waivers,result text should be set to \"Secured for the purposes of UR\".\r\nFor TRADE waivers for non-optioned players, result text should be set to  \"Secured Through Conclusion of Championship Season\"\r\nFor all other waivers, result text should be set to \"Secured until {Waiver Claim Expiration Date}\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031195,
    "title": "Automatically create a UR transaction if UR waivers were requested for a player and no team claimed him",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120775031",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 18,
    "custom_preconds": "GIVEN a UR waiver request has been submitted for one or more players\r\nAND these request(s) do not have a claiming Org\r\nAND these requests have not been cancelled ",
    "custom_steps": "WHEN the Waiver Results Bulletin is sent",
    "custom_expected": "THEN an Unconditional Release transaction should be created by the system and automatically approved if one does not already exist for this player from this Bulletin\r\nAND Transaction Date  should be set to the Current Date\r\nAND Club and Org should be set to request Org \r\nAND Create, Approved, and Last Changed Date should be set to the current date\r\nAND Waiver Link Transaction ID should be set to requests's Transaction ID \r\nAND a system should create a non-clickable link in the players history\r\nAND system should create entry in Player History (black font), Description = Unconditional Release, Code = UNCRL , From Org/Club\r\nAND system should update player's MJ and MN Roster Status to Free Agent\r\nAND system should Update player's Org and Club to Null\r\nAND transaction should be added to Daily Transaction Bulletin",
    "custom_steps_separated": null
  },
  {
    "id": 1031197,
    "title": "Club user wants to view Waiver Claim Results",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "118958159",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 20,
    "custom_preconds": "GIVEN a club user is logged in and viewing Waivers Screen\r\n",
    "custom_steps": "WHEN user selects a Request Date for which Results Bulletin has been sent ",
    "custom_expected": "THEN if the Org had at least one submitted request a table should display containing ONLY the players that the Org requested waivers on, and include the Results as displayed on the Waiver Results Bulletin\r\nBUT if the Org did not have at least one submitted request,  the text \"No Waivers Requested\" should display\r\nAND 'Players Claimed' subsection should be displayed\r\nAND If the Org had at least one player that they entered a claim on - whether or not they were determined to be the \"Eligible\" Org, the Players Claimed table should display per the wireframe and include only the players that the viewing Org submitted a claim for\r\nBUT if the Org was deemed to be the Eligible Org, then the \"Results\" should say \"Eligible\"\r\nAND if the Org was not deemed to be the Eligible Org, then the \"Results\" should say \"Not Eligible\"\r\nAND  if the Org did not have at least one player that they claimed, then the text \"No Players Claimed\" should display",
    "custom_steps_separated": null
  },
  {
    "id": 1031199,
    "title": "Club user wants to see a Create Waiver Claim Assignment button for player",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128296073",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 22,
    "custom_preconds": "GIVEN a club user is logged in \r\nAND club has requested REVOCABLE waivers for one or more players\r\nAND the waivers have been claimed\r\nBUT the waivers have not been cancelled\r\nAND current time is before 1:30 PM on Withdrawal Expiration Date",
    "custom_steps": "WHEN user selects the relevant Request Date on Waivers screen\r\n",
    "custom_expected": "THEN user should see a Create Waiver Claim button in the \"Player Results\" table for these players\r\nBUT this button should not appear after 1:30 PM on Withdrawal Expiration Date",
    "custom_steps_separated": null
  },
  {
    "id": 1031200,
    "title": "BOC user wants to see appropriate button for a player in Results table",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128296115",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 23,
    "custom_preconds": "GIVEN a BOC user is logged in and viewing Waivers screen",
    "custom_steps": "WHEN user navigates to \"Player Results\" table within \"Results\" section ",
    "custom_expected": "THEN if Waivers have been cancelled for a player, then no button should display\r\nAND if the BOC can only Cancel waivers for the player, then a simple \"Cancel\" button should be displayed\r\nAND if the BOC can create a player notification, then a split button should be available with \"Player Notif.\", and \"Cancel\" available. (requested UR waivers that were not Claimed and not Cancelled)\r\nAND if the BOC can Player Accept or Player Reject, then a split button should be available with \"Player Notif.\", \"Player Accept\", \"Player Reject\" and \"Cancel\" available. (requested UR waivers that were Claimed and not Cancelled for which a waiver claim assignment has not yet been created.)\r\nAND if the BOC can Create a Waiver Claim for a player, then a split button should be available with \"Create Waiver Claim\" and \"Cancel\" available. (Revocable, claimed requests for which a waiver claim does not already exist)",
    "custom_steps_separated": null
  },
  {
    "id": 1031201,
    "title": "BOC user wants to send Waiver Result Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "118958225",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 24,
    "custom_preconds": "GIVEN a user is logged in as BOC user\r\nAND user has navigated to Waivers Request Entry Screen\r\nAND user has selected a date for which a Request Bulletin has been sent \r\nAND \"Send Result Bulletin\" button is available",
    "custom_steps": "WHEN user clicks \"Send Result Bulletin\" button ",
    "custom_expected": "THEN system should store the current Result Bulletin as it currently exists\r\nAND blue notification should display stating that the result bulletin has been sent successfully\r\nAND screen should be reloaded in View mode, with the Org filter set to \"All\" and with the \"Results\" as the only section expanded\r\nAND \"Edit\" button should no longer be available for this Request Date\r\nAND \"Claim\" buttons should no longer be available for this Request Date for the BOC or for Clubs",
    "custom_steps_separated": null
  },
  {
    "id": 1031202,
    "title": "Club user wants PDF of results bulletin attached to notification they receive",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131379913",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 25,
    "custom_preconds": "GIVEN a club user is logged in with permissions to view a waiver results bulletin\r\n",
    "custom_steps": "WHEN user receives a notification that a result bulletin has been sent (or notifications resent)",
    "custom_expected": "THEN \"Description\" in the notifications widget should be clickable\r\nAND clicking on the description should download the associated pdf of the results bulletin",
    "custom_steps_separated": null
  },
  {
    "id": 1031183,
    "title": "Waiver Permissions(Player Profile) - Club User",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128343849",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 26,
    "custom_preconds": "GIVEN a specific permission has been created to control the visibility of the \"Waivers\" collapsible section on the Transactions tab\r\nAND this permission has been given to all those with Waivers permissions\r\nAND Club user is logged in with this permission",
    "custom_steps": "WHEN user navigates to the Waivers Section of Transactions Tab on a Pro Player Profile ",
    "custom_expected": "THEN user should be able to view the Request Date, Claim Expiration, Requesting Club, Type and Secured information\r\nBUT only Club users that are part of the requesting Org with this permission should be able to view the Claimed By, Awarded, Withdrawal Date, Cancelled and Cancellation Reason information\r\nAND other Clubs should see these columns as blank",
    "custom_steps_separated": null
  },
  {
    "id": 1031184,
    "title": "Waiver Permissions(Player Profile) - BOC User",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128343849",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 27,
    "custom_preconds": "GIVEN a specific permission has been created to control the visibility of the \"Waivers\" collapsible section on the Transactions tab\r\nAND this permission has been given to all those with Waivers permissions\r\nAND BOC user is logged in with this permission",
    "custom_steps": "WHEN user navigates to the Waivers Section of Transactions Tab on a Pro Player Profile",
    "custom_expected": "THEN user should be able to view the data for all columns",
    "custom_steps_separated": null
  },
  {
    "id": 1031211,
    "title": "User wants to search for Waivers - Permissions",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130116011",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 28,
    "custom_preconds": "GIVEN a user is logged in as Club or BOC\r\nAND logged in user has permission to view the Waivers Screen\r\nAND user has navigated to advanced search screen",
    "custom_steps": "WHEN user executes an Advanced Search for Waivers\r\n",
    "custom_expected": "THEN BOC users should be able to see all results\r\nBUT Club users should only be able to see:\r\n-All requests that have been included on a Request Bulletin (NO Pending requests)\r\n-All Claims made by their own Org that have been included on a Results Bulletin\r\n-All Claims made by other Orgs on requests they entered that have been included on a Results Bulletin\r\n-All Withdrawals made by their own Org",
    "custom_steps_separated": null
  },
  {
    "id": 1031213,
    "title": "User wants PDF of Results Bulletin attached to the email they receive",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129842149",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 29,
    "custom_preconds": "GIVEN a user is logged in as Club or BOC\r\nAND email addresses have been entered in Waivers section of email utility for BOC and one or more clubs",
    "custom_steps": "WHEN a Waiver Result Bulletin is sent",
    "custom_expected": "THEN Waiver Results email received by BOC and Club users entered on email utility should have a PDF of the day's bulletin attached \r\nBUT if no entries exist, then no attachment should be provided",
    "custom_steps_separated": null
  },
  {
    "id": 1031181,
    "title": "BOC user wants to send Waiver Request Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128626185",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 30,
    "custom_preconds": "GIVEN a BOC user is logged in and attempting to Send a Request Bulletin\r\nAND \"Send Emails\" is set to \"YES\"\r\nAND \"Send Notification\" is checked off under \"Request Bulletin\" for BOC and Club users",
    "custom_steps": "WHEN user clicks \"Send Request Bulletin\"",
    "custom_expected": "THEN system should generate an email to all users listed in the Email Utility Result bulletin with \"Send Notification\" selected for the Org(s) that have Request Bulletin - Send Notification selected\r\nAND All entered waiver requests should be included in this email\r\nAND system should also generate an email to all users listed in the Email Utility Result Bulletin with \"Send Notification, no trades\" selected for the Org(s) that have Request Bulletin - Send Notification, No TRDs selected\r\nBUT only OPT, OR and UR waiver requests should be included in that email\r\nAND Subject of the emails should be \"mm/dd/yyyy Wvr Req Bulletin\" with the Request Date displayed\r\nAND Top of email should display (with proper bulletin #and dates populated):\r\n     -MLB - Waiver Request Bulletin\r\n     -Bulletin #1003353 Mon 08/15/2016\r\n     -Claim period expires Wed 08/17/2016\r\nAND Format of each request should be:\r\n     -Type - Requesting Org\r\n     -Player Last, Player First Middle Initial. - POS - MLS: 0.000\r\n     -Last TX: (as displayed on bulletin in system)\r\nAND Bottom of email should contain:  \"ALL WAIVER INFORMATION IS TO REMAIN STRICTLY CONFIDENTIAL. DO NOT FORWARD THIS INFORMATION. VIOLATIONS MAY RESULT IN FINES OR OTHER DISCIPLINE. End of Bulletin*\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031182,
    "title": "BOC user wants to send Waiver Result Bulletin to Club users",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128679367",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 31,
    "custom_preconds": "GIVEN a BOC user is logged in and attempting to send a Waiver Result Bulletin\r\nAND Send Emails\" is set to \"YES\"\r\nAND \"Send Notification\" is checked off under \"Result Bulletin\" for Club users",
    "custom_steps": "WHEN user clicks \"Send Result Bulletin\"",
    "custom_expected": "THEN system should generate an email to all users listed in the Email Utility Result bulletin with \"Send Notification\" selected for Clubs that have Result Bulletin - Send Notification selected. All Waiver Requests will be included\r\nAND system should also generate an email to all users listed in the Email Utility Result Bulletin with \"Send Notification, no trades\" selected for the Org(s) that have Result Bulletin - Send Notification, No TRDs selected\r\nBUT this email should be identical to the one generated for \"Send Notification\", except no TRD requests should be shown\r\nAND Subject of the emails should be \"mm/dd/yyyy Wvr Res Bulletin\" with the Request Date displayed\r\nAND Top of email should display (with proper bulletin #and dates populated):\r\n-MLB - Waiver Result Bulletin\r\n-Full Club Name (Ex: Los Angeles Dodgers)\r\nAND The remainder of the email should be broken out into two sections. Each section only appears if it is relevant to the Club\r\nAND bulletin should display a \"Results\" section that details the results for any requests that the viewing Org submitted. If none were submitted for this request date, this should not be displayed. Format as follows:\r\nResults of request bulletin 1003347 dated Tue 08/09/2016 which expired on Thu 08/11/2016\r\n-Format of each result should be:\r\n-Player Last, Player First M.I. - Type (ex:TRD)\r\n-{Waiver Result}\r\nAND if player was not claimed, Waiver Result should match what is displayed on the Results section for BOC (ex: Secured through end of the Championship Season)\r\nBUT if player was claimed, then Claiming information should be shown. Eligible Org has . \r\nExample:\r\n-Claimed by: MIA 8/11/2016 12:58\r\n-TB 8/11/2016 12:32\r\n-LAA 8/11/2016 12:46\r\n-TOR 8/11/2016 12:35\r\n-HOU 8/10/2016 16:16\r\n-NYY 8/11/2016 12:44\r\nAND after the Request section, a section should appear detailing the results of any Claims that the Org made, if any\r\nBUT if no claims were made by the Org then this section does not appear. Format as follows:\r\nResults of your claims from request bulletin 1003347 dated Tue 08/09/2016 which expired on Thu 08/11/2016\r\n-Player Last, Player First M.I. - Type (ex:TRD)\r\n-{Waiver Claim Result}\r\nAND Bottom of email should contain -\r\n\"ALL WAIVER INFORMATION IS TO REMAIN STRICTLY CONFIDENTIAL. DO NOT FORWARD THIS INFORMATION. VIOLATIONS MAY RESULT IN FINES OR OTHER DISCIPLINE. End of Bulletin *\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031189,
    "title": "User wants to print PDF of Results Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130301109",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 32,
    "custom_preconds": "GIVEN a user is logged in as Club or BOC\r\nAND user has navigated to waivers screen\r\nAND user has chosen a request date for which the Result Bulletin has already been sent ",
    "custom_steps": "WHEN user clicks \"Print\"",
    "custom_expected": "THEN system should allow the user to select \"Result Bulletin\" from the options available\r\nAND Selecting Result Bulletin should download a pdf of that day's Result Bulletin for the viewing Org to the user's computer\r\nBUT if no Requests exist for the date then no Print button displays",
    "custom_steps_separated": null
  },
  {
    "id": 1031190,
    "title": "User wants to print PDF of Request Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126717989",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 33,
    "custom_preconds": "GIVEN a user is logged in as Club or BOC\r\nAND user has navigated to waivers screen\r\nAND user has chosen a request date for which the Request Bulletin has already been sent",
    "custom_steps": "WHEN user clicks \"Print\"",
    "custom_expected": "THEN system should allow the user to select \"Request Bulletin\" from the options available\r\nAND selecting Request Bulletin should download a pdf of that day's Request Bulletin to the user's computer\r\nBUT if no Requests exist for the date then no Print button displays",
    "custom_steps_separated": null
  },
  {
    "id": 1031191,
    "title": "BOC user wants to be able to preview PDF of Request or Results Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131393813",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 34,
    "custom_preconds": "GIVEN a BOC user is logged in \r\nAND user has permissions to view Waivers Screen",
    "custom_steps": "WHEN user navigates to a specific request date on Waivers screen",
    "custom_expected": "THEN user should always see a \"Print\" button\r\nAND if the Request Bulletin has not yet been sent, user will only see the \"Request Bulletin\" option\r\nAND if the Request Bulletin has not yet been sent, clicking \"Print>Request Bulletin\" should generate PDF using current saved info\r\nBUT if the Request Bulletin has been sent, but not the Results Bulletin, user should see \"Result Bulletin\" as an option as well as Request Bulletin\r\nAND if the Result Bulletin has not yet been sent, clicking \"Print>Result Bulletin\" should generate the pdf using the current saved information and should not show the detailed results for waivers that will be secured\r\nAND if no Requests exist for the date then no Print button should display",
    "custom_steps_separated": null
  },
  {
    "id": 1031192,
    "title": "Club user wants to print PDF of Results Bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131379927",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 35,
    "custom_preconds": "GIVEN a club user is logged in\r\nAND user has navigated to the waivers screen\r\nAND user has selected a request date for which the Result Bulletin has already been sent",
    "custom_steps": "WHEN user clicks the \"Print\" button",
    "custom_expected": "THEN system should allow user to select \"Result Bulletin\" from the options available\r\nAND selecting Result Bulletin should download a pdf of that day's Result Bulletin for the viewing Org to the user's computer\r\nAND if no Requests exist for the date then no Print button should display",
    "custom_steps_separated": null
  },
  {
    "id": 1031185,
    "title": "User wants to generate Player Notification for a view Waiver Claim Results - Claimed",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128295817",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 36,
    "custom_preconds": "GIVEN a club user is logged in\r\nAND user's club has Requested UR Waivers for a player that have been claimed but have not been cancelled",
    "custom_steps": "WHEN user navigates to the relevant bulletin ",
    "custom_expected": "THEN user should see a Player Notif. button for any UR waiver request that was not Cancelled\r\nAND clicking the Player Notif. button should open the Notice to Player of UR waiver claim and Right to Terminate Contract\" if claimed\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031187,
    "title": "User wants to generate Notice to Player of Intention of Unconditional Release Letter",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131553625",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 38,
    "custom_preconds": "GIVEN a Club or BOC user is logged in\r\nAND a Player has been Unconditionally Released as a result of UR waivers",
    "custom_steps": "WHEN user navigates to Released player's profile",
    "custom_expected": "THEN \"Notice to Player of Intention of Unconditional Release\" should appear as an option in the Create New menu for players under \"Player Letters\"\r\nAND selecting this option should print the proper pdf of the letter using the proper information from the player's profile\r\nAND users should have the ability to alter the Date used for the form. (Should be pre-populated with current date)\r\nAND users should have the ability to alter the player's name as it will appear on the form. (Should be pre-populated with player's First Last)\r\nAND users should have the ability to enter the Expiration Date to be populated on the form\r\nAND if the language on player's profile is set to anything other than Spanish, form should be generated in English\r\nBUT if the language on the player's profile is set to Spanish, form should be generated in Spanish\r\nAND PDF should follow provided format and details",
    "custom_steps_separated": null
  },
  {
    "id": 1031188,
    "title": "User wants to generate Notice to Player of UR and Termination of Major League contract letter",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131553623",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 39,
    "custom_preconds": "GIVEN a club or BOC user is logged in\r\nAND user has navigated to the Create New Menu on a Professional Player Profile",
    "custom_steps": "WHEN user clicks Create New\r\n\r\n",
    "custom_expected": "THEN \"Notice to Player of Unconditional Release & termination of M/L contract\" should appear as an option under \"Player Letters\"\r\nAND selecting this option should print the proper pdf of the letter using the proper information from the player's profile\r\nAND users should have the ability to alter the Date used for the form. (Should be pre-populated with current date)\r\nAND users should have the ability to alter the player's name as it will appear on the form. (Should be pre-populated with player's First Last)\r\nAND users should have the ability to enter the Release Date to be populated on the form\r\nAND form should be generated in Spanish if the language on the player's profile is set to Spanish\r\nBUT form should be generated in English if the language on the player's profile is set to anything other than Spanish\r\nAND pdf should follow the provided format and details",
    "custom_steps_separated": null
  },
  {
    "id": 1031212,
    "title": "User wants to view existing Waiver Claim Assignment",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130554163",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 40,
    "custom_preconds": "GIVEN a user is logged in with permissions to advanced search for waivers\r\nAND user has navigated to Advanced Search screen\r\nAND \"Waiver Claim Assignment\" is an option in Transactions Advanced Search in the \"Transaction Type\"",
    "custom_steps": "WHEN user conducts  an advanced search for \"Waiver Claim Assignment\"",
    "custom_expected": "THEN system should properly return the results from ebis1\r\nAND clicking on the date should open the associated waiver claim assignment\r\nAND form should match the provided wireframe and data discoveries\r\nAND same behavior should be present in the associated players' player histories",
    "custom_steps_separated": null
  },
  {
    "id": 1031214,
    "title": "WCA automatically created for irrevocable waivers upon sending results bulletin",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120775785",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 41,
    "custom_preconds": "GIVEN non-UR Irrevocable waivers have been requested for one or more players\r\nAND these waivers have been claimed ",
    "custom_steps": "WHEN Results bulletin is sent\r\n",
    "custom_expected": "THEN a waiver claim assignment should be created and submitted to BOC for these players\r\nAND for Outright Waivers, the Waiver Claim Assignment should have a Cash Consideration of $20,000 unless the player was Rule 5 DE/SEL, then it should be be $25,000\r\nAND for all waivers, the player should be listed as long as the Cash Consideration and that is it\r\nAND clubs should not be able to manipulate the terms at all in the Submitted to BOC state",
    "custom_steps_separated": null
  },
  {
    "id": 1031215,
    "title": "User wants to create Waiver Claim Assignment - Player Accept",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132932673",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 42,
    "custom_preconds": "GIVEN waivers have been requested for a player\r\nAND relevant request bulletin has been sent\r\nAND waivers have been claimed by one or more orgs\r\nAND relevant results bulletin has been sent\r\nAND user has navigated to the player table in Claims/results section on waivers screen\r\nAND \"Player Accept\" is available in a split button next to this player's name",
    "custom_steps": "WHEN user clicks \"Player Accept\"",
    "custom_expected": "THEN system should create a preliminary waiver claim assignment for the selected player and redirect the user to the transaction\r\nAND Waiver Claim Assignment should have the creating Org's consideration be for the player, and the claiming Org's Cash Consideration = $1\r\nAND  player the waivers were requested for should NOT be able to be removed from the transaction\r\nAND if a preliminary waiver claim assignment already exists for the selected player, the system should redirect the user to the existing waiver claim assignment instead of creating a new one\r\nAND club should have the ability to add additional players and conditions as needed, then the WCA should follow the stateflow of a Trade",
    "custom_steps_separated": null
  },
  {
    "id": 1031216,
    "title": "BOC user wants to approve Waiver Claim Assignment",
    "section_id": 122025,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132933349",
    "created_by": 103,
    "created_on": 1494869919,
    "updated_by": 103,
    "updated_on": 1494869972,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 43,
    "custom_preconds": "GIVEN a BOC user is logged in \r\nAND a Waiver Claim Assignment has been submitted for a player\r\nAND BOC user has navigated to the submitted Waiver Claim Assignment ",
    "custom_steps": "WHEN user clicks \"Approve\"\r\n",
    "custom_expected": "THEN system should run all On Approve rule checks that would run on an outright trade\r\nAND once all rule checks pass, the Waiver Claim Assignment should be marked as \"Approved\"\r\nAND system should Follow all On Approve rules listed for Outright Trades, including:\r\n- Daily Transaction Bulletin entry\r\n- Player History entry\r\n- Auto-Creation of a Recall where applicable\r\n- Roster Status, Club and Player Info updates.\r\n- Clearing of the Approvals item for the BOC and generation of a notification for the involved Clubs",
    "custom_steps_separated": null
  },
  {
    "id": 1031226,
    "title": "User wants to receive error when placing player with submitted waiver request on 7 Day Concussion DL",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "114439387",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a Place on 7 Day Concussion DL tx for a player\r\nAND selected player has a submitted waiver request (Request Bulletin not yet sent) with Request Date on or after the Injury Date on the DL tx",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Player with a submitted waiver request may not be assigned. The waiver request should be deleted before re-submitting the assignment.\"\r\nAND Clicking Back should close the modal and return user to the tx\r\n\r\nBOC should NOT be able to override this error ",
    "custom_steps_separated": null
  },
  {
    "id": 1031227,
    "title": "User wants to receive error when placing player who has previously secured waivers on 7 Day Concussion DL",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "114439379",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a Place on 7 Day Concussion DL tx for a player\r\nAND player has any secured waivers (waivers in effect on profile) as of the Injury Date",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Previously secured {0} waivers for this player will be cancelled as a result of this placement.\"\r\nAND {0} should be replaced with the waiver type\r\nAND Clicking Back should close the modal and return user to the tx\r\nAND clicking Ignore and Continue should ignore the error and continue with tx",
    "custom_steps_separated": null
  },
  {
    "id": 1031228,
    "title": "User wants to receive error when placing player who has any pending waiver requests on 7 Day Concussion DL",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "114439371",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a Place on 7 Day Concussion DL tx for a player\r\nAND selected player has a pending waiver request (Claimed WvResultStatus or no RequestResult)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Player has pending {0} waiver request(s) that will be cancelled as a result of this placement.\"\r\nAND {0} should be replaced with the waiver type\r\nAND Clicking Back should close the modal and return user to the tx\r\nAND clicking Ignore and Continue should ignore the error and continue with tx",
    "custom_steps_separated": null
  },
  {
    "id": 1031229,
    "title": "Allow BOC user to approve a place on 7-Day Concussion DL transaction",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "114132225",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN a Place on 7-Day Concussion DL transaction has been submitted to the BOC\r\nAND transaction is in  Preliminary, Submitted to BOC, or Rejected status\r\nAND blue \"Approve\" button is available",
    "custom_steps": "WHEN the BOC user clicks \"Approve\"\r\nAND all rules have passed or been overridden",
    "custom_expected": "THEN the transaction status is updated to \"Approved\"\r\nAND item is reloaded in view mode if it was in edit mode\r\nAND a successful blue notification (#80) is displayed that states the transaction was approved\r\nAND item is removed from the approvals clipboard\r\nAND player's Player History is updated: Code = DL07J Description = Place on 7-day Concussion DL, From Org/Club and To Org/Club fields should be in black font\r\nAND player's Major League Roster status is set to 7-Day Concussion DL",
    "custom_steps_separated": null
  },
  {
    "id": 1031232,
    "title": "Reject a 60 Day DL tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115051247",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN user is logged in as a BOC user\r\nAND a club has submitted a \"Place on 60 Day DL\" transaction to BOC for approval\r\nAND BOC user sees \"Reject\" button on the transaction in view or edit mode",
    "custom_steps": "WHEN user clicks \"Reject\"",
    "custom_expected": "THEN system should run all required field and formatting checks and display any relevant error or warning messages\r\nAND once all rules have passed system should update transaction status to \"Rejected\"\r\nAND successful reject notification (message #78) should be displayed\r\nAND item should be removed from Approvals Clipboard\r\nAND player's pending Major League Roster status should be reversed\r\nAND pending Player History entry should be removed\r\nAND any action items regarding the transaction should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1031230,
    "title": "BOC user approves Reinstate from DL tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994739",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a club has submitted a \"Reinstate from DL\" transaction to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction\r\n",
    "custom_steps": "WHEN user clicks the \"Approve\" button\r\n",
    "custom_expected": "THEN system should run all required field, formatting, on Submit, and on Approve rules checks\r\nAND once all rules have passed or been overridden transaction status is updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History should be updated: Code = REINS Description = Reinstate From {Disabled List}, From Org/Club and To Org/Club fields to be in black font\r\nAND player's MJ roster status should be set to Active",
    "custom_steps_separated": null
  },
  {
    "id": 1031233,
    "title": "BOC user wants to approve a Transfer to 60 Day DL tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "116375983",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 7,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a club has submitted a \"Transfer to 60-Day DL\" transaction to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction",
    "custom_steps": "WHEN user clicks the \"Approve\" button",
    "custom_expected": "THEN once all rules have passed or been overridden transaction status should be updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History is updated: Code = TR60J Description = Transfer to 60-Day DL, From Org/Club and To Org/Club fields to be in black font.\r\nAND if player's current MJ roster status is Rehab 7-Day Concussion DL or Rehab 15-Day DL, then system should set MJ roster status to \"Rehab 60Day DL\"\r\nAND if player's current MJ roster status is 7-Day Concussion DL or 15-Day DL then system should set MJ roster status to \"60 Day DL\"",
    "custom_steps_separated": null
  },
  {
    "id": 1031234,
    "title": "BOC user wants to reverse a Rehab Assignment tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "116391173",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 8,
    "custom_preconds": "GIVEN a \"Place on Rehabilitation Assignment\" tx has been submitted for a player and approved\r\nAND user is logged in as BOC user \r\nAND user is viewing the approved transaction",
    "custom_steps": "WHEN user clicks grey \"Reverse\" button\r\n",
    "custom_expected": "THEN system should run all required field and formatting checks and display relevant error or warning messages\r\nAND successful reverse notification should display (message #79)\r\nAND transaction status should update to \"Reversed\"\r\nAND any action items generated by the transaction should be removed\r\nAND reversed transaction should display in Player History with \"Voided\" in front of the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1031231,
    "title": "BOC user wants to approve Transfer of Rehab Assignment tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "117566007",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 9,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a club has submitted a \"Transfer from Rehab Assignment\" tx to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction",
    "custom_steps": "WHEN user clicks the \"Approve\" button",
    "custom_expected": "THEN once all rules have passed or been overridden transaction status should be updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History is updated: Code = RHBTR  Description = Transfer of Rehab, From Org/Club and To Org/Club fields to be in black font\r\nAND player's Rehab Club should be set to the Assignment Club\r\nAND no updates should be made to player's MJ roster status",
    "custom_steps_separated": null
  },
  {
    "id": 1031220,
    "title": "BOC user wants to approve a Return from Rehab tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "117594135",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 10,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a \"Return from Rehab\" tx has been submitted to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction",
    "custom_steps": "WHEN user clicks the \"Approve\" button",
    "custom_expected": "THEN once all rules have passed or been overridden transaction status should be updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History is updated: Code = RHBRT Description = Return from Rehab, From Org/Club and To Org/Club fields to be in black font\r\nAND If players MJ roster status was Rehab 60 Day DL, then player's MJ roster status should be set to 60 Day DL.\r\nAND If players MJ roster status was Rehab 7 Day Concussion DL, then player's MJ roster status should be set to 7 Day Concussion DL.\r\nAND If players MJ roster status was Rehab 15 Day DL, then player's MJ roster status should be set to 15 Day DL.\r\nAND If players MJ roster status was Restricted/Assigned, then player's MJ roster status should be set to Restricted.\r\nAND If players MJ roster status was Suspended/Assigned, then player's MJ roster status should be set to Suspended.\r\nAND Rehab Club should be set to null",
    "custom_steps_separated": null
  },
  {
    "id": 1031217,
    "title": "User wants reinstating a player from the DL to update their information on the Recertifications tab",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "119205011",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in\r\nAND a player has been reinstated from the DL",
    "custom_steps": "WHEN user views the \"Recertifications\" tab",
    "custom_expected": "THEN \"Reinstatement Date\" column should only be populated once the player has been Reinstated from the DL\r\nAND \"Reinstatement Date\" column should have the Reinstatement Date entered on their Reinstatement for this DL placement\r\nAND the \"Recertification Due\" column should be populated with Recertifications that have or should have occurred, in a comma separated list\r\nAND if the Reinstatement Date is on or before any of the Recertification Due dates listed - these dates should be removed from the form",
    "custom_steps_separated": null
  },
  {
    "id": 1031221,
    "title": "Club user wants to submit a Recertification tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "118764655",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 12,
    "custom_preconds": "GIVEN a club user is attempting to submit a \"Recertification\" transaction\r\nAND transaction is in preliminary state in view or edit mode\r\nAND blue \"Submit\" button is available on the form\r\n\r\n",
    "custom_steps": "WHEN user clicks \"Submit\"",
    "custom_expected": "THEN system should run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message\r\nAND system should run On Submit rules check\r\nAND after the rules have passed, the system should update the status of the transaction to \"Approved\"\r\nAND system should reload the transaction in view mode, and display a successful approve blue notification. Messages #76\r\nAND no entry should be added to the player's player history\r\nAND no notification for \"Approved\" should be generated since this transaction is auto-approved\r\nAND no approvals item should be generated for this transaction either since this transaction is auto-approved",
    "custom_steps_separated": null
  },
  {
    "id": 1031218,
    "title": "Allow BOC user to approve a place on 7-Day DL transaction",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "118853843",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 13,
    "custom_preconds": "GIVEN a Place on 7-Day DL transaction has been submitted to the BOC\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND blue \"Approve\" button is available",
    "custom_steps": "WHEN the BOC user clicks \"Approve\"\r\nAND all rules have passed or been overridden",
    "custom_expected": "THEN the transaction status should be updated to \"Approved\"\r\nAND item should reloaded in view mode if it was in edit mode\r\nAND a successful blue notification (#80) should be displayed that states the transaction was approved\r\nAND item should be removed from the approvals clipboard\r\nAND player's Player History should be updated: Code = DL07N Description = Place on 7-day DL, From Org/Club and To Org/Club fields should be in black font\r\nAND player's Minor League Roster status should be set to 7-Day DL",
    "custom_steps_separated": null
  },
  {
    "id": 1031224,
    "title": "Reject a 60 Day DL tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "119141579",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 14,
    "custom_preconds": "GIVEN user is logged in as a BOC user\r\nAND a club has submitted a \"Place on 60 Day DL\" transaction to BOC for approval\r\nAND BOC user sees \"Reject\" button on the transaction in view or edit mode",
    "custom_steps": "WHEN user clicks \"Reject\"",
    "custom_expected": "THEN system should run all required field and formatting checks and display any relevant error or warning messages\r\nAND once all rules have passed system should update transaction status to \"Rejected\"\r\nAND successful reject notification (message #78) should be displayed\r\nAND if item was on the Approvals clipboard it should be removed\r\nAND player's pending Major League Roster status should be reversed\r\nAND pending Player History entry should be removed\r\nAND pending Minor League roster status should be set to value in history prior to the tx submission\r\nAND pending player history entry should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1031222,
    "title": "BOC user approves Reinstate from DL tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120399861",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 15,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a club has submitted a \"Reinstate from DL\" transaction to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction\r\n",
    "custom_steps": "WHEN user clicks the \"Approve\" button\r\n",
    "custom_expected": "THEN system should run all required field, formatting, on Submit, and on Approve rules checks\r\nAND once all rules have passed or been overridden transaction status is updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History should be updated: Code = REINS Description = Reinstate From {Disabled List}, From Org/Club and To Org/Club fields to be in black font\r\nAND player's MJ roster status should be set to Active",
    "custom_steps_separated": null
  },
  {
    "id": 1031223,
    "title": "BOC user wants to reject a Rehab Assignment tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "120392473",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 16,
    "custom_preconds": "GIVEN user is logged in as a BOC user\r\nAND a club has submitted a \"Place on Rehabilitation Assignment\" tx to BOC for approval\r\nAND BOC user sees \"Reject\" button on the transaction in view or edit mode",
    "custom_steps": "WHEN user clicks \"Reject\"",
    "custom_expected": "THEN once all rules have passed system should update transaction status to \"Rejected\"\r\nAND successful reject notification (message #78) should be displayed\r\nAND item should be removed from Approvals Clipboard\r\nAND player's pending Minor League Roster status should be reversed\r\nAND pending Player History entry should be removed\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031225,
    "title": "User wants to submit a Return from Rehab tx to the BOC for approval",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "121160453",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 17,
    "custom_preconds": "GIVEN a user is attempting to submit a \"Return from Rehab\" transaction\r\nAND transaction is in preliminary or rejected state",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Submit to BOC\" button",
    "custom_expected": "THEN system should run required field and format check\r\nAND any errors should cause the system to generate an error message\r\nAND once all rules pass the system should update transaction status to \"Submitted to BOC\"\r\nAND system should reload the transaction in view mode\r\nAND system should display successful save blue notification #76\r\nAND If the players pending MJ roster status is Rehab 60 Day DL, then set the players MJ pending roster status to 60 Day DL.\r\nAND If players pending MJ roster status was Rehab 7 Day DL, then it should be set to 7 Day DL.\r\nAND If players pending MJ roster status was Restricted/Assigned then it should be set to Restricted.\r\nAND If players pending MJ roster status was Suspended/Assigned then it should be set to Suspended.\r\nAND system should create an entry in green font in Player's Player History: Code = RHBRT, Description = Return from Rehab, From Org/Club and To Org/Club fields\r\nAND an approval item should be generated and display on the BOC - Minor Transactions - Admin's Approvals widget\r\nAND any attached files should be displayed and available for download from the attachments column of the Approvals Widget\r\nAND any populated comments should be displayed in the comments column of the Approvals Widget\r\nAND clicking Player Name hyperlink should open Player Profile to the Player History tab in the same window/tab\r\nAND clicking Type hyperlink should open the submitted transaction in view mode in the same window/tab",
    "custom_steps_separated": null
  },
  {
    "id": 1031219,
    "title": "BOC user wants to approve Transfer of Rehab Assignment tx",
    "section_id": 122041,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "121082837",
    "created_by": 103,
    "created_on": 1494870175,
    "updated_by": 103,
    "updated_on": 1494870228,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 18,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND a club has submitted a \"Transfer from Rehab Assignment\" tx to BOC for approval\r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected state\r\nAND BOC user sees \"Approve\" button in blue on the transaction",
    "custom_steps": "WHEN user clicks the \"Approve\" button",
    "custom_expected": "THEN once all rules have passed or been overridden transaction status should be updated to \"Approved\"\r\nAND if item was in edit mode it is reloaded in view mode\r\nAND successful save blue notification is displayed (message #80)\r\nAND item is removed from approvals clipboard\r\nAND player's Player History is updated: Code = RHBTR  Description = Transfer of Rehab, From Org/Club and To Org/Club fields to be in black font\r\nAND player's Rehab Club should be set to the Assignment Club\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031258,
    "title": "Club can view players current and previous contracts on Contracts Tab",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 1,
    "custom_preconds": "GIVEN the user is on a Professional Players profile",
    "custom_steps": "WHEN the user clicks the contracts tab\r\n",
    "custom_expected": "THEN the tab will load displaying the Contracts history widget which displays the information of any current or previous contracts that the player has in the system",
    "custom_steps_separated": null
  },
  {
    "id": 1031266,
    "title": "Create new Contract for Professional Player and update to approved",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 2,
    "custom_preconds": "GIVEN the user has created a new contract ",
    "custom_steps": "WHEN the user is updating the status of the contract ",
    "custom_expected": "THEN they will be able to update the contract to approved ",
    "custom_steps_separated": null
  },
  {
    "id": 1031235,
    "title": "Terms Submitted > Ready for Signature",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 4,
    "custom_preconds": "GIVEN a flag is set for a contract in the Terms Submitted state",
    "custom_steps": "WHEN user attempts to move contract to Ready for Signature without correcting current flag \r\nAND clicks override button",
    "custom_expected": "THEN flag remains",
    "custom_steps_separated": null
  },
  {
    "id": 1031240,
    "title": "Pending Approval (confirmed or not) > Approved or Approved for next year",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 5,
    "custom_preconds": "GIVEN a flag is set for a contract in Pending Approval (confirmed or not)",
    "custom_steps": "WHEN a user would like to Approve contract for this year or next",
    "custom_expected": "THEN flag is removed",
    "custom_steps_separated": null
  },
  {
    "id": 1031239,
    "title": "BOC user can view Approval items",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 6,
    "custom_preconds": "GIVEN that a BOC user wants to view a listing of any Approvals items",
    "custom_steps": "WHEN user logs in and views their homepage",
    "custom_expected": "THEN the system displays Approvals widget that contains pending approval items ",
    "custom_steps_separated": null
  },
  {
    "id": 1031236,
    "title": "Agent profiles display in widget",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 7,
    "custom_preconds": "GIVEN the LRD wants to view a directory of agent profiles ",
    "custom_steps": "WHEN the LRD locates the Agents Widget",
    "custom_expected": "THEN the agent profiles should be reflected in the Agents Widget\r\nhttp://30ac5x.axshare.com/#p=dashboard",
    "custom_steps_separated": null
  },
  {
    "id": 1031237,
    "title": "Verify BOC can view directory of agencies",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 8,
    "custom_preconds": "GIVEN a user wants to view the directory of agencies",
    "custom_steps": "WHEN the user scans their Agency widget",
    "custom_expected": "THEN all agencies should be listed",
    "custom_steps_separated": null
  },
  {
    "id": 1031238,
    "title": "View Award Entry Utility",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 4,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 9,
    "custom_preconds": "GIVEN a user want to view a player's awards",
    "custom_steps": "WHEN a user selects Major Contracts from the left nav ",
    "custom_expected": "THEN user is taken to the award entry utility",
    "custom_steps_separated": null
  },
  {
    "id": 1031260,
    "title": "Generate a New Payroll Report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121379893",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 10,
    "custom_preconds": "GIVEN the user has navigated to the Payroll Utility \r\nAND has selected a Year and \"New\" for Type [C182117]\r\nAND has completed the \"As of\" and \"Save As\" fields \r\nAND the Generate Button is now active",
    "custom_steps": "WHEN the user clicks Generate",
    "custom_expected": "THEN  Clicking Generate will generate the CBT Impact Player Details Report, and the LRD Impact Player Details report and display the report in the utility, per the wireframe (styling and other specifics to be handled in follow up stories). \r\nAND CBT Impact Player Details will be displayed by default. \r\n\r\nAND Wireframe:\r\nhttp://copbdc.axshare.com/#p=payroll_report",
    "custom_steps_separated": null
  },
  {
    "id": 1031261,
    "title": "LRD user views a different Org's LRD 40-Man Payroll or CBT Payroll",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121379979",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 11,
    "custom_preconds": "GIVEN the user is viewing a Payroll Report (saved or generated) ",
    "custom_steps": "WHEN the user changes the \"Org\" dropdown and the \"Show\" dropdown",
    "custom_expected": "THEN the report will update based on the selected dropdowns ",
    "custom_steps_separated": null
  },
  {
    "id": 1031242,
    "title": "Club user views Deferred Comp Utility",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "119199865",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 12,
    "custom_preconds": "GIVEN the club user has logged in \r\nAND has clicked Major Contracts from the Left nav tab ",
    "custom_steps": "WHEN they click the Deferred Compensation Tab ",
    "custom_expected": "THEN the Club's Deferred Compensation funding utility will load \r\nAND The Org displayed will be locked to the Club user's Org (cannot view other Orgs). \r\nAND \"Funding As Of\" will default to July of the current year through July, and July of the following year through December. (Ex: In August 2016 this will read July 2017) \r\nAND Discount Rate is defaulted to 5%. ",
    "custom_steps_separated": null
  },
  {
    "id": 1031244,
    "title": "As a user I want to be able to run the Deferred Comp Funding Report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137746103",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 14,
    "custom_preconds": "GIVEN \"Deferred Comp Funding\" is an option in the Report Listing widget with a Category of Payroll",
    "custom_steps": "WHEN user selects the Deferred Comp Funding report ",
    "custom_expected": "THEN system should allow the user to set the prompts according to the documentation\r\nAND clubs should ONLY be able to select their own Org\r\nAND the data displayed in the Deferred Comp Funding report should equal the data generated by the Deferred Comp Utility when the same criteria are entered\r\nAND the report and layout should match the specifications\r\nAND a new permission group to control the visibility of this report should be created and added to the existing admin-xxx-all user ids",
    "custom_steps_separated": null
  },
  {
    "id": 1031245,
    "title": "As a user I want to run the Multi-Year Report - Player Details report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137988415",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 15,
    "custom_preconds": "GIVEN \"Multi-Year Report - Player Details\" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements (including those delivered in prior stories)\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1031246,
    "title": "As a user I want to run the Multi-Year Report - Team Details report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137988431",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 16,
    "custom_preconds": "GIVEN \"Multi-Year Report - Team Details\" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements (including those delivered in prior stories)\r\nAND entering the desired prompts and running the report should work and match the requirements.",
    "custom_steps_separated": null
  },
  {
    "id": 1031247,
    "title": "As a user I want to be able to run the Total Payroll Comp - Player Details report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137988451",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1496331957,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 17,
    "custom_preconds": "GIVEN \"Total Payroll Comp - Player Details\" is a report in the Report listing widget",
    "custom_steps": "WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements (including those delivered in prior stories)\r\nAND entering the desired prompts and running the report should work and match the requirements  \r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1031248,
    "title": "As a user I want to be able to run the Total Payroll Comp - Team Details report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137988455",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1496331975,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 18,
    "custom_preconds": " \"Total Payroll Comp - Team Details\" is a report in the Report listing widget",
    "custom_steps": "WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements (including those delivered in prior stories)\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1031262,
    "title": "View Payroll Forecast",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "124644661",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 19,
    "custom_preconds": "GIVEN the user has navigated to the Payroll Forecast Utility ",
    "custom_steps": "WHEN the user selects values for each dropdown \r\nAND clicks the activated View button ",
    "custom_expected": "THEN the utility will load and display the selected criteria \r\nAND the top filters will remain editable with \"View\" button still enabled ",
    "custom_steps_separated": null
  },
  {
    "id": 1031263,
    "title": "Edit Payroll Forecast utility",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "124644571",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 20,
    "custom_preconds": "GIVEN an LRD user is logged in and viewing Payroll Forecast Utility\r\nAND edit button is available",
    "custom_steps": "WHEN user clicks edit button ",
    "custom_expected": "THEN system should reload the form in edit mode\r\nAND all of the filters should become disabled\r\nAND the \"View\" button at the top of the page should also be disabled or not display\r\nAND Payroll details section should be displayed in edit mode, per the wireframe\r\nAND the only values that should not be editable in the Payroll details are the totals and any rows associated with players that have been removed\r\n(Additional values that cannot be edited are detailed in the story #125729051.LABELS)",
    "custom_steps_separated": null
  },
  {
    "id": 1031264,
    "title": "Add new Cash Transactions",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "124644561",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 21,
    "custom_preconds": "GIVEN a user is logged in as LRD user\r\nAND user is viewing the Payroll Forecast Utility in edit mode\r\nAND \"Add Transaction\" button is displayed beneath the Cash Transactions portion of the utility",
    "custom_steps": "WHEN user clicks \"Add Transaction\"\r\n",
    "custom_expected": "THEN system should launch a popup that allows the user to select the Payor, Payee, Transaction Date and Amount that are associated with the transaction\r\nAND an \"Add Transaction\" button should become enabled when all of the required fields have been entered properly\r\nAND clicking this \"Add Transaction\" button should close modal, and populate Cash Transaction table of BOTH LRD and CBT payroll report utility with cash transaction information for selected Org\r\nAND the reverse of the transaction shhould also be added to the counterpart's cash transactions table so that for one it appears as a positive, and the other as a negative. (Ex: If Payor is ARI and Payee is BOS for a transaction of 1,00,000, then ARI will have that amount subtracted from their totals while BOS will have it added)\r\nAND if the filter is set to \"All\" then the cash transaction should only be displayed once",
    "custom_steps_separated": null
  },
  {
    "id": 1031265,
    "title": "Save changes to Payroll Forecast Utility",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "124644511",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 22,
    "custom_preconds": "GIVEN a user is logged in as LRD user\r\nAND user is viewing the Payroll Report Utility in edit mode\r\nAND \"Save\" button is available \r\n",
    "custom_steps": "WHEN user clicks \"Save\"\r\n",
    "custom_expected": "THEN system should save all of the entered values, and reload the utility in View mode\r\nAND successful blue notification should display",
    "custom_steps_separated": null
  },
  {
    "id": 1031249,
    "title": "As a user I want to run the CBT Assessment Report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132930397",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 23,
    "custom_preconds": "GIVEN the user is viewing the Report Listings widget",
    "custom_steps": "WHEN user selects 'Competitive Balance Tax Assessment' report from the widget \r\nAND enters desired prompts",
    "custom_expected": "THEN the report will load with the entered prompts in separate tab.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031250,
    "title": "As a user I want to run the CBT/ LRD Player Details Reports",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132930271",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 24,
    "custom_preconds": "GIVEN the user is viewing the Report Listings widget",
    "custom_steps": "WHEN user selects 'Payrolls - Player Details' report from the listing widget \r\nAND selects \"CB\" or \"LRD\" from Payroll Type drop down\r\nAND click OK\r\n\r\n",
    "custom_expected": "THEN \r\n\"C.B. Tax Payrolls - Player Details\" or \"LRD 40-Man Payrolls - Player Details\" report will be launched depending on the selection. Entering the desired prompts and running the report will work and match the requirements. \r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1031251,
    "title": "As a user I want to run the CBT/ LRD Team Details Reports",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132930287",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 25,
    "custom_preconds": "GIVEN the user is viewing the Report Listings widget",
    "custom_steps": "WHEN user selects 'Payrolls - Team Details' report from the listing widget \r\nAND selects \"CB\" or \"LRD\" from Payroll Type drop down\r\nAND click OK",
    "custom_expected": "THEN \r\n\"C.B. Tax Payrolls - Team Details\" or \"LRD 40-Man Payrolls - Team Details\" report will launch depending on what was selected. Entering the desired prompts and running the report will work and match the requirements.",
    "custom_steps_separated": null
  },
  {
    "id": 1031259,
    "title": "As an LRD user I want to be able to print the Forecast Utility",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130338445",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 31,
    "custom_preconds": "GIVEN an LRD user is viewing the Payroll Forecast Utility\r\nAND there is a \"Print\" button available ",
    "custom_steps": "WHEN user clicks Print",
    "custom_expected": "THEN system should run the Payroll Forecast Utility report with the same criteria as are currently selected on screen\r\nAND the report should run successfully just as if it had been run directly from the Reports widget",
    "custom_steps_separated": null
  },
  {
    "id": 1031257,
    "title": "View existing Saved Payroll Report",
    "section_id": 122059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121379885",
    "created_by": 103,
    "created_on": 1494870409,
    "updated_by": 103,
    "updated_on": 1494870456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18584,
    "display_order": 32,
    "custom_preconds": "GIVEN the user has navigated to the Payroll Utility ",
    "custom_steps": "WHEN the user selects a Year and selects anything OTHER than \"New\" \r\n",
    "custom_expected": "THEN the View button becomes active \r\nAND clicking View will load the saved report ",
    "custom_steps_separated": null
  }
]