[
  {
    "id": 1225544,
    "title": "As a user I want to see a Contract & Inv tab on an International Amateur Player Profile where applicable",
    "section_id": 147917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479722",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1525713419,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user logs in with international player with Contract and Investigation History Widget permissions\r\n",
    "custom_steps": "WHEN viewing the international player profile ",
    "custom_expected": "THEN If an International Amateur player has a Minor Contract OR Investigation Request OR Investigation in the system, then users should see a Contracts & Inv tab for the player. \r\nAND Loading the Contracts & Inv tab should display the Contract History widget on top, with the Investigation History widget on the bottom. \r\nAND If the logged in user does not have permission to see the Contract History widget or the Investigation History widget, then do not display this tab.\r\nAND If the logged in user does not have permission to see the Contract History widget, do not display it. \r\nAND If the logged in user does not have permission to see the Investigation History widget, do not display it.",
    "custom_steps_separated": null
  },
  {
    "id": 1225547,
    "title": "As a user I want to see Venezuela and Dominican Republic at the top of the country dropdowns",
    "section_id": 147917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156274370",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1525713463,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 4,
    "custom_preconds": "GIVEN a club user logs in with International player edit permissions\r\n",
    "custom_steps": "WHEN user select the country dropdowns in International New Player screen or International Amateur Profile",
    "custom_expected": "THEN Dominican Republic and Venezuela should appear at the top of the Country fields, with the remainder in alpha order in the following places: \r\n - International New Player screen\r\n - International Amateur Profile\r\nAND The Country fields throughout the rest of the system should continue to work with United States displayed at the top and the rest of the countries in alpha order.",
    "custom_steps_separated": null
  },
  {
    "id": 1225552,
    "title": "As a user I want to see height as dropdowns",
    "section_id": 147917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155572293",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1525714164,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is attempting to edit an international amateur profile",
    "custom_steps": "WHEN user attempts to edit the \"Height\" fields ",
    "custom_expected": "THEN * The 2 height fields should be converted to 2 dropdowns to limit bad entries\r\nAND the feet field should contain values 4, 5, 6, 7 and 8\r\nAND the inches field should contain values 0 - 11\r\nAND existing values should not be lost with the change from text to dropdown",
    "custom_steps_separated": null
  },
  {
    "id": 1224400,
    "title": "As a BOC user I want to merging 2 profiles to maintain Level 2 Registration information",
    "section_id": 147918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922347",
    "created_by": 103,
    "created_on": 1522344664,
    "updated_by": 103,
    "updated_on": 1525198515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, any Level 2 Registration information will be maintained regardless of which player's information is selected as \"Master\".\r\n  * Example - if either of the profiles were selected for Level 2 Registration or Elevated, the merged profile will maintain this - regardless of which was selected as the Master.\r\nAND In the unique scenario that this information exists for both profiles selected for merge, then use the earliest entered information for the Level 2 Registered Date. For the Selected By fields use all Organizations from both profiles selected for merge. \r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 1224420,
    "title": "As a user I want to see a Scouting tab on an international amateur profile",
    "section_id": 147918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058320",
    "created_by": 103,
    "created_on": 1522344664,
    "updated_by": 103,
    "updated_on": 1525198515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 3,
    "custom_preconds": "GIVEN user is logged in with permission to view the Scouting History Widget",
    "custom_steps": "WHEN Loading an International Amateur Profile",
    "custom_expected": "THEN the user sees a \"Scouting\" tab\r\nAND Loading the Scouting tab will display the Scouting History widget. \r\nAND The widget will match the provided data discovery and wireframe.\r\nAND Population of the widget will be covered in followup stories. \r\nAND The \"College Prospect\" column will be handled later. \r\n\r\n*I think we need a new \"Scouting user\" LDAP to control hiding these new widgets that are shared between international/domestic, or just create new LDAPs for them*",
    "custom_steps_separated": null
  },
  {
    "id": 1225554,
    "title": "As a user I want to see a \"New Profile\" button when viewing an International Registration Profile",
    "section_id": 147918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156294063",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1525714833,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 7,
    "custom_preconds": "GIVEN a user is logged in with international edit permissions",
    "custom_steps": "WHEN user views an international registration profile",
    "custom_expected": "THEN user should see a \"New Player\" button only in VIEW mode\r\nAND this button should be the last one displayed\r\nAND clicking the New Player button should take the user to the \"New Player\" screen and allow them to enter a new profile",
    "custom_steps_separated": null
  },
  {
    "id": 1225580,
    "title": "As a BOC user I want the actions taken after an International Amateur advanced search tracked",
    "section_id": 147918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902113",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 156,
    "updated_on": 1525780812,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 12,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Advanced Search\r\nAND user navigated to the International Amateur Advanced Search",
    "custom_steps": "WHEN user advanced search for any Intl Ama player",
    "custom_expected": "THEN the system will keep a record of the following information about the actions taken for each search: \r\n - Profiles opened as a result of the search. (Last, First and Player ID)\r\n - Whether the user \"tagged\" the player as a result of the search.\r\n - Whether the user created a Contract as a result of the search. \r\n - Whether the user registered the player as a result of the search.",
    "custom_steps_separated": null
  },
  {
    "id": 1224416,
    "title": "As a BOC user I want to be able to determine who is alerted when new L2 Investigation Results Requests are entered",
    "section_id": 147919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155998095",
    "created_by": 103,
    "created_on": 1522344664,
    "updated_by": 103,
    "updated_on": 1525198515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user is logged in with Edit Permissions for L2 Investigation Results Requests widget\r\n",
    "custom_steps": "WHEN user click \"Emails\" under Utilities tab",
    "custom_expected": "THEN user will see a new section is added to the Email Utility titled \"International\". \r\nAND A subsection is added to that utility titled \"L2 Investigation Results Requests\". \r\nAND This subsection is ONLY editable by users who have permission to edit the L2 Investigation Results Requests widget. \r\nAND This follows the same format  and functionality as any of our other email utilities. (Ability to delete rows, add rows, check off \"Send Notificiation\" and \"Send Failure Notif\" options available, etc.).\r\nAND The Email Utility's standard Edit/Save should work for this section as well.",
    "custom_steps_separated": null
  },
  {
    "id": 1225070,
    "title": "As a Club user I want to be able to download the template required for spreadsheet upload",
    "section_id": 147919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155926020",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1525198515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 3,
    "custom_preconds": "GIVEN a Club user logs in with international player edit permissions\r\n\r\n",
    "custom_steps": "WHEN viewing the Club Registration list widget\r\n\r\n",
    "custom_expected": "THEN the user will see a \"Spreadsheet Upload\" button.\r\nAND this button is not there for BOC users. \r\nAND Clicking \"Spreadsheet Upload\" launches the provided modal.\r\nAND Clicking the \"Download Template\" button on the modal will download the provided .xls files to the user's computer.\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=spreadsheet_upload",
    "custom_steps_separated": null
  },
  {
    "id": 1225072,
    "title": "As a Club user I want to see an error if I upload anything but an .xls or .xlsx file while trying to do spreadsheet upload",
    "section_id": 147919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155997630",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1525198515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 5,
    "custom_preconds": "GIVEN a Club user logs in with international player edit permissions\r\nAND user clicks on \"Spreadsheet Upload\" on the Club Reg List widget\r\n\r\n",
    "custom_steps": "WHEN user attaches anything but an .xls or .xlsx file\r\n\r\n",
    "custom_expected": "THEN Clicking \"Upload\" on the spreadsheet upload modal will verify that the attached file is a .xls or .xlsx file. If it is not, then the system will display an error(on the wireframe). \r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=spreadsheet_upload\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1225582,
    "title": "As a BOC user I want the actions taken after an International Amateur Create New attempt tracked",
    "section_id": 147921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902114",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 156,
    "updated_on": 1525714616,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20412,
    "display_order": 40,
    "custom_preconds": "\r\n",
    "custom_steps": "Acceptance Criteria:\r\n* The system will need to keep a record of the following information about the actions taken for each search: \r\n - Profiles opened as a result of the search. (Last, First and Player ID)\r\n - Whether the user \"tagged\" the player as a result of the search.\r\n - Whether the user created a Contract as a result of the search. \r\n - Whether the user registered the player as a result of the search.",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]