[
  {
    "id": 963146,
    "title": "Investigation History - Permissions",
    "section_id": 114899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390755",
    "created_by": 103,
    "created_on": 1492696903,
    "updated_by": 103,
    "updated_on": 1492696903,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 1,
    "custom_preconds": "GIVEN a CLUB or a BOC user has limited Investigation Permission\r\n(test_boc_approver@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com, Test-NYY-admin@mlb.com, Test-NYY-viewer@mlb.com, and test-basic-stl@mlb.com)\r\n",
    "custom_steps": "WHEN the user is in a players profile under 'Contracts' tab\r\n\r\n\r\n",
    "custom_expected": "THEN user should only be able to view what they have permission to. ",
    "custom_steps_separated": null
  },
  {
    "id": 963147,
    "title": "Investigations Search - Permissions",
    "section_id": 114899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139251803",
    "created_by": 103,
    "created_on": 1492696903,
    "updated_by": 103,
    "updated_on": 1492696903,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 2,
    "custom_preconds": "GIVEN a CLUB or BOC user with/without Investigation permission logs in",
    "custom_steps": "WHEN user is in advance search\r\n",
    "custom_expected": "THEN only users that have Investigations permissions should see \"Investigations\" as an option in advanced search. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 963148,
    "title": "As a Club user I want to be prevented from creating a request for a player I do not have permission to request an inviestigation for",
    "section_id": 114899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515725",
    "created_by": 103,
    "created_on": 1492696903,
    "updated_by": 103,
    "updated_on": 1492696903,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 3,
    "custom_preconds": "GIVEN A club user is viewing different org's player profile ",
    "custom_steps": "WHEN Club Selects \"Investigation Request\" for that player\r\n\r\n",
    "custom_expected": "THEN system will know player is currently under contract with a different Org, then an error will display. \r\n**Error Message:**\r\nThis player is currently under contract with another Organization. You may not request an investigation for this player. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 963149,
    "title": "Investigation Form - Permissions",
    "section_id": 114900,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138391269",
    "created_by": 103,
    "created_on": 1492697016,
    "updated_by": 136,
    "updated_on": 1492786177,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 1,
    "custom_preconds": "GIVEN Investigation permission varies for different user (Test-ARI-viewer@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com and test_boc_approver@mlb.com)",
    "custom_steps": "WHEN the users logs in\r\n",
    "custom_expected": "THEN the following should be true \r\n-The form has a view only permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but cannot edit anything. Users without the permission cannot view the form anywhere in the system.\r\n-The form has a \"registration\" permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but can only edit/create Investigations with a type = Registration. Users without this permission or the admin permission cannot edit or create Investigations anywhere in the system. \r\n-The form has an admin permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, and can edit/create any Investigation type. Users without this permission cannot edit or create non-Registration Investigations anywhere in the system.",
    "custom_steps_separated": null
  },
  {
    "id": 963150,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created prior to EBIS2)",
    "section_id": 114900,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 103,
    "created_on": 1492697016,
    "updated_by": 103,
    "updated_on": 1492697016,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in and attempting to Adv Search for an Investigation created prior to ebis2 implementation\r\nAND club user is from requesting Club for the investigation they're searching for (The Org on the Investigation Form is their Org)\r\nAND player on this investigation is currently under contract with user's org OR the player is a Free Agent\r\nAND the investigation was entered on or after January 1, 2011. \r\n",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN only Investigations that meet ALL of the above criteria should display\r\nAND Investigations that do not meet ALL of the criteria above should not display",
    "custom_steps_separated": null
  },
  {
    "id": 963151,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created in EBIS2)",
    "section_id": 114900,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 103,
    "created_on": 1492697016,
    "updated_by": 103,
    "updated_on": 1492697016,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 17524,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in and attempting to Adv Search for an Investigation created in ebis2",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History",
    "custom_steps_separated": null
  }
]