[
  {
    "id": 1225077,
    "title": "As a user I want to see files attached in ebis2 amateur in ebis2.5",
    "section_id": 148456,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922016",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN all international registration profiles were converted from ebis 2.0 to ebis 2.5 with attachments\r\nAND BOC or Club user logs to ebis 2.5 with international registration profile permission\r\n\r\n",
    "custom_steps": "WHEN user tries to download the converted files from international registration profile\r\n \r\n\r\n",
    "custom_expected": "THEN files should be available for download in 2.5",
    "custom_steps_separated": null
  },
  {
    "id": 1226110,
    "title": "As a user I do not want to wait for the Reports Widget to load in order to click the Blank Forms tab.",
    "section_id": 148457,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157778215",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in with permission to access the System Forms Widget",
    "custom_steps": "WHEN user clicks on the Reports icon on the tab nav",
    "custom_expected": "THEN system should load the Reports tab without the entire page being blocked by a spinner\r\nAND doing a browser refresh while on the Blank Forms tab should not bring the user back to the Reports tab",
    "custom_steps_separated": null
  },
  {
    "id": 1225626,
    "title": "As a user I want to Edit an existing International Amateur profile that has not yet been registered",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156057861",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in with the Unregistered profile creation LDAP",
    "custom_steps": "WHEN user is viewing an existing Unregistered profile",
    "custom_expected": "THEN user should see an Edit button, regardless of if they have Registration permissions\r\nAND if the user clicks \"Edit\", the form should reload in Edit mode, just as though the profile were being created as an Unregistered profile for the first time\r\nAND the user should be able to Save changes to the profile with the system only checking the required fields for an Unregistered, scouting profile\r\nAND iff the profile is Approved AND the user also has Registration permissions, they should see a \"Register MLSB Entered\" button on the profile\r\nAND clicking \"Register MLSB Entered\" button should reload the form in edit mode\r\nAND the user should be able to complete the registration of this player just as though they had started the profile from scratch\r\nBUT if the profile is Approved and the user ONLY has Registration permissions, they should only see a \"Register MLSB Entered\" button on the profile (not edit)\r\nAND clicking \"Register MLSB Entered\" button should reload the form in edit mode\r\nAND the user should be able to complete the registration of this player just as though they had started the profile from scratch",
    "custom_steps_separated": null
  },
  {
    "id": 1226111,
    "title": "As a Scout Admin I want to Reject a new International Amateur profile",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156328636",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN a scout admin user is logged in with permission to reject new International Amateur profile\r\nAND scout admin user navigated to Admin clipboard \r\nAND scout admin user should see any player profile with a Submitted status on their Admin clipboard\r\nAND scout admin opens the submitted profile from the Clipboard and it should open the item in edit mode ",
    "custom_steps": "WHEN user click \"Reject\" button \r\n",
    "custom_expected": "THEN system will save any edits made to the profile. No required field or format checks are run. \r\nAND A blue notification will be thrown \"Successfully Rejected\"\r\nAND The profile's status should be updated to \"Rejected\". \r\nAND The profile entry should be removed from the Admin Clipboard.\r\nAND The Scout's Clipboard entry should be updated to \"Rejected\". \r\nAND The profile should not appear in the Registration Admin widget. \r\n\r\n*Note that even MLSB Admins with BOC permissions should be able to complete this flow.*",
    "custom_steps_separated": null
  },
  {
    "id": 1226112,
    "title": "As a scouting user I want to re-submit a new International Amateur profile for review",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156328648",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "GIVEN a scouting user is logged in with permission to create a new International Amateur profile \r\nAND a scouting user navigated to their Scout Clipboard \r\nAND a scouting user opens international amateur profiles created by them in a Rejected status in edit mode with a \"Save\" \"Cancel\" and \"Submit\" button available.\r\nAND a scout user should be able to edit the profile and save changes without a required field or formatting check.\r\nAND saving the profile while in a Rejected status will revert the profile's status to \"Preliminary\".  \r\n",
    "custom_steps": "WHEN user click \"Submit\" from a rejected profile ",
    "custom_expected": "THEN system should save any edits made, run a required field and format check and complete the submission, just as though the profile were in a Preliminary status.\r\nAND A blue notification will be thrown \"Successfully Submitted\" \r\nAND The profile should have its status updated to Submitted, and appear on the Admin Clipboard and Scout Clipboard as Submitted.",
    "custom_steps_separated": null
  },
  {
    "id": 1226114,
    "title": "As a scouting user I want to resubmit a new international workout report for review",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157829567",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "GIVEN a scouting user logged in with permission to Submit new International Workout Reports \r\nAND a scout user navigated to their Scout Clipboard\r\nAND a scout opens a Rejected report from the Clipboard in edit mode \r\nAND a scout should be able to edit the report and save changes without a required field or formatting check.",
    "custom_steps": "WHEN a scout user click \"Submit\" from a rejected report ",
    "custom_expected": "THEN the system should save any edits made, run a business rules, required field and format check and complete the submission, just as though the report were in a Preliminary status. \r\nAND A blue notification is thrown \"Successfully Submitted\"\r\nAND The report should have its status updated to Submitted, and appear on the Admin Clipboard and Scout Clipboard as Submitted.",
    "custom_steps_separated": null
  },
  {
    "id": 1226107,
    "title": "As a user I want to see International Suspects in Red in quick search",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955432",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 5,
    "custom_preconds": "GIVEN user logs in with International Amateur player permission\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user is using International Amateur quick search to search for International Suspects",
    "custom_expected": "THEN International Suspects should appear in the results in red font.",
    "custom_steps_separated": null
  },
  {
    "id": 1227690,
    "title": "As a BOC user I want to be able to add a new trainer/agent to the system from a Club entered profile",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154013943",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374297,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC user logged in with create permissions for Registration profile and Trainer/Agent profile\r\nAND user is in edit mode on a club registration profile as BOC user\r\nAND user navigated to a \"New Trainer/Agent\" hyperlink in the Trainer/Agent section of the profile\r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"New Trainer/Agent\" link",
    "custom_expected": "THEN the sytsem will open a new trainer/agent profile in a new tab/window with the information from the club entered trainer/agent section prepopulated in the profile.\r\nAND Club users do not see this hyperlink.\r\nAND The BOC user should have the ability to save the profile, just like they would from any other entry point.\r\nAND Saving the profile should autopopulate the \"BOC Profile\" field with the newly entered trainer's information.\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=create_new_trainer_agent_v1",
    "custom_steps_separated": null
  },
  {
    "id": 1227686,
    "title": "As a Reg Admin I want to be able to merge International Suspect profiles",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158204048",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374508,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 7,
    "custom_preconds": "GIVEN a user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget",
    "custom_steps": "WHEN user navigate to Reg Admin widget",
    "custom_expected": "THEN International Suspects should now appear in the Reg Admin widget under the \"Unregistered\" filter, or if the filter is set to \"All\". \r\nAND Users with merge permissions should be able to merge International suspects just like they are able to merge International Prospects. \r\nAND Merging these profiles should carry over any associated Daily Reports, if applicable. \r\nAND International Suspects should appear in the merge confirmation message in red text.",
    "custom_steps_separated": null
  },
  {
    "id": 1227689,
    "title": "As a scouting user I want to be able to edit the Scouting Info section of a Registration player",
    "section_id": 148458,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271967",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374508,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 8,
    "custom_preconds": "GIVEN Scout and Scout admin logs with permission to create/edit unregistered player profiles\r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user is viewing an existing Registration profile",
    "custom_expected": "THEN If the player already has scouting info, or if past the player's eligible to sign date, show the edit button, and allow them to edit only the scouting info\r\nBUT If the player does not have any scouting info, HIDE the edit button, and show the \"Add Scouting Info\" in view mode only\r\nAND Non-Scouting Users the Add Scouting Info button will display in view AND edit mode; a confirmation modal will display if the player is in edit mode ONLY.",
    "custom_steps_separated": null
  },
  {
    "id": 1225060,
    "title": "As a user I want to be able to run the Level 2 List Report",
    "section_id": 148459,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156527093",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user logs\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in reporting widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN \"Level 2 List\" will appear on Report listing widget. Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"International\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will continue to use the existing LDAP. \r\nAND The requirements used in-app should be reflected in the report.\r\nAND Club users do not see Players Selected by another Org in the report.\r\nBUT BOC users see all L2 Players, and they also have their own set of columns. \r\nBUT MLSB user and unaffiliated users should only see players Selected by the BOC.  \r\n\r\n*Note for QA - This should basically replicate each Org's Level 2 Registration List widget in report form with some additional fields*\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Level+2+List+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Level+2+List+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/display/EBIS/Level+2+List+-+Population%2C+Logic+and+Sort+Considerations\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Level+2+List+-+Prompts\r\n\r\nReport Security: \r\nhttps://wiki.mlbam.com/display/EBIS/Level+2+List+-+Audience+-+Security-+Frequency",
    "custom_steps_separated": null
  },
  {
    "id": 1225059,
    "title": "As a user I want to be able to run the Club Tracking List Report",
    "section_id": 148459,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155610030",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN Club or BOC user logs \r\n\r\n",
    "custom_steps": "WHEN user is in reporting widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN \"Club Tracking List\" report will appear on the Report listing widget. Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"International\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will continue to use the existing LDAP. \r\nAND The requirements used in-app should be reflected in the report.\r\nBUT Club users do not see trainer/agent/league information on the report that was entered by another Org.\r\nAND Club users do not see \"Pre-Verified\" as a registration status on the report itself or as a prompt. \r\n\r\n*Note for QA - This should basically replicate each Org's Club Registration List widget in report form with some additional fields*\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/Club+Tracking+List+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/Club+Tracking+List+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/display/EBIS/Club+Tracking+List+-+Population%2C+Logic+and+Sort+Considerations\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/Club+Tracking+List+-+Prompts\r\n\r\nReport Security: \r\nhttps://wiki.mlbam.com/display/EBIS/Club+Tracking+List+-+Audience+-+Security+-+Frequency",
    "custom_steps_separated": null
  },
  {
    "id": 1225579,
    "title": "As a BOC user I want International Amateur advanced searches tracked",
    "section_id": 148460,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902064",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Advanced Search\r\nAND user navigated to the International Amateur Advanced Search",
    "custom_steps": "WHEN user advanced search for any Intl Ama player",
    "custom_expected": "THEN the system needs to keep a record of every international amateur advanced search undertaken. \r\nAND the system will need to keep a record of the following information about each search: \r\n - Username of the user conducting the search\r\n - Org of the user conducting the search\r\n - Date of the search\r\n - Time of the search (EST)\r\n - The filters applied\r\n - The operators applied with each filter\r\n - The value entered for each filter\r\n - How many results were returned\r\nAND Each time the user hits \"Search\" is considered a new and unique search.",
    "custom_steps_separated": null
  },
  {
    "id": 1227657,
    "title": "As a Scout I want to see an error if I attempt to delete a player profile that has associated reports",
    "section_id": 148461,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156330352",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scout user is logged in\r\nAND user is attempting to delete a player profile",
    "custom_steps": "WHEN user clicks \"Delete\" on a profile ",
    "custom_expected": "THEN system should check to ensure that the player does not have any Player Reports for them\r\nAND if one or more items is found for the player, system should display an error,  Messages #35:\r\n\"You are attempting to delete a player profile that has items associated with it. Please delete any reports prior to deleting this profile.\"\r\nAND user should only have \"Back\" button available\r\nAND clicking back should return the user to the point of entry\r\nAND this rule should also run when clicking Delete from the Scout clipboard \r\nAND if the user is deleting multiple items from their clipboard one item encountering an issue should not prevent other, unassociated items to fail",
    "custom_steps_separated": null
  },
  {
    "id": 1225623,
    "title": "As a scouting user I want clicking \"Add Player\" on a Daily Report to check if the player already exists",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271746",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\nhttps://tb5api.axshare.com/#p=possible_matches\r\nMatching Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nGIVEN a scouting user is logged in with permission to create Daily Reports\r\nAND user has navigated to a new preliminary Daily Report in edit mode",
    "custom_steps": "WHEN user clicks \"Add Player\" on a Daily Report ",
    "custom_expected": "THEN system should run a standard 4 of 7 match check against all International Amateur players. (assume no limitations at this point) \r\nAND if a match to an existing player is found, the user should be presented with the match, or matches\r\nAND user should have the option to add the player found to the Daily Report, using a \"Add Existing Player\" button\r\nAND if the user adds an existing player to the report, any relevant fields should pre-populate on the Daily Report from the player's existing profile\r\nAND the user should also have a \"Back\" button to allow them to go back and adjust the information entered and try again\r\nAND the user should NOT have the option to add the entered information to the report if a match is found",
    "custom_steps_separated": null
  },
  {
    "id": 1225624,
    "title": "As a scouting user I want to save a new Daily Report",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271730",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to save Daily Reports",
    "custom_steps": "WHEN user is creating a new International Daily report",
    "custom_expected": "THEN there should be a \"Save\" button as well as a \"Cancel\" button\r\nAND clicking Cancel should ask the user to confirm that they wish to lose their changes\r\nAND if they confirm, then the creation process should be canceled, the profile should be discarded and the user should be returned to their point of entry\r\nAND clicking \"Save\" should save the report as \"Preliminary\"\r\nAND no required field or formatting checks are run when saving a report in preliminary",
    "custom_steps_separated": null
  },
  {
    "id": 1226119,
    "title": "As a user I want to be able to search for Daily Reports",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157796606",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "Search Requirements: \r\nhttps://wiki.mlbam.com/display/EBIS/Search+-+Daily+Report\r\nGIVEN a user is logged in with permission to view Daily Reports",
    "custom_steps": "WHEN user navigates to advanced search",
    "custom_expected": "THEN \"International Daily Report2\" should be an option \r\nAND this advanced search should have the filters available per the above requirements document\r\nAND the available columns should match the above requirements document\r\nAND export to excel and pdf should work for the results set\r\nAND by default, only Approved reports should be shown in results UNLESS the user purposefully adds a status filter to the search to look for other statuses\r\nNOTE: This functionality should not impact the existing \"International Daily Report\"  advanced search - that will be 'turned off' at a later date (after Intl go-live in 2.5)(currently only available in amateur)",
    "custom_steps_separated": null
  },
  {
    "id": 1226116,
    "title": "As a scouting user I want to resubmit a new Daily Report for review",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157829749",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_-_responsive_layout\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\nGIVEN a scout user is logged in with permission to submit daily reports\r\nAND one or more scouting reports submitted by the user is in Rejected status",
    "custom_steps": "WHEN user navigates to their scout clipboard",
    "custom_expected": "THEN user should see any daily reports created by them on their Scout Clipboard when they are in a Rejected status\r\nAND opening a Rejected report from the Clipboard should open the report in edit mode with a \"Save\" \"Cancel\" and \"Submit\" button available\r\nAND the scout should be able to edit the report and save changes without a required field or formatting check\r\nAND clicking \"Submit\" from a rejected report should save any edits made, run a business rules, required field and format check and complete the submission, just as though the report were in a Preliminary status\r\nAND blue notification should be thrown \"Successfully Submitted\"\r\nAND the report should have its status updated to Submitted, and should appear on the Admin Clipboard and Scout Clipboard as Submitted",
    "custom_steps_separated": null
  },
  {
    "id": 1227654,
    "title": "As a scouting user I want to see an error if attempting to submit a Daily Report that includes a player that now exists",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953834",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 5,
    "custom_preconds": "Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scout is logged in with permission to submit daily reports\r\nAND user has a new daily report open in edit mode\r\nAND one or more players have been added to the report that do NOT yet have a profile in the system",
    "custom_steps": "WHEN user clicks \"Submit\" ",
    "custom_expected": "THEN system should run a match check for any players that have been added to the report that do not yet have a profile in the system\r\nAND if any of the new players is found to now have a profile in the system, system should display an error(Messages #47):\r\n\"This report cannot be submitted because Player Name matches an existing profile. Please update this entry in the Daily Report and try again.\"\r\nAND only \"Back\" button should be available\r\nAND clicking \"Back\" should return user to the point of entry\r\nAND this check should also be run on approve IF new players are being created on Approve",
    "custom_steps_separated": null
  },
  {
    "id": 1227670,
    "title": "As a scouting user I want to be able to create a new Trainer/Agent while editing a Daily Report",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157617188",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373276,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 6,
    "custom_preconds": "GIVEN a Scout/Scout Admin logs in \r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user opens a Daily Report in edit mode\r\n\r\n",
    "custom_expected": "THEN there will be \"Add New Trainer\" hyperlink (See wireframe for placement).\r\nAND Clicking \"Add New Trainer\" will open a new trainer/agent form in a new tab/window for the user to complete the profile. \r\nAND The buttons available will depend on if the user is a scout or not. \r\nAND Clicking \"Save\" or \"Submit\" on the new trainer/agent form will store the trainer/agent profile appropriately, just as though it were created through the normal \"Create New\" workflow. \r\nAND After the new trainer/agent has been saved - it should be prepopulated in the \"Agents involved in workout\" field of the Daily Report. This should not remove any trainer/agent names that have already been selected.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_1",
    "custom_steps_separated": null
  },
  {
    "id": 1227671,
    "title": "As a user I want to edit an existing Daily Report",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953875",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373276,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 7,
    "custom_preconds": "GIVEN scouting user logs in with permission to edit existing Daily Report\r\n\r\n",
    "custom_steps": "WHEN user click edit button on the Daily Report",
    "custom_expected": "THEN Daily Report Editors (Scouts) can only edit Daily Reports in the Preliminary and Rejected statuses that they created.\r\nAND Daily Report Approvers (Scout Admins) can edit Daily Reports in Preliminary or Rejected statuses, as well as Approved and Submitted reports.\r\nAND No one can edit deleted reports. \r\nAND Editing a Rejected, Submitted or Approved report will NOT update any of the profile fields on the actual profiles of the players, even if they were automatically created as a result of submitting the profile.\r\nAND If a player is removed from the Daily Report after initial submission, the line item should be appropriately removed from the player's scouting history - but we will not be \"deleting\" profiles as a result of them being removed from the Daily Report that caused them to be created.",
    "custom_steps_separated": null
  },
  {
    "id": 1227673,
    "title": "As a scout I want to see an error if attempting to add a player to a Daily report that is not subject to registration",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953848",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373276,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 8,
    "custom_preconds": "GIVEN a Scout user logs in \r\nAND opens a Daily Report\r\n\r\n\r\n",
    "custom_steps": "WHEN user enters a player info and clicks \"Add Player\" button on Daily report",
    "custom_expected": "THEN system will run a match check to see if the player exists in the system. \r\nAND If a match is NOT found, and the date of birth entered is prior to 9/1/1995, then display an error. See Messages #50\r\n\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1227675,
    "title": "As a user I only want to see Daily Reports that I have permission to see",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955405",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373276,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 9,
    "custom_preconds": "GIVEN the user with and without Daily Reports permission logs in\r\n\r\n",
    "custom_steps": "WHEN user is tries to view or edit Daily Reports\r\n",
    "custom_expected": "THEN Users without permissions to view, edit or approve daily reports do not see these in the Scouting History at all. \r\nAND Users without permissions to view, edit or approve daily reports should receive a permission error if they attempt to navigate to these directly via URL.\r\nAND Users without permissions to view, edit or approve daily reports should not be able to search for these items. \r\nAND All users that have permission to view/edit/approve these reports should see these reports in the Scouting History of players and advanced search IF the record status is Approved. \r\nAND Users that are NOT identified as Scouts that have permission to view/edit/approve these reports should see these reports returned in Advanced Search if they have a status other than Approved ONLY IF the user specifically applies the status filter. If they do apply the status filter, then they should be able to see any report in the system. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these reports should see these reports returned in Advanced if they have a status other than Approved ONLY IF the creating user of the report matches the current user. \r\n  - They do not need to apply additional filters to see non-approved statuses. \r\n  - Even if they DO apply additional status filters, they cannot see non-approved reports entered by other users. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these reports should see these reports in a player's Scouting History if they have a status other than Approved ONLY IF the creating user of the report matches the current user.\r\n\r\nBusiness Rules:\r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347726",
    "custom_steps_separated": null
  },
  {
    "id": 1227691,
    "title": "As a Scouting user I want to see an error if I am attempting to submit a daily report without first submitting a trainer/agent included on the report",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158328387",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373635,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 10,
    "custom_preconds": "GIVEN Scout or Scout Admin logs in with permission to create daily report\r\nAND user selected a trainer/agent that have a status of Preliminary or Rejected status on the daily report",
    "custom_steps": "WHEN user clicks \"Submit\" on a Daily Report without first submitting a trainer/agent included on the report\r\n\r\n",
    "custom_expected": "THEN the system should check that all of the trainer/agents selected in the profile are not a Preliminary or Rejected profile. \r\nAND If any of the selected trainer/agents have a status of Preliminary or Rejected, display an error. Messages # 53\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1227692,
    "title": "As a Scout Admin I want to see an error if I am attempting to approve a daily report without first approving a trainer/agent included on the report",
    "section_id": 148462,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158328382",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373635,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 11,
    "custom_preconds": "GIVEN Scout Admin logs in",
    "custom_steps": "WHEN user clicks \"Approve\" on a daily report without first approving a trainer/agent included on the report\r\n\r\n",
    "custom_expected": "THEN system should check that all of the trainer/agents selected in the daily report are Approved. \r\nAND If any of the included trainer/agents have a status other than \"Approved\", display an error. Messages # 54\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1225710,
    "title": "As a scouting user I want to Submit a new International Workout Report for review",
    "section_id": 148463,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499867",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery\r\nGIVEN a scouting user is logged in with permission to Submit new International Workout Reports",
    "custom_steps": "WHEN scouting user opens a preliminary player report in view mode",
    "custom_expected": "THEN user should have an Edit, Submit and Close button\r\nAND clicking Close should close the profile\r\nBUT when the report is in Edit Mode, user should have a Save, Submit and Cancel button\r\nAND clicking \"Save\" should save any edits made to the report\r\nAND no required field and formatting checks should be run given that the report is in a Preliminary state\r\nAND the report's status should not update\r\nAND clicking \"Cancel\" should ask the user to confirm that they wish to lose any changes\r\nAND if the user confirms, the report's status should remain preliminary and the report should reload in view mode\r\nAND clicking \"Submit\" should run a required field and formatting check per the data discovery\r\nAND once the report has passed the required field and formatting checks, if the report was in edit mode, it should be reloaded in view mode\r\nAND the report's status should update to \"Submitted\"\r\nAND the status should be reflected on the creating scout's Clipboard\r\nAND the player report should appear for review on the scouting Admin's Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1227838,
    "title": "As a scouting user I want to see an error if the entered OFP is not between 20 and 80",
    "section_id": 148463,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158770534",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 156,
    "updated_on": 1532372825,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Player+Report+Rules\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\nGIVEN a scouting user is logged in \r\nAND user has an intl workout report open in edit mode\r\nAND user has entered an OFP Adjusted or OFP Basic value that is NOT between 20 and 80(inclusive)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should checks that the OFP Adjusted and Basic entered is a value between 40 and 80 (inclusive)\r\nAND if not, system should display an error, Messages #45:\r\n\"The following fields contain invalid data: 1. Field Name - Value must be between 20 and 80.\"\r\nAND only Back button should be available\r\nAND clicking back should return user to entry point",
    "custom_steps_separated": null
  },
  {
    "id": 1227693,
    "title": "As a Scout Admin I want to see an error if I am attempting to approve a player report without first approving a trainer/agent included on the report",
    "section_id": 148463,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158328346",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373945,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "GIVEN Scout admin logs in\r\nAND a trainer/agent profile is not approved yet\r\n\r\n\r\n",
    "custom_steps": "WHEN user Approves a player report with the trainer/agents who is not approved yet\r\n",
    "custom_expected": "THEN system should display an error. Messages #54\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1227694,
    "title": "As a Scouting user I want to see an error if I am attempting to submit a player report without first submitting a trainer/agent included on the report",
    "section_id": 148463,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158328343",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373945,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "GIVEN Scout or Scout admin logs in\r\nAND a trainer/agent profile is in Preliminary or Rejected state\r\n\r\n",
    "custom_steps": "WHEN user Submits a player report with the trainer/agents who is in Preliminary or Rejected state",
    "custom_expected": "THEN system will display an error. Messages #53\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226045,
    "title": "As a Scout I want to submit items from my Clipboard",
    "section_id": 148464,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329315",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a scout user is logged in with permissions for Scout Clipboard",
    "custom_steps": "WHEN scout user navigates to Scout Clipboard",
    "custom_expected": "THEN user should be able to check off multiple items and hit \"Submit\"\r\nAND the system should process them in the following order: \r\n - Trainer/Agent Profiles\r\n - Player Profiles\r\n - Reports\r\nAND this should allow all items to go through, assuming that none of the individual items encounter an issue \r\nBUT if the first item in a group fails, they should all fail:\r\n  - Ex: If a player profile is reliant upon a trainer/agent submission and a player report is reliant upon the player submission, all three would fail. \r\nAND one item encountering an issue should not prevent other, unassociated items to fail: \r\n - Ex: If a player profile fails, any player reports that are NOT for that player should still succeed.",
    "custom_steps_separated": null
  },
  {
    "id": 1226030,
    "title": "As a scout I want to delete an item from my Clipboard",
    "section_id": 148464,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058682",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN a scout user is logged in with permissions for the Scout Clipboard",
    "custom_steps": "WHEN scout user navigates to their Scout Clipboard",
    "custom_expected": "THEN user should be able to select any Preliminary or Rejected item from their Clipboard\r\nAND user should be able to select multiple items at once\r\nAND clicking \"Delete\" should update each item's status to Deleted\r\nAND the Scout should see a blue confirmation message stating how many items were Deleted (X items deleted)\r\nAND the Deleted items should no longer appear on the Clipboard\r\n\r\n*Note that eventually there will be rule checks around what can be deleted, but for now assume that everything that can be selected can be deleted.*",
    "custom_steps_separated": null
  },
  {
    "id": 1227669,
    "title": "As a scout I want to see an error if I attempt to delete a Submitted item from my Clipboard",
    "section_id": 148464,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058690",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374254,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "GIVEN a Scout user logs in\r\nAND has submitted items on the Clipboard\r\n\r\n",
    "custom_steps": "WHEN user tries to delete submitted items on their clipboard",
    "custom_expected": "THEN the system should display an error. See Messages #52. \r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1226046,
    "title": "As a Scout Admin I want to be able to approve items from my Clipboard",
    "section_id": 148465,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329302",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a scout admin user is logged in with permissions for the Scout Admin Clipboard",
    "custom_steps": "WHEN scout admin user navigates to Scout Admin Clipboard",
    "custom_expected": "THEN user should be able to check off multiple items and hit \"Approve\"\r\nAND the system should process them in the order that they were submitted, based on date AND time stamp to ensure proper sequencing\r\nAND this should allow all items to go through, assuming that none of the individual items encounter an issue\r\nAND one item encountering an issue should not prevent other, unassociated items to fail:\r\n - Ex: If a player profile fails, any player reports that are NOT for that player should still succeed",
    "custom_steps_separated": null
  },
  {
    "id": 1226117,
    "title": "As a Scout Admin I want to be able to reject items from my Clipboard",
    "section_id": 148465,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157796200",
    "created_by": 103,
    "created_on": 1528213685,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "Wireframe:\r\nhttps://s8xnnx.axshare.com/#p=approve_rejecting_items\r\nGIVEN a scout admin user is logged in",
    "custom_steps": "WHEN user navigates to their Scout Admin Clipboard",
    "custom_expected": "THEN user should be able to check off multiple items and hit \"Reject\"\r\nAND the system should process them in the following order: \r\n - Trainer/Agent Profiles\r\n - Player Profiles\r\n - Reports\r\nAND this should allow all items to go through, assuming that none of the individual items encounter an issue\r\nAND one item encountering an issue should not prevent other, unassociated items to fail\r\n - Ex: If a player profile fails, any player reports that are NOT for that player should still succeed. \r\nAND if all items are Rejected successfully system should throw a blue notification \"X items successfully Rejected\"\r\nBUT if 1 or more items fail system should show a results modal",
    "custom_steps_separated": null
  },
  {
    "id": 1227840,
    "title": "As a scouting user I want any items approved to drop off my clipboard",
    "section_id": 148465,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158772766",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 136,
    "updated_on": 1532374237,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "GIVEN Scouting Admin logs in \r\nAND Scouting admin clipboard has Unregistered Player, Player Report, Daily Report , or Trainer/Agent item(s)",
    "custom_steps": "WHEN user Approves the item(s)",
    "custom_expected": "THEN the approved item or items will drop off the creating scouts clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1226036,
    "title": "As a Scout Admin I want to Approve a new Trainer/Agent profile",
    "section_id": 148466,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058496",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1530894451,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN Scouting Admin logs in with scouting and trainer/agent edit permissions\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user is viewing their Admin Clipboard",
    "custom_expected": "THEN Scouting admin should see any trainer/agent profile with a Submitted status\r\nAND Opening the submitted trainer/agent profile from the Clipboard should open the item in Edit Mode.\r\nAND There should be Save, Approve, Reject and Cancel buttons available.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the profile is reloaded in view mode and no changes are saved.\r\nAND Clicking \"Save\" will save any edits made to the profile. All required field and formatting checks should be run given that the profile is in a Submitted state. The profile's status will not update.\r\nAND Clicking \"Approve\" will save any edits made to the profile. All required field and formatting checks should be run. Once the field checks pass, the form should be reloaded in View Mode, and the profile's status should be updated to \"Approved\". \r\nAND The trainer/agent entry should be removed from the Admin Clipboard as well as the submitting Scout's Clipboard.",
    "custom_steps_separated": null
  },
  {
    "id": 1227839,
    "title": "As a scouting user I do not want to see the International dashboard",
    "section_id": 148468,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158770275",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 156,
    "updated_on": 1532372885,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN Scouting user logs in",
    "custom_steps": "WHEN user is view the left nav",
    "custom_expected": "THEN Users who are only identified as scouts will not see the International dashboard on left nav \r\nAND The trainer/agents tab will display on the Scouting dashboard",
    "custom_steps_separated": null
  },
  {
    "id": 1227919,
    "title": "As a user I want to see the Scouting dashboard if I have the appropriate permissions",
    "section_id": 148468,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158150615",
    "created_by": 103,
    "created_on": 1531165211,
    "updated_by": 136,
    "updated_on": 1532374619,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "GIVEN user with permission to see at least one of the Scouting dashboard tabs logs in\r\n\r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user attempts to access Scouting Dashboard",
    "custom_expected": "THEN only those users with permission to see at least one of the Scouting dashboard tabs should now be able to see the \"Scouting\" left navigation option. (Note that it's possible not all of these users will have the new INTL User LDAP so this should no longer be used)\r\nAND the default landing tab if available should be the Clipboard tab\r\nAND the tabs available to users should appear in alphabetical order in the left navigation\r\nAND only those users with either the Scouting Admin Clipboard or Scout Clipboard permission should see the Clipboard tab under Scouting\r\nAND Only those users with the Domestic Video Log or International Video Log widget permission should see the Video Log tab under Scouting(NOT IMPLEMENTED FOR INTL GO LIVE)\r\nAND only those users with Unregistered Players editors or approvers OR international player report editors or approvers OR daily report editors or approvers should see the Create New tab under Scouting",
    "custom_steps_separated": null
  },
  {
    "id": 1227918,
    "title": "As a user I no longer want to see the \"International Amateur\" dashboard that redirects to amateur",
    "section_id": 148468,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157830142",
    "created_by": 103,
    "created_on": 1531165211,
    "updated_by": 136,
    "updated_on": 1532374633,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "GIVEN a user logged in with permission to view one of the International dashboard tabs\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user login to ebis\r\n",
    "custom_expected": "THEN user should now be able to see the \"International\" left navigation option. (Note that it's possible not all of these users will have the new INTL User LDAP so this should no longer be used). \r\nAND Only those users with the Winter League Request viewers or editors permission should see the WLP - Requests tab under International.\r\nAND Only those users with the Winter League Reserve List widget viewers permission should see the WLP - Reserve List tab under International. \r\nAND Only those users with the Winter League Club Communication widget viewers permission should see the WLP - Club Comms tab under International. \r\nAND The existing \"International\" left navigation is updated so that the \"International Amateur\" tab that links to amateur is no longer visible to any users. \r\nAND Only those users with International Amateur editors permission see the New Player tab.\r\nAND Only those users with the Club Registration List or the Registration Admin permission see the L1 Reg tab.\r\nAND Only those users with the L2 Widget viewers permission see the L2 tab.\r\nAND Only those users with either of the L2 Inquiries widget permissions see the L2 Inquiries tab. \r\nAND Only those users with the External Registration form permission see the External Reg tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1227916,
    "title": "As a user I only want to see the \"new\" International Amateur Quick Search",
    "section_id": 148480,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157830077",
    "created_by": 103,
    "created_on": 1531165211,
    "updated_by": 136,
    "updated_on": 1532372782,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a user logged in with quick search permissions for International Amateur Player\r\nAnd user wants to find an International Amateur Player quickly\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user click on the arrow to select the options from quick search dropdown\r\n",
    "custom_expected": "THEN The existing \"International Amateur Players\" quick search is removed.\r\nAND The \"International Amateur Players2\" quick search is renamed just \"International Amateur\"",
    "custom_steps_separated": null
  },
  {
    "id": 1227917,
    "title": "As a user I only want to see the \"new\" International Amateur Advanced Searches",
    "section_id": 148480,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157830098",
    "created_by": 103,
    "created_on": 1531165211,
    "updated_by": 136,
    "updated_on": 1532372859,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN a user logged in with Advance Search permissions for International Amateur Player\r\nAND user is on the advance search page\r\n\r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user click on the dropdown arrow in advanced search",
    "custom_expected": "THEN The existing \"International Amateur Player\" advanced search is removed completely.\r\nAND The \"International Amateur Player2\" advanced search is renamed just \"International Amateur Player\". \r\nAND The \"International Trainer2\" advanced search is renamed \"International Trainer\". (the other search should only have been in amateur so this should not need to be removed - but if it does need to be then please remove it)\r\nAND The existing \"International Player Report\" advanced search is removed completely. \r\nAND The \"International Player Report2\" advanced search is renamed just \"International Player Report\".",
    "custom_steps_separated": null
  },
  {
    "id": 1227678,
    "title": "As a Club user I only want to see players that I have permission to see in Advanced Search (updated)",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954318",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373714,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN Club user logs in with International Amateur players permission\r\n\r\n",
    "custom_steps": "WHEN user runs an advanced search for International Amateur players as a Club\r\n",
    "custom_expected": "THEN system should follow the new visibility rules. \r\n - Unregistered profiles are NEVER returned as a result for Club users, regardless of status or if they are an International Prospect or International Suspect.  \r\n - Players identified as Group 1 or Group 2 players are not automatically visible anymore. \r\nAND The remainder of the visibility restrictions remain in place and should continue to work. \r\nAND The \"Scouting Status\" filter should also be removed from Advanced Search for Club users.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility",
    "custom_steps_separated": null
  },
  {
    "id": 1227679,
    "title": "As a Club user I only want to see players that I have permission to see in Quick Search (updated)",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954327",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373714,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN Club user logs in with International Amateur players permission",
    "custom_steps": "\r\nWHEN user runs a quick search for International Amateur players as a Club \r\n\r\n",
    "custom_expected": "THEN system should follow the new visibility rules.  \r\n - Unregistered profiles are NEVER returned as a result for Club users, regardless of status or if they are an International Prospect or International Suspect.  \r\n - Players identified as Group 1 or Group 2 players are not automatically visible anymore. \r\nAND The remainder of the visibility restrictions remain in place and should continue to work.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility",
    "custom_steps_separated": null
  },
  {
    "id": 1227681,
    "title": "As a BOC User I only want to see players that I have permission to see in Advanced Search",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955518",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373714,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user logs in with permission to view/edit/approve International player profiles in Advanced Search",
    "custom_steps": "WHEN user is using Advanced search to find an International Amateur profile\r\n",
    "custom_expected": "THEN Users without permissions to view, edit or approve international player profiles should receive a permission error if they attempt to navigate to these directly via URL.\r\nAND Users without permissions to view, edit or approve international player profiles should not be able to search for these items. \r\nAND All users that have permission to view/edit/approve these profiles should see these in advanced search IF the record status is Approved. \r\nAND Users that are NOT identified as Scouts that have permission to view/edit/approve these profiles should see these returned in Advanced Search if they have a status other than Approved ONLY IF the user specifically applies the status filter. If they do apply the status filter, then they should be able to see any profile in the system.\r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see these returned in Advanced search if they have a status of Submitted, regarldess of who created the profile.\r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see these returned in Advanced search if they have a status other than Approved or Submitted ONLY IF the creating user of the profile matches the current user. \r\nAND They do not need to apply additional filters to see non-approved statuses. \r\nAND Even if they DO apply additional status filters, they cannot see non-approved profiles entered by other users.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility",
    "custom_steps_separated": null
  },
  {
    "id": 1227682,
    "title": "As a BOC User I only want to see players that I have permission to see in Quick Search",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955516",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532373714,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user logs in with permissions to view/edit/approve International player profiles in Quick Search",
    "custom_steps": "WHEN user is using quick search to find an International Amateur profile",
    "custom_expected": "THEN Users without permissions to view, edit or approve international player profiles should receive a permission error if they attempt to navigate to these directly via URL.\r\nAND Users without permissions to view, edit or approve international player profiles should not be able to search for these items. \r\nAND All users that have permission to view/edit/approve these profiles should see these in advanced search IF the record status is Approved. \r\nAND Users that are NOT identified as Scouts that have permission to view/edit/approve these profiles should only see Approved records in quick search OR non-approved records created by the viewing user.\r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see all Submitted and Approved profiles returned, regardless of who created the profile.\r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see Preliminary and Rejected profiles returned ONLY IF the creating user of the profile matches the current user. \r\nAND All of these quick search rules should also apply to the \"Create New\" menu for International Player reports\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility",
    "custom_steps_separated": null
  },
  {
    "id": 1227920,
    "title": "As a developer, I want to remove all instance of EBIS-INTL-USER-NEW from the code base",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158922595",
    "created_by": 103,
    "created_on": 1531165211,
    "updated_by": 103,
    "updated_on": 1532373984,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 5,
    "custom_preconds": "GIVEN the LDAP EBIS-INTL-USER-NEW has been removed as a reference from all EBIS code (UI and Services tier)",
    "custom_steps": "WHEN user logs in with an account that does NOT have EBIS-INTL-USER-NEW LDAP",
    "custom_expected": "THEN user should be able to do anything with international profiles, reports etc that they have permission to do\r\nExample:\r\nuser without EBIS-INTL-USER-NEW but with EBIS-INTL-PLAYER-VIEWERS should still be able to view intl profiles",
    "custom_steps_separated": null
  },
  {
    "id": 1227659,
    "title": "As a user I only want to be able to see Club - selected L2 information if I have permission to do so",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157953950",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374096,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 6,
    "custom_preconds": "GIVEN a Scouting user logs in \r\n\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user is viewing a player profile for player that was selected for L2 Registration by a Club",
    "custom_expected": "THEN the L2 Date should NOT populate on the player profile\r\nAND This should continue to display \"No\" for these users.",
    "custom_steps_separated": null
  },
  {
    "id": 1227674,
    "title": "As a user I only want to see Trainer/agent profiles that I have permission to see",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157616756",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374134,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 7,
    "custom_preconds": "GIVEN user with and without permission to view Trainer/agent profiles logs in\r\n\r\n",
    "custom_steps": "WHEN user tries to view Trainer/agent profiles",
    "custom_expected": "THEN Users without permissions to view, edit or approve trainer/agent profiles should receive a permission error if they attempt to navigate to these directly via URL.\r\nAND Users without permissions to view, edit or approve trainer/agent profiles should not be able to search for these items. \r\nAND Trainer/Agent profiles should ONLY appear in the Trainer/Agent widget if they are Approved. \r\nAND All users that have permission to view/edit/approve these profiles should see these in advanced search IF the record status is Approved. \r\nAND Users that are NOT identified as Scouts that have permission to view/edit/approve these profiles should see these returned in Advanced Search if they have a status other than Approved ONLY IF the user specifically applies the status filter. If they do apply the status filter, then they should be able to see any profile in the system. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see these returned in Advanced search if they have a status other than Approved ONLY IF the creating user of the report matches the current user. \r\n  - They do not need to apply additional filters to see non-approved statuses. \r\n  - Even if they DO apply additional status filters, they cannot see non-approved profiles entered by other users. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these profiles should see non-approved profiles as an option in any trainer/agent field if they have a status other than Approved ONLY IF the creating user of the trainer/agent matches the current user. \r\nAND Users that are not identified as Scouts should not see non-approved profiles as an option in any trainer/agent field in the system. \r\nAND Users that are not identified as Scouts SHOULD see non-approved profiles as a value if viewing an item created by a Scout. (Ex: If an admin opens a Player Report and it includes submitted profiles, those should continue to display as values - but they would not be able to add them to the report).",
    "custom_steps_separated": null
  },
  {
    "id": 1227676,
    "title": "As a user I only want to see those International Player Reports that I have permission to see",
    "section_id": 148747,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157955403",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374414,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 8,
    "custom_preconds": "GIVEN the user with and without International Player Reports permission logs in\r\n\r\n\r\n",
    "custom_steps": "WHEN user is tries to view or edit International Player Reports\r\n\r\n",
    "custom_expected": "THEN Users without permissions to view, edit or approve international player reports do not see these in the Scouting History at all. \r\nAND Users without permissions to view, edit or approve international player reports should receive a permission error if they attempt to navigate to these directly via URL.\r\nAND Users without permissions to view, edit or approve international player reports should not be able to search for these items. \r\nAND All users that have permission to view/edit/approve these reports should see these reports in the Scouting History of players and advanced search IF the record status is Approved. \r\nAND Users that are NOT identified as Scouts that have permission to view/edit/approve these reports should see these reports returned in Advanced Search if they have a status other than Approved ONLY IF the user specifically applies the status filter. If they do apply the status filter, then they should be able to see any report in the system. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these reports should see these reports returned in Advanced if they have a status other than Approved ONLY IF the creating user of the report matches the current user. \r\n  - They do not need to apply additional filters to see non-approved statuses. \r\n  - Even if they DO apply additional status filters, they cannot see non-approved reports entered by other users. \r\nAND Users that ARE identified as Scouts that have permission to view/edit these reports should see these reports in a player's Scouting History if they have a status other than Approved ONLY IF the creating user of the report matches the current user.\r\n\r\nBusiness Rules:\r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347726",
    "custom_steps_separated": null
  },
  {
    "id": 1227677,
    "title": "As a Club user I want to see a warning if I am attempting to enter a new player profile that matches another profile (updated)",
    "section_id": 148748,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954307",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374018,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 1,
    "custom_preconds": "GIVEN a Club user logs in with permission to creating a new International Amateur profile \r\n\r\n",
    "custom_steps": "WHEN user Clicks \"Next\" on the Create New when creating a new International Amateur profile\r\n\r\n",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND If a match is found to another international player profile that the user has permission to see as a match, then the user gets a warning. See Messages #4 or #5.\r\nAND MLSB Group 1 or Group 2 profiles are no longer automatically public. \r\nAND International Suspects should NOT appear as matches to Club users.\r\nAND Unregistered International Prospects should ONLY appear as a match to Club users if they have a record status of Approved.\r\nAND The remainder of the visibility restrictions should continue to work.\r\nAND Register MLSB Entered and Add to Club Reg list functionality should continue to work as previously laid out.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1227680,
    "title": "As a BOC user I want to see a warning if I am attempting to enter a new player profile that matches another profile (updated)",
    "section_id": 148748,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954312",
    "created_by": 103,
    "created_on": 1529352916,
    "updated_by": 136,
    "updated_on": 1532374018,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20481,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user logs in with permission to create new International Amateur profile ",
    "custom_steps": "WHEN user clicks \"Next\" on the Create New when creating a new International Amateur profile",
    "custom_expected": "THEN the system will run a duplicate check according to the provided rules (NOT via the Scouting dashboard). \r\nAND If a match is found to another international player profile, including to an International Suspect profile, then the user gets a warning. See Messages #4 or #5.\r\nAND International Suspects SHOULD appear as matches to BOC users. They should have the option to Register MLSB entered for these profiles, just like any other Unregistered profile. \r\nAND Unregistered International Prospects should ONLY appear as a match to BOC users if they have a record status of Approved UNLESS the BOC user also has the ability to create unregistered profiles. If they have that permission, then they also see matches to Submitted profiles.\r\nAND Register MLSB Entered and Add to Club Reg list functionality should continue to work as previously laid out.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  }
]