[
  {
    "id": 1177558,
    "title": "Unpin frozen columns on screen sizes below 768",
    "section_id": 145899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144299405",
    "created_by": 136,
    "created_on": 1505154969,
    "updated_by": 156,
    "updated_on": 1512665205,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN the user is on Devices with screen sizes below 768",
    "custom_steps": "WHEN user is on Widgets with frozen columns (ex. Roster Widget)\r\n\r\n\r\n",
    "custom_expected": "THEN no columns should be frozen.\r\nAND frozen column would be unpinned so user can horizontally scroll the entire table\r\nAND the drop shadow associated with a frozen column should not appear.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1177559,
    "title": "As a user I do not want to see the mobile button container if no buttons exist",
    "section_id": 145899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145949207",
    "created_by": 136,
    "created_on": 1505154969,
    "updated_by": 156,
    "updated_on": 1512665205,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in and viewing EBIS on a mobile device\r\n",
    "custom_steps": "WHEN user navigates to a form with no buttons available",
    "custom_expected": "THEN no Mobile Button Container should display ",
    "custom_steps_separated": null
  },
  {
    "id": 1213929,
    "title": "As a user I no longer want to see Employee transactions returned when I run a Player Transaction advanced search",
    "section_id": 145899,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153203431",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512674010,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC or CLUB user logs in with Employee Permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user is Running an advanced search for \"Transactions\"\r\n",
    "custom_expected": "THEN system will no longer display employee transactions under \"Transaction Type\" filter (Assign/Reassign, Remove from Org, Assign/ Remove as 7th Coach).\r\nAND system will not return any results for employee transactions.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212501,
    "title": "As a user I want to see an Employee Contract reflected in the employee's History",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151311177",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC permission\r\nAND An employee has an approved UEC \r\n\r\n",
    "custom_steps": "WHEN user navigates to Employee's History",
    "custom_expected": "THEN system should display the following information about the UEC: \r\n  * Date on the History corresponds with the Signing Date.\r\n  * Code is \"EE Cont\"\r\n  * Org/Club From is the Signing Org. \r\n  * Org/Club To is blank.\r\n  * Description reads: \"Signed Negotiated Employee Contract – Position: <Position> Years: X Option Years: Z 1st Year: YYYY\" where <Position> is replaced with the Position from the contract (ex: Coach), X is the guaranteed years and Z is option years. YYYY is replaced with the first year of the contract.\r\nAND Clicking on the description opens the contract.",
    "custom_steps_separated": null
  },
  {
    "id": 1211735,
    "title": "As a user I want to be able to search for Employee Contracts",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151311117",
    "created_by": 103,
    "created_on": 1509125873,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a club or BOC user logged in with Employee Contract permissions\r\nAND the user has navigated to Advances Search",
    "custom_steps": "WHEN the users selects Employee Contracts for \"Search For\" field",
    "custom_expected": "THEN The filters available when \"Employee Contracts\" has been selected will match the provided specs. \r\nAND Clicking search will search the database for any Employee Contracts that meet the applied filters.\r\nAND After results are found, the results will display according to the requirements.\r\nAND Users will be able to export these results to excel.\r\nAND Users will be able to export these results to pdf. \r\nAND Users will be able to use the type to filter option\r\nBUT If no results are found the table displays with \"No records found\"",
    "custom_steps_separated": null
  },
  {
    "id": 1211752,
    "title": "As a user I want to save an employee contract with Club standard language in a clause",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151310963",
    "created_by": 103,
    "created_on": 1509125873,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN a club or BOC user is logged in with permissions to create Employee Contract\r\nAND user is creating Employee Contract\r\nAND user has selected a clause \r\nAND user has stored a language for the selected clause\r\n",
    "custom_steps": "WHEN user clicks the Language dropdown",
    "custom_expected": "THEN If stored Club language is available for the selected clause, then it is displayed in the Language dropdown.\r\nAND The user can select the stored language for use in the clause.\r\nAND Selecting a stored language for use does not prompt the language to appear on the contract itself (on the front-end).\r\nAND Clicking \"Save\" or updating the contract state should save the selected language so that when the contract is re-opened the language is still selected.",
    "custom_steps_separated": null
  },
  {
    "id": 1211753,
    "title": "As a user I want to save an employee contract with BOC standard language in a clause",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151310959",
    "created_by": 103,
    "created_on": 1509125873,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN a club or BOC user is logged in with permissions to create Employee Contract\r\nAND user is creating Employee Contract\r\nAND user has selected a clause \r\nAND user has stored a language for the selected clause",
    "custom_steps": "WHEN user clicks the Language dropdown",
    "custom_expected": "THEN If stored BOC/LRD language is available for the selected clause, then it is displayed in the Language dropdown. \r\nAND The user can select the stored language for use in the clause.\r\nAND Selecting a stored language for use does not prompt the language to appear on the contract itself (front-end).  \r\nAND Clicking \"Save\" or updating the contract state should save the selected language so that when the contract is re-opened the language is still selected.\r\n\r\nSee Wireframe:\r\nhttp://30ac5x.axshare.com/#p=major_league_compensation",
    "custom_steps_separated": null
  },
  {
    "id": 1211755,
    "title": "As a user I want to enter and save Complex language on a bonus clause",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151310975",
    "created_by": 103,
    "created_on": 1509125873,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN a club or BOC user is logged in with permissions to create Employee Contract\r\nAND user is creating Employee Contract\r\nAND user has selected a Bonus clause \r\nAND user wants to enter complex language in a Bonus clause",
    "custom_steps": "When the user selects \"Complex\" as the criteria for a bonus clause, salary escalator or conditional option",
    "custom_expected": "Business Value:\r\nAllows clubs and LRD to create their own criteria for awarding an incentive bonus, salary escalator or Option. \r\n\r\nTHEN a WISYWIG editor will appear in the contract form.\r\nAND Users will be able to use the WISYWIG editor to construct custom criteria for the bonus using basic formatting such as italics, bolding, underlining and bullet points.\r\nAND Any formatting that will not be supported in printing should not be an option in the WISYWIG editor.\r\nAND Users have requested that the WISYWIG editor used be compatible with copy/paste from MS Word.\r\nAND WISYWIG editor needs to be able to accommodate Spanish language and special characters.\r\nAND Maintain the text entered if \"Complex\" is selected, even if the user switches to another Criteria as long as they have NOT the contract between switching. \r\nAND Clicking \"Save\" or updating the contract state should save the entered language so that when the contract is re-opened \"Complex\" is still selected and the WISYWIG is populated with the entered text.",
    "custom_steps_separated": null
  },
  {
    "id": 1211764,
    "title": "As a user I want to be able to delete an employee contract",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151311146",
    "created_by": 103,
    "created_on": 1509125873,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "GIVEN a club or BOC logged in with permissions to delete an employee contract\r\nAND a user is in edit or view mode for preliminary or reject signed employee contracts ",
    "custom_steps": "WHEN user clicks on delete button",
    "custom_expected": "THEN Clicking delete should prompt the user to confirm the deletion.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with Employee Contract)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, the contract should be removed from the system and no longer displayed on the player's Contract History or appear in search results. \r\nOR If they do not confirm the deletion, no action should be taken and they should be returned to the form. \r\nAND The user should be returned to the player's Contract History.",
    "custom_steps_separated": null
  },
  {
    "id": 1212464,
    "title": "As a user I want to be able to print the Info section of an Employee Contract",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085138",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 7,
    "custom_preconds": "GIVEN a club or BOC user is logged in with permissions to print employee contract\r\nAND an employee has an exiting employee contract\r\nAND user has navigated to a contract in View mode or Edit Mode \r\n",
    "custom_steps": "WHEN user click \"Print\" button",
    "custom_expected": "THEN the system will download a pdf of the printed Infor section UEC.\r\nAND Information from the \"Info\" section of the contract screen is accurately reflected in the printed contract. \r\nAND The boilerplate contract should also be included in this story. \r\nAND The player's address prints as it is laid out in the Printing Rules above. \r\nAND Presentation and all language used should match ebis1.",
    "custom_steps_separated": null
  },
  {
    "id": 1212480,
    "title": "As a user I want to be able to add a Threshold Table to an Incentive Bonus clause in a UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152705375",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 8,
    "custom_preconds": "GIVEN a club or BOC user is logged in with permissions to create Employee Contract\r\nAND user is creating Employee Contract\r\nAND user has created an Incentive Bonus clause \r\nAND user is in the incentive bonuses section of an employee contract",
    "custom_steps": "WHEN user click \"Threshold Table\" button available for each Incentive bonus clause.",
    "custom_expected": "THEN system will add the table per the data discovery.\r\nAND Threshold field in the clause will update to say \"TABLE\"\r\nAND The user can Add multiple terms to the table using the \"Add Term\" button that is only available in edit mode.\r\nAND The user can delete all but one of the terms using trash cans associated with each added term. \r\nAND The user can add a Pay Schedule for each term in the table. \r\nAND The user can delete the table by clicking on the \"Delete Table\" button that is only available in edit mode. \r\nAND The \"Total Potential\" at the base of the threshold table will update on \"Save\" of the contract and is straight addition of the entered amounts.",
    "custom_steps_separated": null
  },
  {
    "id": 1212481,
    "title": "As a user I want to be able to add a Pay Schedule to a UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151231095",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 9,
    "custom_preconds": "GIVEN a club and BOC is logged in with the permission to create employee contract\r\nAND the user is creating employee contract\r\nAND the user wants to add a Payment schedule to the contract they are creating",
    "custom_steps": "WHEN user clicks on the Pay SCH button",
    "custom_expected": "THEN the system will launch a pop up where the user can view/edit the Pay Schedule\r\nAND If the contract is in edit mode, then the Pay Schedule is in edit mode.\r\nAND If the contract is in view mode, then the Pay Schedule is in view mode. \r\nAND In edit mode If no payments exist yet, the payment schedule should show a blank row by default (in edit mode only). \r\nAND If payments do exist, those should display. \r\nAND The user should see the buttons OK and Cancel. \r\nAND Clicking OK does NOT save these changes permanently. These changes are only stored in the database when the entire contract is Saved. \r\nAND Clicking Cancel will discard any changes made to the Payment Schedule, and no rules will fire. The payment schedule will close and no changes will be stored.",
    "custom_steps_separated": null
  },
  {
    "id": 1212482,
    "title": "As a user I want to be able to move a UEC to Submit Signed",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152054658",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 10,
    "custom_preconds": "GIVEN a club or BOC user is logged in with UEC edit permissions\r\nAND user is viewing a UEC in edit or view mode in Preliminary status",
    "custom_steps": "WHEN user clicks \"Update Status\" button",
    "custom_expected": "THEN system will display the option to move the contract to \"Submit Signed\".\r\nAND Selecting \"Submit Signed\" will perform a required field and formatting check, and if that passes then save the contract as it is currently entered.\r\nAND The contract is assigned a status of \"Submit Signed\". \r\nAND The contract in the player's Contract History should appear in green. \r\nAND The contract should reload in View mode if it was previously in edit mode. \r\nAND A blue notification will display that states that the contract's status has been updated to Submit Signed.",
    "custom_steps_separated": null
  },
  {
    "id": 1212513,
    "title": "As a user I want to see an error if attempting to submit a UEC with no \"Contract\" attachment",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152704806",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 11,
    "custom_preconds": "GIVEN the Club/BOC users initiates a UEC\r\n\r\n",
    "custom_steps": "WHEN the user attempts to move a UEC to a \"Submit Signed\" with no  \"Contract\" attachment",
    "custom_expected": "THEN the system will check to see if there is an attached file with a label of \"Contract\". \r\nAND If not, display error message #9.\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/5.+Submit+Signed+-+State+Change+Rules\r\n\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212511,
    "title": "As a user I want an employee's Superceded contract to be moved back to Approved if the new contract is moved to Reject Signed",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152703706",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 12,
    "custom_preconds": "GIVEN the user has an existing Superceded contract\r\n\r\n",
    "custom_steps": "WHEN current contract is move to Reject Signed status",
    "custom_expected": "THEN Superceded contract to be moved back to re-enacted as the 'active' \r\n\r\nReject Signed Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Reject+Signed+-+State+Change+Rules\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212508,
    "title": "As a user I want any attachment with a label of Contract to be stamped on approval",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152740714",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 13,
    "custom_preconds": "GIVEN the user created a Employee contract \r\nAnd Attached valid contract PDF\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN the Contract is moved from Update Status - > Approved",
    "custom_expected": "THEN system will prompt the user to pick where to place the signature stamp. \r\nAND \"Default\" will be the default selection on the pop up. \r\nAND \"Custom\" will be the other option. Selecting \"Custom\" will display fields for the user to specify the page (counted back from the last page) and the x/y coordinates for the signature stamp. The fields will default to the default location as calculated by the system based on the current version of the saved contract. \r\nAND \"None\" will be another option. Selecting \"None\" will not stamp the contract at all when \"Approve\" is clicked. \r\nAND The buttons on the pop up will be \"Approve\" and \"Cancel\". \r\nAND Clicking \"Cancel\" will close the popup and cancel the state change. \r\nAND If \"Custom\" is selected, the \"Approve\" button will be disabled if any of the fields are left blank. Otherwise, clicking Approve will stamp the attached pdf with the signature stamp in the indicated location. \r\nAND If \"Default\" is selected, the \"Approve\" button is always enabled and the system will stamp the attached pdf on Approve in the default location. \r\nAND The date used is the date the UEC was Approved.\r\n\r\n*Note that this matches the process used for MJ Contracts*",
    "custom_steps_separated": null
  },
  {
    "id": 1212490,
    "title": "As a user I want to be able to resubmit a UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152456678",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666257,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 15,
    "custom_preconds": "View-Edit-State Change Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/2.+UEC+-+View-Edit-State+Change+Rules\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Data+Discovery (must click into lower level documents)\r\nReject Signed Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/6.+Reject+Signed+-+State+Change+Rules\r\nGIVEN a user is logged in as a Club or BOC user with Edit permissions for a UEC\r\n",
    "custom_steps": "WHEN user opens a UEC in Edit or View Mode in Preliminary",
    "custom_expected": "THEN there should be an Update Status button\r\nAND clicking the \"Update Status\" button should display the option to move the contract to \"Submit Signed\"\r\nAND selecting \"Submit Signed\" should perform a required field and formatting check, and if that passes then save the contract as it is currently entered\r\nAND the contract should be assigned a status of \"Submit Signed\"\r\nAND the contract in the player's Contract History should appear in green\r\nAND the contract should reload in View mode if it was previously in edit mode\r\nAND a blue notification should display that states that the contract's status has been updated to Submit Signed\r\nAND any \"Rejection Reason\" comments that were previously visible on the UEC should be removed\r\nAND an Approvals item should be generated for the BOC\r\nAND the Action Item for the UEC should be removed.\r\nAND if the employee's current position does not match that contained in the UEC, then an Assign/Reassign Transaction should be auto-created and submitted by the system for the position contained on the UEC",
    "custom_steps_separated": null
  },
  {
    "id": 1213931,
    "title": "As a user I want to enter bonus/salary escalator information on an approved UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394093",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512671785,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 16,
    "custom_preconds": "GIVEN the Club or BOC users have UEC permission\r\nAND An Approved UEC already exists for an Employee \r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user opens the UEC in Edit mode",
    "custom_expected": "THEN the user should be able to enter in the earned information for Incentive Bonuses and have that saved, according to the data discovery. \r\nAND the user should be able to enter in the earned information for Salary Escalators and have that saved, according to the data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1213930,
    "title": "As a user I want to see an error if I attempt to submit a UEC with \"Single\" selected as frequency with different payment start and end dates",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152949945",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512671838,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 17,
    "custom_preconds": "GIVEN BOC or Club users have UEC permission\r\nAND user created an UEC with Compensation or Options clauses where the payment frequency is set to \"Single\"\r\nAND the Payment Start and Payment End Dates are entered\r\n\r\n",
    "custom_steps": "WHEN user attempt to submit the UEC\r\n\r\n",
    "custom_expected": "THEN If a Single payment frequency exists with payment start and end dates that are not equal, display error #24.\r\nAND the offending date should be highlighted in red or otherwise indicated to the user\r\nBUT if a Single payment frequency exists with payment start and end dates that are equal, error #24 will not be displayed\r\n\r\n\r\nOn Submit Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+UEC+-+On+Submit+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213927,
    "title": "As a user I want to see new Criteria options for new UECs",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153202098",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512672805,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 18,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission\r\nAND a new UEC is initiated for an employee with Incentive Bonuses\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on Criteria Drop down under Incentive Bonuses\r\n\r\n",
    "custom_expected": "THEN users should be able to see updated the list of Criteria (See Data Discovery).\r\nAND the subsections would be present in the dropdown  (if that is not possible, just an ordered list is also fine.) \r\nAND Historical contracts should continue to use the prior list.\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Incentive+Bonuses",
    "custom_steps_separated": null
  },
  {
    "id": 1213938,
    "title": "As a user I want to see an error if I attempt to create a new UEC for a player that is currently on the Restricted List",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950027",
    "created_by": 103,
    "created_on": 1512673394,
    "updated_by": 103,
    "updated_on": 1512673954,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 20,
    "custom_preconds": "On Create Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/1.+UEC+-+On+Create+Rules\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\nGIVEN a user is logged in with applicable UEC edit permissions\r\nAND user is attempting to create a new UEC for a player\r\nAND selected player has an MJ or MN Roster status of \"Restricted\"",
    "custom_steps": "WHEN user selects \"Employee Contract\" from the Create New menu",
    "custom_expected": "THEN system will check to see if the player has a MJ or MN Roster status of \"Restricted\".  \r\nAND if no, system should proceed with contract creation\r\nBUT if yes, system should display error #21 \"An employee contract may not be created for a player currently on the Restricted List.\"\r\nAND clicking \"Back\" should return user to the point of entry \r\nAND clicking \"Ignore and Continue\" (BOC Only) should proceed with contract submission",
    "custom_steps_separated": null
  },
  {
    "id": 1213901,
    "title": "As a user I want to enter option decisions on an approved UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394097",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512679768,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 21,
    "custom_preconds": "GIVEN BOC and CLUB user has UEC permission \r\n\r\n",
    "custom_steps": "WHEN editing an approved UEC",
    "custom_expected": "THEN  the user should be able to enter in the option decision information and have that saved, according to the data discovery. \r\nAND Should include the ability to edit the option types that we no longer have.",
    "custom_steps_separated": null
  },
  {
    "id": 1213905,
    "title": "As a user I want to see an error if I attempt submit a UEC with option years that are missing Options clauses",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152949930",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512679791,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 22,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission \r\nAND user initiates a new UEC with option year(s)\r\n",
    "custom_steps": "WHEN user moves the UEC to Submitted state with missing Options clauses",
    "custom_expected": "THEN the system will check that at least one Options clause exists for each Options year contained in the contract. \r\nAND If one or more option years does not have a corresponding clause, display error #12.\r\n\r\nOn Submit Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+UEC+-+On+Submit+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213904,
    "title": "As a user I want to see an error if I attempt to submit a UEC with a start date that is after an end date",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152949958",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512679803,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 23,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission \r\nAND user initiates a new UEC with a start date that is after an end date(for Compensation or Option Clauses)\r\n\r\n",
    "custom_steps": "WHEN user moves the UEC to submitted state",
    "custom_expected": "THEN the system will check that all entered Start Dates are on or before their corresponding End Dates (these are found in Compensation as well as in Option clauses). \r\nAND If a start date exists that is after its corresponding end date, display error #25.\r\nAND If possible, the offending date should be highlighted in red or otherwise indicated to the user.\r\n\r\nOn Submit Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+UEC+-+On+Submit+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213903,
    "title": "As a user I want to see an error if I attempt submit a UEC with complex criteria selected that has more than one term",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950061",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512679814,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 24,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission\r\nAND user initiates a new UEC with Incentive bonus clause that has 'Complex' criteria set\r\nAND more than one term\r\n\r\n",
    "custom_steps": "WHEN UEC is moved Submitted state\r\n",
    "custom_expected": "THEN the system will check that any Incentive Bonus clause included in the UEC does not have the Criteria set to \"Complex\" and more than one term. \r\nAND If a clause exists with both Complex criteria and more than one term, display error #27.\r\n\r\nOn Submit Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+UEC+-+On+Submit+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213900,
    "title": "As a user I want to see an error if I attempt submit a UEC for an employee that currently belongs to another Org",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152949970",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512680094,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 26,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission \r\nAND user initiates a new UEC for an employee that currently belongs to another Org\r\n\r\n",
    "custom_steps": "When UEC's On Submit rules are run",
    "custom_expected": "THEN the system will check to see if the person is currently classified as an employee.\r\nAND If yes, and the employee has a current Org, the system will verify that the Employee belongs to the same Org as the Signing Org. \r\nBUT If the employee does NOT belong to the same Org as the Signing Org, then display error #2.\r\n\r\nOn Submit Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+UEC+-+On+Submit+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213892,
    "title": "As a user I want to be able to edit an existing UEC",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152357688",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512680523,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 27,
    "custom_preconds": "View-Edit-State Change Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/2.+UEC+-+View-Edit-State+Change+Rules\r\nOn Save Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/10.++On+Save\r\n**All of these steps assume proper edit permissions and that Club users belong to the Signing Org**\r\nGIVEN a user is logged in with edit permissions for UEC",
    "custom_steps": "WHEN user attempts to edit an existing UEC",
    "custom_expected": "THEN Club users should be able to edit any portion of the UEC in Preliminary and Reject Signed states\r\nAND Club users should only be able to edit the Authorized Signatory, Signing Date, and Attached Files in a Completed State\r\nAND Club users should not see an edit button in the Submit Signed or Approved or higher states\r\nAND BOC users should be able to edit any fields in all of the states\r\nAND saving in any state other than Preliminary and Reject Signed should run all required field and formatting checks\r\nAND saving the contract in any Approved or higher state should run all required field and formatting checks, as well as all On Submit and On Approve rules\r\nAND saving the contract in any Approved or higher state should check that there is not a new \"Contract\" attachment\r\nAND if there is a new \"Contract\" attachmen, the user should be given the option to stamp the attached contract\r\nAND the stamp should have the date of the Approval - not the current date",
    "custom_steps_separated": null
  },
  {
    "id": 1213894,
    "title": "As a user I want to see an error if I attempt to create a new UEC for an employee that already has a preliminary one",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152949471",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512681089,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 29,
    "custom_preconds": "GIVEN BOC or CLUB users have UEC permission\r\nAND an employee already has a preliminary UEC\r\n\r\n",
    "custom_steps": "WHEN the user selects \"Employee Contract\" from the Create New menu for that employee",
    "custom_expected": "THEN the system will check to see if the employee already has a preliminary UEC. \r\nAND If a preliminary already exists that the user has permission to see, then load that contract and throw a blue notification indicating that a preliminary UEC has been found and loaded.\r\nAND If a preliminary already exists that the user does not have permission to see because it is for another Org, display error #1.\r\nBUT If a preliminary already exists that the user does not have permission to see because it is for a position they do not have permission to open, display error #22. \r\nAND Either error #1 or error #22 should display - never both.\r\n\r\nOn Create Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/1.+UEC+-+On+Create+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213895,
    "title": "As a user I want to see an error if I attempt to create a new UEC for a player that does not belong to my Org",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950009",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512681101,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 30,
    "custom_preconds": "GIVEN BOC or CLUB users have UEC permission\r\n\r\n",
    "custom_steps": "When the user selects \"Employee Contract\" from the Create New menu for an employee \r\n\r\n",
    "custom_expected": "THEN the system will check to see if the person is current classified as a player.\r\nAND If yes, the system will verify that the Player belongs to the same Org that the Club user belongs to. \r\nAND If the player is not a Free Agent or Released and does NOT belong to the same Org as the user AND the player's MJ or MN Roster status is NOT Voluntarily Retired, then display  error #18.\r\nBUT If the player's roster status is Free Agent, Released or Voluntarily Retired, any Org should be able to create a UEC for them.\r\n\r\nOn Create Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/1.+UEC+-+On+Create+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213896,
    "title": "As a user I no longer want to be able to add Salary Escalators to new UECs",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153202089",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512681109,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 31,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission\r\n\r\n",
    "custom_steps": "WHEN user is creating a UEC\r\n",
    "custom_expected": "THEN Salary Escalators will not be an option for UECs\r\nBUT Historical contracts with salary escalators should continue to display these via the UI, but it should no longer be an option on new UECs.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213897,
    "title": "As a user I want to see an error if I attempt to create a new UEC for an employee that does not belong to my Org",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950000",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512681120,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 32,
    "custom_preconds": "GIVEN BOC and CLUB users have UEC permission \r\n\r\n",
    "custom_steps": "WHEN the user selects \"Employee Contract\" from the Create New menu for an employee that does not belong to my Org\r\n",
    "custom_expected": "THEN  the system will check to see if the person is currently classified as an employee.\r\nAND If yes, and the employee has a current Org, the system will verify that the Employee belongs to the same Org that the Club user belongs to. \r\nAND  If the employee does NOT belong to the same Org as the user, then display  error #2.\r\nBUT If the employee is currently unaffiliated, any Org may create a UEC for them.\r\n\r\nOn Create Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/1.+UEC+-+On+Create+Rules\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/UEC+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213898,
    "title": "As a user I no longer want to be able to add Employee, Vesting or Conditional Options to new UECs",
    "section_id": 145908,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153202099",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512681159,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 33,
    "custom_preconds": "GIVEN a club or BOC users have UEC permission",
    "custom_steps": "When user is creating a UEC",
    "custom_expected": "THEN Vesting or Conditional Options will not be an option for UECs\r\nAND Historical contracts with Vesting, Conditional or Employee Options should continue to display these via the UI, but it should no longer be an option on new UECs.",
    "custom_steps_separated": null
  },
  {
    "id": 1177592,
    "title": "Employee Bridging (NEEDS AC)",
    "section_id": 145909,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150823903",
    "created_by": 103,
    "created_on": 1505155008,
    "updated_by": 156,
    "updated_on": 1512666371,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1213925,
    "title": "As a user I no longer want to see employees with old positions",
    "section_id": 145909,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152948571",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512674654,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "Positions: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+-+Positions\r\nGIVEN a club or BOC user is logged in with view permissions for Employee Profiles, Transactions, and Contracts\r\n\r\n",
    "custom_steps": "WHEN user views an Employee Profile or Employee Rosters widget\r\n",
    "custom_expected": "THEN ALL employees should now have a \"new\" position and no positions that have been removed should be used\r\nAND the mapping spreadsheet attached to the story, and in the Positions document, should be used to conduct this mapping\r\nAND he employees' assign/reassign transaction and relevant UECs should continue to show the old position information",
    "custom_steps_separated": null
  },
  {
    "id": 1195819,
    "title": "Employee Contracts - Viewer Permissions- BOC",
    "section_id": 145911,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151310554",
    "created_by": 103,
    "created_on": 1506973388,
    "updated_by": 156,
    "updated_on": 1512666684,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Contracts Viewer Permissions",
    "custom_steps": "WHEN BOC user attempts to do anything with an Employee Contract",
    "custom_expected": "THEN BOC user should be able to view and Print all employee contracts in all states \r\nAND user should be able to view all flags for employee contracts and their attachments in all states\r\nBUT user should not be able to make any changes or e-sign\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212495,
    "title": "As a user I want to be able to print the Signing Bonus section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085131",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Signing Bonus section completed and Saved\r\n\r\n",
    "custom_steps": "WHEN user Clicks Print on UEC\r\n\r\n",
    "custom_expected": "THEN Information from the \"Signing Bonus\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212494,
    "title": "As a user I want to be able to print the Compensation section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085135",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Compensation section completed and Saved\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on Print on UEC\r\n",
    "custom_expected": "THEN the Information from the \"Compensation\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212496,
    "title": "As a user I want to be able to print the Options section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085134",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Options section completed and Saved",
    "custom_steps": "WHEN user clicks on Print on UEC\r\n",
    "custom_expected": "THEN Information from the \"Options\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212497,
    "title": "As a user I want to be able to print the Incentive Bonuses section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085130",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Incentive Bonuses section completed and Saved\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on Print on UEC\r\n\r\n\r\n",
    "custom_expected": "THEN Information from the \"Incentive Bonuses\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212498,
    "title": "As a user I want to be able to print the Salary Escalators section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085120",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Salary Escalators section completed and Saved\r\n\r\n",
    "custom_steps": "WHEN user clicks on Print on UEC\r\n\r\n\r\n",
    "custom_expected": "THEN Information from the \"Salary Escalators\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212499,
    "title": "As a user I want to be able to print the Covenants section of an Employee Contract",
    "section_id": 145912,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152085118",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512666798,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "GIVEN Club or BOC user logs in with UEC print permissions\r\nAND an Employee's contract has Covenants section completed and Saved\r\n\r\n",
    "custom_steps": "WHEN user clicks on Print on UEC\r\n",
    "custom_expected": "THEN Information from the \"Covenants\" section of the contract screen should accurately reflected in the printed contract. \r\nAND Presentation and all language used should match ebis1.\r\n\r\nPrinting Documentation:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Details\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Layout\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Contract+Printing+Rules",
    "custom_steps_separated": null
  },
  {
    "id": 1212507,
    "title": "As a user I want approving an assign/reassign to update the player's status to the appropriate status based on their UEC",
    "section_id": 145913,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151611527",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667096,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nGIVEN a user is logged in as BOC approver\r\nAND an Assign/Reassign Employee tx has been submitted to BOC for approval\r\n",
    "custom_steps": "WHEN BOC approver Approves the Assign/Reassign tx",
    "custom_expected": "THEN system should assign the employee's roster status based on the status of the contract\r\nAND if the employee has a current Approved or Submit Signed UEC, then the roster status should be set to \"Active\"\r\nBUT if the employee does not have a current Approved or Submit Signed UEC, then the roster status should be set to \"Active, Not Under Contract\"",
    "custom_steps_separated": null
  },
  {
    "id": 1213899,
    "title": "As a user I want changing the employee's position to auto-create an assign/reassign transaction for the employee",
    "section_id": 145913,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152456872",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512680801,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN a club and BOC user is logged with edit employee contract permissions \r\nAND user is viewing a employee contract in Approved or Submit Signed state\r\n ",
    "custom_steps": "When user clicks \"Change Position\"",
    "custom_expected": "THEN system will enable the position fields for editing. \r\nAND On Save, if the Change Position action has been taken, the system should check if the employee's current position differs from the new position on the UEC.\r\nAND If yes, then an Assign/Reassign Employee transaction is auto-created and submitted for the employee for the position indicated on the UEC. \r\nAND All stateflow changes and submission/approval updates should follow the Assign/Reassign rules as though it were created manually.\r\n\r\nWireframe (scroll down and to the right):\r\nhttps://hri2kq.axshare.com/#p=info_and_general_layout\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212552,
    "title": "As a user I want to be able to delete a Place on Temporarily Inactive List transaction",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535010",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a user with edit permissions for the transaction is logged in\r\nAND transaction is in Preliminary or Rejected state",
    "custom_steps": "WHEN user opens the form in view or edit mode",
    "custom_expected": "THEN user should see a \"Delete\" button on the form in grey\r\nAND clicking \"Delete\" should prompt the user to confirm that they wish to delete the form from the system\r\nAND warning should be as follows:\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND if they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown\r\nBUT if they do not confirm the deletion, then they should be returned to the form and no action should be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1212548,
    "title": "As a user I want to view an existing Place on Temporarily Inactive List transaction",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535019",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nWireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_temporary_inactive_list\r\nGIVEN a club or BOC user is logged in with view permissions for Temp Inactive List tx",
    "custom_steps": "WHEN user attempts to open a Temp Inactive list tx from Employee's history or adv search",
    "custom_expected": "THEN clicking on the transaction in an employee's History or Advanced Search should open the transaction in the same window\r\nAND the layout of the transaction should match the View mode of the provided wireframe\r\nAND fields should match the provided data discovery\r\nAND whenever the form is in view mode, the user should see a \"Close\" button on the form in grey\r\nAND clicking \"Close\" should return the user to their entry point into the transaction\r\nAND the field Current Status should display in red if the transaction is in a preliminary state, green if pending and black for all other states(global AC)",
    "custom_steps_separated": null
  },
  {
    "id": 1213923,
    "title": "As a BOC user I want approving an Employee's Place on Temporarily Inactive List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394002",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512675505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user is logged in with daily transaction bulletin permissions",
    "custom_steps": "WHEN a  \"Placed on Temporarily Inactive List\" is approved for a MJ Roster employee",
    "custom_expected": "THEN transaction should appear on the current Pending Daily Transaction Bulletin as  \"Placed on Temporarily Inactive List\"\r\nAND when a  \"Placed on Temporarily Inactive List\" transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed\r\nBUT if it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \" \"Placed on Temporarily Inactive List - Reversed\" \r\nAND when a  \"Placed on Temporarily Inactive List\" is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1213922,
    "title": "As a Club user I want to be prevented from initiating a Place on Temporarily Inactive List transaction for an employee at the MJ Level",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950304",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512675682,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "See Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nSee Messages #17:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club user is logged in with create permissions for Place on Temporarily Inactive list tx\r\nAND user is attempting to create a \"Place on Temporarily Inactive List\" for an Employee\r\nAND selected Employee is at the MJ level",
    "custom_steps": "WHEN user Selects \"Place on Temporarily Inactive List\" on the Employee Transactions create new menu",
    "custom_expected": "THEN system should check to see if the Employee's current position level is Major League\r\nAND if it is, system should display error #17 \"Only a BOC user is authorized to use the selected transaction on this employee\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1213920,
    "title": "As a Club user I want to receive a notification when my Place on Temporarily Inactive List transaction is approved, rejected, or reversed",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534998",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512676720,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 8,
    "custom_preconds": "See Clipboard Rules (#1, #2, #3): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard\r\nSee Wireframe: \r\nhttp://7xflwf.axshare.com/#p=clipboard_-_notifications\r\nGIVEN a club user is logged in \r\nAND a \"Place on Temporarily Inactive List\" transaction has been initiated for an Employee from user's club\r\n",
    "custom_steps": "WHEN \"Place on Temporarily Inactive List\" transaction is Approved, Rejected, or Reversed",
    "custom_expected": "THEN initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Approved\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Rejected\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink of any of these notifications should open the transaction in view mode in the same window/tab \r\nAND player's name should be a hyperlink\r\nAND clicking on the player's name hyperlink of any of these notifications should open the player's profile in view mode in the same window/tab on the Player History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1213913,
    "title": "As a Club user I want to be prevented from initiating a Place on Temporarily Inactive List transaction for an employee that does not belong to my Club",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535016",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512677534,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 10,
    "custom_preconds": "Given a club user is logged in with create permissions for Place on Temporarily Inactive List Transactions\r\nAND user is attempting to create  a \"Place on Temporarily Inactive List\" for an employee that does not belong to logged in club \r\n ",
    "custom_steps": "WHEN user Selects \"Place on Temporarily Inactive List\" on the Employee Transactions create new menu",
    "custom_expected": "THEN system will check if the employee's Current Org is set to the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nAND If the Org of the initiating user is not BOC or the Current Org of the employee, then display message #1.",
    "custom_steps_separated": null
  },
  {
    "id": 1213914,
    "title": "As a user I want to receive an error if the employee I am creating a Place on Temporarily Inactive List transaction for has a pending or approved transaction after the entered assignment date",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535014",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512678104,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List Transactions\r\nAND user is attempting to submit or approve a Place on Temporarily Inactive List Transactions \r\nAND Employee the tx is being created for has a pending or approved transaction dated after the entered assignment date of Place on Temporarily tx",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (All places OnSubmit rules fired)",
    "custom_expected": "THEN system will check if the Assignment date is before the latest approved or pending (Pending to Club, Submitted to BOC) transaction date for the employee. If it is, an error will display. Messages #3.",
    "custom_steps_separated": null
  },
  {
    "id": 1213918,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Place on Temporarily Inactive List transaction",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535009",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512678144,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 12,
    "custom_preconds": "See Reverse/Suppress Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nGIVEN a BOC user is logged in with approver permissions\r\n",
    "custom_steps": "WHEN user is viewing a Place on Temporarily Inactive List transaction (in view or edit mode) in the Approved state\r\n",
    "custom_expected": "THEN user should see a \"Reverse\" button in grey\r\nAND clicking \"Reverse\" should run all required field and formatting checks and display any relevant error or warning messages. (On Submit rules should not be run)\r\nAND successful reverse notification should be displayed. See Messages #16\r\nAND the transaction status should be updated to \"Reversed\"\r\nAND system should display reversed transaction in player history with \"Voided\" in front of the transaction description. Example:\"Voided: Major/Minor Outright\"\r\nAND system should set the employee's Status, Club and Org to their values from prior to the transaction approval\r\nAND users that have permission to suppress the form should see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode\r\nAND clicking \"Reverse and Suppress\" should first reverse, and then suppress the transaction\r\nAND clicking \"Suppress\" should suppress the transaction\r\nAND when a transaction is suppressed it should be hidden from the employee's History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI\r\nAND clicking \"Reverse\" or \"Reverse and Suppress\", should check if the current transaction is the most recent approved transaction\r\nAND if the transaction is not the most recent approved transaction for the employee, then the user should receive an error message\r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND user will ONLY have the back option\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1213915,
    "title": "As a user I want to receive an error if the person I'm attempting to create an Employee Place on Temporarily Inactive List transaction for is not an Active Employee",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535017",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512678515,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List Transactions\r\nAND user us attempting to submit a Place on Temporarily Inactive tx for not active employee\r\n",
    "custom_steps": "WHEN user selecting \"Place on Temporarily Inactive List\" from the transaction Create New menu",
    "custom_expected": "THEN system will check that the person is a currently Active or Active, Not Under Contract employee . If not, display error #12.\r\n\r\nBusiness Rule 6.01: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nMessages #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213916,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Temporarily Inactive List transaction for an employee with a prior pending transaction",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535011",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512679133,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 14,
    "custom_preconds": "GIVEN a BOC Approver is logged with the Employee Permissions \r\nAND user attempting to approve a Place on Temporarily Inactive List tx \r\nAND Employee the tx is being approve for has a pending transaction dated prior the assignments date of the Place on Temporarily tx ",
    "custom_steps": "WHEN user clicks \"Approve\"",
    "custom_expected": "THEN system will check if the employee has any pending transactions with an assignment date prior to this transaction's assignment date.  If yes, display message #19.\r\n\r\nBusiness Rule 6.16: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nMessages #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213917,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Temporarily Inactive List transaction with an assignment date after the current date",
    "section_id": 145914,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535012",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512679576,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 15,
    "custom_preconds": "Business Rule 6.15: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nMessages #9: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to Approve a Place on Temporarily Inactive List transaction\r\nAND Assignment Date on the transaction is later than current date",
    "custom_steps": "WHEN user clicks \"Approve\" ",
    "custom_expected": "THEN system should check if the current date is before the assignment date entered on the transaction\r\nAND if it is, system should display message #9: \"This transaction cannot be approved unless the placement date is on or before the current date.\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1212554,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions - Basic",
    "section_id": 145915,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 103,
    "created_on": 1510589510,
    "updated_by": 156,
    "updated_on": 1512673529,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List tx",
    "custom_expected": "THEN user should be able to view and Print all employee transactions [Club and BOC] in all states for employees\r\nBUT user should not be able to make any changes or e-sign\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states\r\nBUT users without the permission should not be able to view the form anywhere in the system",
    "custom_steps_separated": null
  },
  {
    "id": 1212550,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions - Admin",
    "section_id": 145915,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512674071,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Admin Permissions",
    "custom_steps": "WHEN user attempts to do anything with Temp Inactive List tx",
    "custom_expected": "THEN user should be able to view and Print all Temp Inactive List transactions [Club and BOC] in all states for Employees\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states\r\nAND user should be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable) \r\nAND user should be able to Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags\r\nBUT Users without the permission cannot view the form anywhere in the system.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1213909,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions",
    "section_id": 145915,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512674823,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Admin Permissions\r\nOR a BOC user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List transactions",
    "custom_expected": "THEN user with Admin permissions can view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND Can view all flags for all transactions and transaction attachments in all states.\r\nAND Can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND Can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\nOR user with Viewer permissions can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1213910,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions",
    "section_id": 145915,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512675512,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "GIVEN a club user is logged in with Employee Place on Temporarily Inactive List Admin Permissions\r\nOR a club user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions ",
    "custom_steps": "When user attempts to do anything with a Temporarily Inactive Transactions ",
    "custom_expected": "THEN user with Viewer permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n\r\n          However, there are exceptions:\r\n                  1. No Transactions that are in Suppressed state\r\n                  2. They cannot edit or change these transactions (Basic only)\r\n                  3. They cannot see \"BOC Notes\" field\r\n \r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\nOR User with Admin permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n \r\n      However, there are exceptions:\r\n      1. No Transactions that are in Suppressed state\r\n      2. They cannot see \"BOC Notes\" field\r\n\r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n      1.  Cannot see BOC Notes field for any transaction\r\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n \r\nBUT Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1212533,
    "title": "As a user I want to receive an error if the person I am trying to create an Employee Place on Ineligible List transaction for is not an Active Employee",
    "section_id": 145916,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534233",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667685,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction permission\r\n",
    "custom_steps": "WHEN user tries to create an Employee Place on Ineligible List transaction for not  Active Employee\r\n\r\n",
    "custom_expected": "THEN Selecting \"Place on Ineligible List\" from the Employee Transaction Create New menu will check that the person is a current Employee with an Active or Active (Not Under Contract) status.  If not, display Error #12.\r\n\r\nSee Business Rule #8.01, 8.05: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1212532,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Ineligible List transaction for an employee that has a prior pending transaction",
    "section_id": 145916,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534243",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667685,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC approver logs in with Employee transaction permission\r\nAND an employee has a prior pending Place on Ineligible List transaction\r\n\r\n",
    "custom_steps": "WHEN user clicks on Approve a new Place on Ineligible List transaction\r\n\r\n",
    "custom_expected": "THEN Clicking \"Approve\" will check if the current date is after the assignment date entered on the transaction. If yes, then a warning will be shown. If the assignment date is on or before the current date, then no error is shown. See Messages #19.\r\n\r\nSee Business Rule #8.09: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1212526,
    "title": "As a Club user I want to receive a notification when my Place on Ineligible List transaction is approved or reversed",
    "section_id": 145916,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534247",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667685,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction Permissions\r\n\r\n",
    "custom_steps": "WHEN BOC user Approves or Reverse Place on Ineligible List transaction\r\n",
    "custom_expected": "THEN Initiating Club (or the Club that the employee belongs to) will receive a notification when the transaction is updated to Approved. \r\nOR Initiating Club (or the Club that the employee belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Employee's name will be a hyperlink.\r\nAND Clicking on the employee's name hyperlink of any of these notifications will open the employee's profile in view mode in the same window/tab on the History tab.\r\n\r\nSee Clipboard Rules (#2, #4): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1212523,
    "title": "As a BOC user I want to approve a Place on Ineligible List transaction",
    "section_id": 145916,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534239",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667685,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions \r\n\r\n\r\n",
    "custom_steps": "WHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in Preliminary",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved. \r\nAND Update Employee's History: Code =  INELG , Description = Place on Ineligible List , From Org/Club field to be in black font. \r\nAND Update player's Employee Status to be \"Ineligible\".\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Ineligible+List",
    "custom_steps_separated": null
  },
  {
    "id": 1213924,
    "title": "As a BOC user I want approving an Employee's Place on Ineligible List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 145916,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534238",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512675056,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with daily transaction bulletin permissions",
    "custom_steps": "WHEN a Place on Ineligible List is approved for a MJ Roster employee",
    "custom_expected": "THEN transaction should appear on the current Pending Daily Transaction Bulletin as \"Placed on Ineligible List\"\r\nAND when a Place on Ineligible List transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed\r\nBUT if it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Placed on Ineligible List - Reversed\" \r\nAND when a Place on Ineligible List is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1212725,
    "title": "Place on Ineligible List Permissions - Club - Employee Transactions  - Basic",
    "section_id": 145917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534236",
    "created_by": 136,
    "created_on": 1510858998,
    "updated_by": 156,
    "updated_on": 1512667797,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Place on Ineligible List tx\r\n",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAnd user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1212528,
    "title": "Place on Ineligible List Permissions - Club - Employee Transactions - Admin",
    "section_id": 145917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534236",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512667797,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in with viewer permissions for a Place on Ineligible List Transaction\r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List Transaction\r\n",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view or print Transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1212724,
    "title": "Place on Ineligible List Permissions - BOC - Employee Transactions - Basic",
    "section_id": 145917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534237",
    "created_by": 136,
    "created_on": 1510858036,
    "updated_by": 156,
    "updated_on": 1512674005,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Transactions Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List tx",
    "custom_expected": "THEN user will be able to view and Print all employee transactions in all states for employees but cannot make any changes or e-sign.\r\nAnd use will be able to view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1212527,
    "title": "Place on Ineligible List Permissions - BOC - Employee Transactions-Admin",
    "section_id": 145917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534237",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512673935,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transactions Admin Permissions\r\n\r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with Place on Ineligible List Transaction",
    "custom_expected": "THEN user should be able to view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states.\r\nAND user should be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nand user should be able to  Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212547,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Deceased List transaction with an assignment date after the current date",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534705",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "Business Rule #7.08: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #9: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to approve a Place on Deceased List tx",
    "custom_steps": "WHEN user clicks \"Approve\" on the tx",
    "custom_expected": "THEN system should check if the assignment date entered on the transaction is after the current date\r\nAND if yes, system should show Messages #9: \"This transaction cannot be approved unless the placement date is on or before the current date.\"\r\nAND only \"Back\" button should be available\r\nAND Clicking \"Back\" should return user to the point of entry ",
    "custom_steps_separated": null
  },
  {
    "id": 1213908,
    "title": "As a user I want to receive an error if I'm attempting to submit a Place on Deceased List transaction for a player that has a prior pending transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534704",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512671807,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user logs in with with Employee transaction permission\r\nAND an employee has any existing Pending transactions prior to the entered assignment date on the new Place on Deceased List transaction",
    "custom_steps": "WHEN user clicks on Approve on new Place on Deceased List transaction",
    "custom_expected": "THEN all places OnSubmit rules are fired \r\nAND system will check if the employee has any pending transactions with an assignment date prior to this transaction's assignment date.  If yes, display message #19.\r\n\r\nSee Business Rule #7.09: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\n\r\nSee Error Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212546,
    "title": "As a user I want to receive an error if I'm attempting to submit a Place on Deceased List transaction for an Employee that has a prior pending transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534704",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "Business Rule #7.09: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with edit/submit permissions for Deceased List tx\r\nAND user is attempting to submit a Place on Deceased list tx for an Employee\r\nAND the chosen Employee already has a pending tx with an earlier date",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check if the transaction being approved has a transaction date on or after other pending transactions for the player\r\nAND if yes - an error (Messages #19) Should display stating: \"This transaction cannot be approved while a previously submitted transaction is pending.\"\r\nAND only \"Back\" button should be available\r\nAND clicking \"Back\" should return the user to the point of entry\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212545,
    "title": "As a Club user I want to receive a notification when my Place on Deceased List transaction is approved, rejected or reversed",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534703",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "Clipboard Rules (#2, #3, #4): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard\r\nGIVEN a user is logged in as a club admin user\r\nAND a Place on Deceased list tx has been submitted for an Employee from logged in user's org",
    "custom_steps": "WHEN the Deceased List tx is Approved, Rejected, or Reversed\r\nAND user is currently viewing the clipboard for their org",
    "custom_expected": "THEN initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Approved\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Reversed\r\nBUT if the transaction is also Suppressed, club should NOT receive a notification \r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Rejected\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink of any of these notifications should open the transaction in view mode in the same window/tab\r\nAND Employee's name should be a hyperlink\r\nAND clicking on the employee's name hyperlink of any of these notifications should open the employee's profile in view mode in the same window/tab on the History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1212543,
    "title": "As a user I want to receive an error if the person I'm attempting to create a Deceased List transaction for is not a current employee",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534712",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "Business Rule #8.01, 8.05: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with edit/create permissions for Deceased List tx\r\nAND user is viewing the profile that is NOT a current Employee with an \"Active\" or \"Active (Not Under Contract)\" status\r\n",
    "custom_steps": "WHEN user selects \"Place on Deceased List\" from the Employee Transaction Create New menu ",
    "custom_expected": "THEN system should check that the person is a current Employee with an \"Active\" or \"Active (Not Under Contract)\" status\r\nAND if not, system should display Error #12: \"This person is not an Active Employee.\"\r\nAND only a \"Back\" button should be available\r\nAND clicking \"Back\" should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1212542,
    "title": "As a user I want to edit an existing Place on Deceased List transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534713",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 7,
    "custom_preconds": "Data Discovery: https://wiki.mlbam.com/display/EBIS/Deceased+List\r\nGIVEN a club or BOC user is logged in with edit permissions for Deceased List tx\r\n",
    "custom_steps": "WHEN user opens a Place on Deceased List tx in view mode",
    "custom_expected": "THEN an Edit button should be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state\r\nAND clicking  Edit should reload the form in edit mode\r\nAND a Save button should appear in place of the Edit button (no edit button displayed in edit mode)\r\nAND in Preliminary state, the BOC users should be able to edit all portions displayed on the form\r\nBUT club should not be able to edit existing attachments or any other part of transaction\r\nAND BOC should be able to edit all fields in all states except for Approved and Reversed transactions\r\nAND in Approved and Reversed transactions, edit should only give BOC access to attach new files or edit existing attachments. (They should also be able update \"Comments\" and \"BOC Notes\" fields)\r\nBUT they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND a Save button should be available anytime the form is in edit mode\r\nAND clicking Save should save the transaction and it's current values and reload the form in View mode\r\nAND transaction status should be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status should not change\r\nAND after a successful save the system should display a successful save blue notification\r\nAND whenever the form is in edit mode, the user should see a \"Cancel\" button on the form in grey\r\nAND clicking \"Cancel\" should prompt the user to confirm that they wish to cancel the changes they have made\r\nAND if they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction\r\nBUT if they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected\r\nAND if they do not confirm the cancellation then the user should be returned to the form and no action should be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1212539,
    "title": "As a BOC user I want to approve a Place on Deceased List transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534698",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions\r\n\r\n",
    "custom_steps": "WHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in Preliminary\r\n",
    "custom_expected": "THEN BOC Approvers will see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved. \r\nAND Update History: Code = DEAD (not displayed on front end) , Description = Place on Deceased List , From Org/Club and To Org/Club fields to be in black font. \r\nAND Update employee's to be \"Deceased\". Do NOT display this roster status. On front end roster status should appear blank. \r\nAND Status should not appear on profile or in advanced search. \r\nAND Update logo displayed on employee profile to standard MLB logo to signify they are no longer associated with a team.\r\nAND Do NOT Add transaction to the Daily Transaction Bulletin.\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List",
    "custom_steps_separated": null
  },
  {
    "id": 1212536,
    "title": "As a user I want to be able to delete a Place on Deceased List transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534718",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC and Club user logs in with edit Employee Transaction permission\r\nAND Place on Deceased List transaction already exist\r\n\r\n",
    "custom_steps": "WHEN user is viewing Place on Deceased List transaction in Preliminary and Rejected states \r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1212535,
    "title": "As a user I want to be able to create a new Place on Deceased List transaction for an Employee",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534716",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 12,
    "custom_preconds": "GIVEN the user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN the user clicks on \"Create New\" button on the Employee Profile\r\n",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown (already built)\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Place on Deceased List\" should be an option in the third level dropdown.\r\nAND Selecting \"Place on Deceased List\" from the Create New will check to see if there is an existing Preliminary Place on Deceased List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOr If no preliminary transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_deceased_list\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1212534,
    "title": "As a user I want to view an existing Place on Deceased List transaction",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534715",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668021,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 13,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction permission\r\nAND Place on Deceased List transaction already exist\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in an employee's History or Advanced Search\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND  Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND  Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC:\r\n* The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_deceased_list",
    "custom_steps_separated": null
  },
  {
    "id": 1213921,
    "title": "As a Club user I want to be prevented from initiating a Place on Deceased List transaction for an employee at the MJ Level",
    "section_id": 145918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152741328",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 103,
    "updated_on": 1512676066,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 14,
    "custom_preconds": "See Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nSee Messages #17:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club user is logged in with create permissions for Place on Deceased list tx\r\nAND user is attempting to create a \"Place on Deceased List\" for an Employee\r\nAND selected Employee is at the MJ level",
    "custom_steps": "WHEN user Selects \"Place on Deceased List\" on the Employee Transactions create new menu\r\n",
    "custom_expected": "THEN system should check to see if the Employee's current position level is Major League\r\nAND if it is, system should display error #17 \"Only a BOC user is authorized to use the selected transaction on this employee\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1212537,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions - Admin",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512671731,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List  Admin Permissions \r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with Place on Deceased List\r\n\r\n",
    "custom_expected": "THEN user will be able to view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND user will be able to view all flags for all transactions and transaction attachments in all states.\r\nAND user will be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND user will be able to Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.",
    "custom_steps_separated": null
  },
  {
    "id": 1212726,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions  - Basic",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 136,
    "created_on": 1510859053,
    "updated_by": 156,
    "updated_on": 1512671767,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List Basic Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Place on Deceased List Permissions",
    "custom_expected": "THEN user will be able to view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND user will be able to view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1212538,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions - Basic",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 103,
    "created_on": 1510585153,
    "updated_by": 156,
    "updated_on": 1512668164,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 3,
    "custom_preconds": "GIVEN a club user is logged in with basic (viewer) permissions for Place on Deceased List tx",
    "custom_steps": "WHEN basic club user attempts to do anything with a Place on Deceased List tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should NOT be able edit or change these transactions\r\nAND user should NOT be able to see \"BOC Notes\" field\r\nAND user should NOT be able to view any Transactions that are in Suppressed state \r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should NOT be able to see BOC Notes field for any transaction\r\nAND user should NOT be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. (Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org)\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees",
    "custom_steps_separated": null
  },
  {
    "id": 1212728,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions - Admin",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 103,
    "created_on": 1510865586,
    "updated_by": 156,
    "updated_on": 1512668164,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN a club user is logged in with admin permissions for Place on Deceased List tx",
    "custom_steps": "WHEN club admin user attempts to do anything with a Place on Deceased List tx\r\n",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should NOT be able to view Transactions that are in Suppressed state\r\nAND user should NOT be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should NOT be able to see BOC Notes field for any transaction\r\nAND user should NOT be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. (Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org)\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1213906,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512673763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List Admin Permissions \r\nOR a BOC user is logged in with Employee Place on Decease List Viewer Permissions",
    "custom_steps": "WHEN BOC user attempts to do anything with Employee Place on Deceased List",
    "custom_expected": "THEN BOC with Admin permissions can view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND Can view all flags for all transactions and transaction attachments in all states.\r\nAND Can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND Can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\nOR BOC with Viewer permissions can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1213907,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions",
    "section_id": 145919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 156,
    "updated_on": 1512675546,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "GIVE a club user is logged in with Employee Place on Deceased List Admin Permissions \r\nOR a club user is logged in with Employee Place on the Decease List Viewer Permissions",
    "custom_steps": "WHEN club user attempts to do anything with Place on Deceased List transactions",
    "custom_expected": "THEN club with Viewer permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n\r\n          However, there are exceptions:\r\n                  1. No Transactions that are in Suppressed state\r\n                  2. They cannot edit or change these transactions (Basic only)\r\n                  3. They cannot see \"BOC Notes\" field\r\n \r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\nOR club with admin permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n \r\n      However, there are exceptions:\r\n      1. No Transactions that are in Suppressed state\r\n      2. They cannot see \"BOC Notes\" field\r\n\r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n      1.  Cannot see BOC Notes field for any transaction\r\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n \r\nBUT Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1213937,
    "title": "As a BOC user I want approving an Employee's Place on Suspended List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 145921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394003",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512670215,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user logs in with employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN user approves Place on Suspended List transaction for a MJ Roster employee",
    "custom_expected": "THEN it should appear on the current Pending Daily Transaction Bulletin as \"Place on Suspended List\"\r\nBUT When a Place on Suspended List transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed. If it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Place on Suspended List - Reversed\" \r\nOR When a Place on Suspended List is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed.",
    "custom_steps_separated": null
  },
  {
    "id": 1213936,
    "title": "As a BOC user I want to approve or reject a Place on Suspended List transaction",
    "section_id": 145921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393969",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512670234,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user logs in with Employee transaction permission\r\n\r\n\r\n",
    "custom_steps": "WHEN BOC user opens a Place on Suspended List transaction in Preliminary or Submitted to BOC (in view or edit mode)\r\n\r\n\r\n",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nBUT If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved.  \r\nAND Update Player's Player History: Code = EESUSPD , Description = Place on Suspended List , From Org fields to be in black font. \r\nAND Update employee's Status to be Suspended. \r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. \r\nBUT If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Remove pending history entry.\r\n\r\nSee Approval/Rejection Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/5.+Place+on+Suspended+List\r\n\r\nSee Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1213934,
    "title": "As a user I want to be able to delete a Place on Suspended List transaction",
    "section_id": 145921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393971",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512671735,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 4,
    "custom_preconds": "GIVEN the Club or BOC user logs in with Employee Transaction permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user opens a Place on Suspended List transaction in Preliminary and Rejected states\r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nBUT If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1213933,
    "title": "As a user I want to be able to create a new Place on Suspended List transaction for an employee",
    "section_id": 145921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393972",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512671749,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 5,
    "custom_preconds": "GIVEN Club or BOC user logs in with Employee Transaction Permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on Create New for an Employee",
    "custom_expected": "THEN user will see \"Employee Transactions\" is an option in the top-level dropdown\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Place on Suspended List\" should be an option in the third level dropdown.\r\nAND Selecting \"Place on Suspended List\" from the Create New will check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Place on Suspended List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary or rejected transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nAND If a submitted transaction already exists, the system will load the existing transaction in View Mode.\r\nBUT If no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Suspended+List\r\n\r\nSee Wireframe: ",
    "custom_steps_separated": null
  },
  {
    "id": 1213932,
    "title": "As a user I want to view an existing Place on Suspended List transaction",
    "section_id": 145921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393974",
    "created_by": 136,
    "created_on": 1512666200,
    "updated_by": 136,
    "updated_on": 1512671762,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20266,
    "display_order": 6,
    "custom_preconds": "GIVEN Club or BOC user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN Clicking on Place on Suspended List transaction in an employee's History or Advanced Search\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC:The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Suspended+List\r\n",
    "custom_steps_separated": null
  }
]