[
  {
    "id": 574823,
    "title": "As BOC, I want to search for Trades that have specific types of considerations",
    "section_id": 74903,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129473729",
    "created_by": 99,
    "created_on": 1475680861,
    "updated_by": 99,
    "updated_on": 1477411440,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 1,
    "custom_preconds": "GIVEN logged in as BOC",
    "custom_steps": "WHEN searching for transactions and transaction type is set to Outright Trade",
    "custom_expected": "THEN show a sub filter that has 3 multi-select options: \"Includes player to be named later, Includes Rule 4 Draft Pick, Includes Signing Bonus Slot\"\r\nAND if a PTBNL subfilter has been picked, only show trades search results where the consideration is part of a Trade that also has a PTBNL considerations (named or unnamed)\r\nAND if Draft pick, or Bonus slot sub filter is picked, only show results where the consideration is part of a trade that had these options\r\nAND for all 3 subfilters, the search results may show a mix of player results, draft picks and bonus slots",
    "custom_steps_separated": null
  },
  {
    "id": 642060,
    "title": "As a club, I can reject a trade",
    "section_id": 78395,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126536331",
    "created_by": 99,
    "created_on": 1478723153,
    "updated_by": 99,
    "updated_on": 1478723153,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**Reference**\nButton states - https://u8r.jamacloud.com/perspective.req#/items/2310830?projectId=14044\n\n**AC**\n- Club can hit the 'Reject' button on the Trade. This updates the transaction status to \"Rejected\"\n- Page reloads for rejecting club with updated button set. See button state table\n- Any action items for other participating clubs are automatically removed \n- All other participating clubs gets a notification with Description = Outright (Trade)  is rejected by [Org]\n- The notification links back to the Transaction. The initiating club sees an updated button set with full edit access similar to preliminary\n- Initiating club can resubmit the rejected Trade to \"Submit to Club\" state or can delete the transaction\n- No rule checks should be run\n\n\n**Global**\n- Show blue success notification - \"The transaction has been successfully rejected\"\n- The status and dates section updates with latest state change",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 642062,
    "title": "As BOC, I want to search for Trades that have specific types of considerations",
    "section_id": 78395,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129473729",
    "created_by": 99,
    "created_on": 1478723153,
    "updated_by": 99,
    "updated_on": 1478723188,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- If Transaction type is set to Outright Trade, then show a sub-filter\n- The sub filter has 3 multi-select options \"Includes player to be named later, Includes Rule 4 Draft Pick, Includes Signing Bonus Slot\"\n- If a PTBNL subfilter has been picked, only show trades search results where the consideration is part of a Trade that also has a PTBNL considerations (named or unnamed)\n- If Draft pick, or Bonus slot sub filter is picked, only show results where the consideration is part of a trade that had these options\n- For all 3 subfilters, the search results may show a mix of player results, draft picks and bonus slots",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 642063,
    "title": "As BOC, I can reverse a trade",
    "section_id": 78395,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129462567",
    "created_by": 99,
    "created_on": 1478723153,
    "updated_by": 99,
    "updated_on": 1478723188,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "**Reference**\nButton states - https://u8r.jamacloud.com/perspective.req#/items/2310830?projectId=14044\n\n**AC**\n- BOC can hit the 'Reverse' button on an Approved Trade. This updates the transaction status to \"Reversed\"\n- BOC may only reverse this trade if it is the most recent approved transaction for all involved players. If not, show hard error \"Only a player's latest approved transaction can be reversed\"\n- Reverse all Approval updates in story #129463383 and reset all players to their Org/roster status prior to the transaction. \n- Page reloads for BOC with updated button set. See button state table\n- All participating clubs get a notification with Description = Outright (Trade)  is reversed\n- Player history and daily trans bulletin gets (Voided) next to description\n- If an auto-recall was created, that gets reversed also.\n- Rule 4 draft picks traded value and intl signing bonus slot adjustments must be reversed to their original value\n\n**Global**\n- Show blue success notification - \"The transaction has been successfully reversed\"\n- The status and dates section updates with latest state change",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 642061,
    "title": "As Club/BOC, I can view players to be named later who are part of a trade",
    "section_id": 78396,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126234667",
    "created_by": 99,
    "created_on": 1478723153,
    "updated_by": 99,
    "updated_on": 1478723153,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**Wireframe:**\nhttp://t4lvuq.axshare.com/#p=post_approval_examples\nhttp://t4lvuq.axshare.com/#p=club_names_player\n\n**AC**\n- Any approved trades with PTNL sections in ebis 1, should display correctly in ebis 2 with the same PTBNL fields.\n- If a player to be named is included in the trade, show this under the Org that he will originate from, with sub-section 'Player(s) To Be Named'\n- For each player to be named, show as a separate table (See wire)\n- The data should match the equivalent data in ebis 1\n- If the player has already been named, clubs can see the player's details only. The original PTBNL section with the alt cash value is no longer displayed for that player. However BOC continues to see the original Alt cash table and the player consideration table.\n- When a non-participating club is looking at the trade and the player is not yet named, they cannot see the PTBNL section. If the player is named and approved, they can see Player details\n- The 'name player' button should not appear in view mode\n- Player name should link to player history",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 642064,
    "title": "UAT feedback: Show trade on the clipboard when it's \"Submitted to Club\"",
    "section_id": 78398,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132170485",
    "created_by": 99,
    "created_on": 1478723153,
    "updated_by": 99,
    "updated_on": 1478723153,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 12547,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "**AC**\n- When trade reached \"pending to club\" status, it should show on the BOC clipboard",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]