[
  {
    "id": 28730595,
    "title": "R5017A - Application functions on a Testing Kit",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5017",
    "created_by": 349,
    "created_on": 1655475728,
    "updated_by": 349,
    "updated_on": 1655832547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 1,
    "custom_is_automated": null,
    "custom_preconds": "**Suspend/Resume feature**\r\n\r\n**R5017 Requirement:**  The features implemented in the application have been confirmed to run as intended with a Testing Kit with \"Release Check Mode\" set to \"Release Mode\".\r\n\r\n**Description:**  Since Development Kits are designed to prioritize convenience for development, some of the system behavior may vary from retail units. By using Testing Kits with \"Release Check Mode\" set to \"Release Mode\" to test application behavior, it will be possible to test the operation as intended in retail unit environments. Be sure to test the application with Testing Kits before submitting the master to SIE.\r\n\r\nNote that operation testing that assumes a retail unit environment will not be possible with a Testing Kit set to \"Assist Mode\", therefore it will not be possible to use it for operation testing of this requirement.",
    "custom_steps": "1. Select the \"Application\"\r\n2. Check throughout the entire application",
    "custom_expected": "The features implemented in the application work as intended on the Testing Kit.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28730597,
    "title": "R5017B - Application functions when waking from Rest Mode",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5017",
    "created_by": 349,
    "created_on": 1655476236,
    "updated_by": 349,
    "updated_on": 1655483111,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 2,
    "custom_is_automated": null,
    "custom_preconds": "**Suspend/Resume feature**\r\n\r\n**R5017 Requirement:**  The features implemented in the application have been confirmed to run as intended with a Testing Kit with \"Release Check Mode\" set to \"Release Mode\".\r\n\r\n**Description:**  Since Development Kits are designed to prioritize convenience for development, some of the system behavior may vary from retail units. By using Testing Kits with \"Release Check Mode\" set to \"Release Mode\" to test application behavior, it will be possible to test the operation as intended in retail unit environments. Be sure to test the application with Testing Kits before submitting the master to SIE.\r\n\r\nNote that operation testing that assumes a retail unit environment will not be possible with a Testing Kit set to \"Assist Mode\", therefore it will not be possible to use it for operation testing of this requirement.",
    "custom_steps": "1. Select the \"Application\"\r\n2. Advance to an arbitrary point in the application\r\n3. Press and release the PS button > press the down button on the Control Center > select \"Power\" > \"Enter Rest Mode\"\r\n4. Leave the system in rest mode for 6 to 9 hours\r\n5. Press the PS button on the wireless controller for PlayStation®5 to wake the system from rest mode\r\n6. Check throughout the entire application\r\n\r\n**Notes:**\r\n- When the PS button is pressed during mid-action (e.g. when a character is mid-fall) if the application resumes gameplay at the same point when the PS button is pressed again then the same should also occur at that point when resuming from Rest Mode when performing steps (3) to (5).\r\n- Perform step (3) throughout the application and especially check the following areas.\r\n---- Just prior to an event occurring or an item being obtained\r\n---- During use of network features. Note, when resuming from rest mode in a network feature a network disconnection will occur",
    "custom_expected": "When the application wakes from the rest mode, the following occurs.\r\n\r\nThe application does not freeze or otherwise become inoperable.\r\nAll areas and game modes (e.g. menus) are displayed and are accessible.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28730600,
    "title": "R5018A - Display an animation if the required loading time exceeds 30 seconds.",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5018",
    "created_by": 349,
    "created_on": 1655488937,
    "updated_by": 349,
    "updated_on": 1655495346,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 5,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5018 Requirement:** If the time required for scene transition (such as entering into a certain game mode or switching chapter/stage/level) exceeds 30 seconds, the application displays an animation. Progress information such as a progress bar or the remaining time is displayed if the time required for scene transition exceeds 60 seconds.\r\n\r\n**Description**\r\nIf the time required for scene transition exceeds 30 seconds, an animation must be displayed. Progress information must be displayed if the time required for scene transition exceeds 60 seconds so that it is not deemed as a \"suspended unresponsive screen state\" as defined in R5019.\r\n\r\nRecommended implementations for displaying progress information are:\r\n- Repeatedly flashing a message that explains what is being processed (ex. Now downloading required assets, Now waiting for other players, etc.)\"\r\n- Repeatedly moving an icon up and down\r\n\r\nIt is not recommended to use vague terms to explain scene transitions, especially, please refrain from using \"loading\" since no-loading user experience is one of the vision SIE would like to achieve with PlayStation®5 console.\r\n\r\nExamples of situations covered by this requirement that may prolong the time required for scene transitions are:\r\n- Downloading of files to download\r\n- Network activity that cannot be cancelled by the user e.g.\r\n-- Waiting for other players over the network\r\n-- Waiting on server response for score ranking, matching, etc\r\n\r\nNetwork related waiting times are also covered in R5033.\r\n\r\nDownloading package files for PlayGo scenarios is exempt from this requirement. However, if the files required for game progress are not completely downloaded and game progress becomes impossible, it is strongly recommended to display progress information to users, similar to this requirement.\r\n\r\n**QA NOTE**\r\n- For this test case, please set \"★Debug Settings\" >\"Game\" > \"Slow SSD Mode\" to \"Off\".\r\n- Check in all instances where scene transition occurs, such as when the application is launching and when changing chapters, stages, or modes.\r\n- Icons and text for scene transitions that do not move or change violate this requirement. Acceptable animations include scrolling the text or changing its color and moving or rotating icons.\r\n- Please perform this test case after the application starts up and processing on the application-side is started. Application startup can be confirmed with the following system message.\r\n[T-004][Info]\r\nSystemSoftware:\r\nApplication Started.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Proceed to where scene transition is performed",
    "custom_expected": "The application displays an animation if the time required for scene transition exceeds 30 seconds.\r\n\r\nProgress information such as a progress bar or the remaining time is displayed if the time required for scene transition exceeds 60 seconds.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28730601,
    "title": "R5019A - Suspended unresponsive screen states do not last longer than 30 seconds",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5019",
    "created_by": 349,
    "created_on": 1655490418,
    "updated_by": 349,
    "updated_on": 1655490499,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 6,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5019 Requirement:**  Confirm that suspended unresponsive screen states do not last longer than 30 seconds.\r\n\r\n\"Suspended unresponsive screen states\" are states where both of the following conditions are met.\r\n- The screen display does not change\r\n- There are no responses to user operations\r\n\r\nOn the other hand, the following are not included in \"suspended unresponsive screen states\".\r\n- When the screen does not change but the user is prompted to perform an operation to transition to another screen, such as in scenes where a \"Press a button\" text message is displayed or an audio instruction is given\r\n- When user operations are not accepted while the screen continually changes, such as scene transitions which are defined in R5018, scenes where a movie clip is being played back in the middle of game progress as part of the game presentation, or character dialogue scenes\r\n\r\n**Description**\r\nThis rule is set so that users will not mistake a suspended unresponsive screen that lasts for a long time as a freeze. It is recommended to use animation in accordance with R5018 even if a suspended screen lasts less than 30 seconds. It is possible to use animation in accordance with R5018 or accept some user operations in order to prevent suspended unresponsive screen states.\r\n\r\nAlso refer to Description for R5033 when implementing processing that waits for a response from a server for score ranking, matching, etc.\r\n\r\n**QA NOTE**\r\n- For this test case, please set \"★Debug Settings\" >\"Game\" > \"Slow SSD Mode\" to \"Off\".\r\n- Check all locations in the application where a \"suspended and unresponsive screen\" continues, including online areas.\r\n- Please perform this test case after the application starts up and processing on the application-side is started. Application startup can be confirmed with the following system message.\r\n[T-004][Info]\r\nSystemSoftware:\r\nApplication Started.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Proceed to where an \"suspended and unresponsive screen\" continues",
    "custom_expected": "The application does not display \"suspended and unresponsive screens\" for longer than 30 seconds.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753715,
    "title": "R5028A - App image and title are displayed",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5028",
    "created_by": 349,
    "created_on": 1655826190,
    "updated_by": 349,
    "updated_on": 1655831544,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 7,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5028 Requirement:** Check that the following content information is created in the specified format and is displayed/played back correctly.\r\n- Still image icons\r\n- Title names\r\n- Background image\r\n- BGM (optional)\r\n- Start-up image\r\n- Save data default icon (optional)\r\n\r\nAlso ensure that content information is pursuant to the following\r\n- If still image icons and title names support multilingual switching, content information correctly switches to the supported language",
    "custom_steps": "1. Place the cursor on the \"Application\" on the home screen\r\n\r\n**Notes:**\r\n- Checking is also possible by selecting \"Information\" in the options menu that is displayed when the options button is pressed in step (1).",
    "custom_expected": "The still image icon and title name are displayed",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753716,
    "title": "R5028B - Start-up image on application launch",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5028",
    "created_by": 349,
    "created_on": 1655826627,
    "updated_by": 349,
    "updated_on": 1655831593,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 8,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5028 Requirement:** Check that the following content information is created in the specified format and is displayed/played back correctly.\r\n- Still image icons\r\n- Title names\r\n- Background image\r\n- BGM (optional)\r\n- Start-up image\r\n- Save data default icon (optional)\r\n\r\nAlso ensure that content information is pursuant to the following\r\n- If still image icons and title names support multilingual switching, content information correctly switches to the supported language",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n\r\n**Notes:**\r\n- A start-up image other than a black image is strongly recommended.\r\n- Please note that R5019 is also applicable in displaying the start-up image.\r\n- After the application is finished displaying the start-up image, if a blacked out screen is displayed before a screen that the application displays, it must be for less than 30 seconds according to R5019.",
    "custom_expected": "The start-up image continues to be displayed until the application displays its screen.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753717,
    "title": "R5028C - Background image in app icon",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5028",
    "created_by": 349,
    "created_on": 1655826827,
    "updated_by": 349,
    "updated_on": 1655831610,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 9,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5028 Requirement:** Check that the following content information is created in the specified format and is displayed/played back correctly.\r\n- Still image icons\r\n- Title names\r\n- Background image\r\n- BGM (optional)\r\n- Start-up image\r\n- Save data default icon (optional)\r\n\r\nAlso ensure that content information is pursuant to the following\r\n- If still image icons and title names support multilingual switching, content information correctly switches to the supported language",
    "custom_steps": "1. Place the cursor on the \"Application\" on the home screen",
    "custom_expected": "The background image is displayed",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753718,
    "title": "R5028F - Default language displays if unsupported language is set",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5028",
    "created_by": 349,
    "created_on": 1655828099,
    "updated_by": 349,
    "updated_on": 1655831627,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 10,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5028 Requirement:** Check that the following content information is created in the specified format and is displayed/played back correctly.\r\n- Still image icons\r\n- Title names\r\n- Background image\r\n- BGM (optional)\r\n- Start-up image\r\n- Save data default icon (optional)\r\n\r\nAlso ensure that content information is pursuant to the following\r\n- If still image icons and title names support multilingual switching, content information correctly switches to the supported language",
    "custom_steps": "1. Press the up button on the home screen\r\n2. Change \"Settings\" > \"System\" > \"Language\" > \"Console Language\" to an arbitrary language\r\n3. Go back to the home screen, place the cursor over the \"Application\" and then check the still image icon and title name\r\n4. Select the \"Application\" on the home screen and check the start-up image\r\n\r\n**Notes:**\r\n- Check in all languages supported by the application. Only a single, arbitrary unsupported language requires checking.\r\n- In step (3), the still image icon and title names can also be checked by pressing the options button and selecting \"Information\" in the options menu.",
    "custom_expected": "If an unsupported language is set, the still image icon, title name, and/or start-up image are displayed in the default language.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753723,
    "title": "R5030A - Essential items display within 90% of the horizontal and vertical screen dimensions",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5030",
    "created_by": 349,
    "created_on": 1655829928,
    "updated_by": 349,
    "updated_on": 1655831644,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 11,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5030 Premise:** If the application disables the \"Scaling to the Display's Safe Area\"\r\n\r\n**R5030 Requirement:** Essential items are displayed using one of the following methods:\r\n- Design the screen so that essential items are included approximately in the center 90% of the vertical/horizontal measurements (90% x 90% of the area)\r\n- Essential items are included in the safe area that can be obtained with sceSystemServiceGetDisplaySafeAreaInfo().\r\n\r\n**Description**\r\nFor details on setting the \"Scaling to the Display's Safe Area\", refer to Param.json File Specification.\r\n\"Essential items\" are as follows:\r\n- Error messages and warning messages defined by the TRC\r\n- Legal texts such as the EULA and other copyright indications\r\n- Online IDs used as the identifiers of users\r\n\r\nIn order to display long strings of characters the application can implement a scrolling feature; it is also acceptable to include features such as \"See Details\" to have the strings displayed in a separate screen.\r\n\r\nIt is prohibited to provide a proprietary screen adjustment feature that overlaps with the \"Adjust Display Area\" feature in the application. Because features to adjust UI parts or HUD elements and a feature to change the aspect ratio of the screen do not overlap with the \"Adjust Display Area\" feature, a proprietary screen adjustment feature can be provided in the application.\r\n\r\n**QA NOTE:** Check in all languages supported by the application.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Proceed to where an essential item is displayed",
    "custom_expected": "When keeping essential items within 90% of the horizontal and vertical dimensions of the screen\r\n- The screen is designed so that essential items are displayed in the center 90% of the vertical/horizontal measurements (90% x 90% of the area).\r\n- The application does not provide its own screen adjustment feature to adjust the overall screen.\r\n- When displaying long character strings, the display is scrolled or a feature, for example, \"See details\" displays the content on a separate screen.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753725,
    "title": "R5030B - Essential items are displayed within the adjusted display area",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5030",
    "created_by": 349,
    "created_on": 1655830112,
    "updated_by": 349,
    "updated_on": 1655831662,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 12,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5030 Premise:** If the application disables the \"Scaling to the Display's Safe Area\"\r\n\r\n**R5030 Requirement:** Essential items are displayed using one of the following methods:\r\n- Design the screen so that essential items are included approximately in the center 90% of the vertical/horizontal measurements (90% x 90% of the area)\r\n- Essential items are included in the safe area that can be obtained with sceSystemServiceGetDisplaySafeAreaInfo().\r\n\r\n**Description**\r\nFor details on setting the \"Scaling to the Display's Safe Area\", refer to Param.json File Specification.\r\n\"Essential items\" are as follows:\r\n- Error messages and warning messages defined by the TRC\r\n- Legal texts such as the EULA and other copyright indications\r\n- Online IDs used as the identifiers of users\r\n\r\nIn order to display long strings of characters the application can implement a scrolling feature; it is also acceptable to include features such as \"See Details\" to have the strings displayed in a separate screen.\r\n\r\nIt is prohibited to provide a proprietary screen adjustment feature that overlaps with the \"Adjust Display Area\" feature in the application. Because features to adjust UI parts or HUD elements and a feature to change the aspect ratio of the screen do not overlap with the \"Adjust Display Area\" feature, a proprietary screen adjustment feature can be provided in the application.\r\n\r\n**QA NOTE:** Check in all languages supported by the application.",
    "custom_steps": "1. Press the up button on the home screen\r\n2. Set \"Settings\" > \"Screen and Video\" > \"Screen\" > \"Adjust Display Area\" to an arbitrary value\r\n3. Go back to the home screen, then select the \"Application\"\r\n4. Proceed to where an essential item is displayed\r\n5. Close the \"Application\"\r\n6. Press the up button on the home screen\r\n7. Set \"Settings\" > \"Screen and Video\" > \"Screen\" > \"Adjust Display Area\" to a setting that differs from step (2)\r\n8. Go back to the home screen, then select the \"Application\"\r\n9. Proceed to where the essential item confirmed in step (4) is displayed\r\n\r\n**Notes:** Check with all resolutions in step (4).",
    "custom_expected": "When displaying essential items according to the display area settings set in the system software\r\n- Essential items are displayed within the display area set by \"Adjust Display Area\".\r\n- The application does not provide its own screen adjustment feature to adjust the overall screen.\r\n- When displaying long character strings, the display is scrolled or a \"See details\" feature displays the content on a separate screen.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753727,
    "title": "R5031A - Essential text is correctly displayed in all supported languages",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5031",
    "created_by": 349,
    "created_on": 1655830678,
    "updated_by": 349,
    "updated_on": 1655831679,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 13,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5031 Requirement:** All essential text is correctly displayed in all languages supported by the application.\r\n\r\n**Description:**\r\n\"Essential text\" refers to the following:\r\n- Error messages and warning messages defined by the TRC\r\n- Legal texts such as the EULA and other copyright indications\r\n\r\nPlease also make sure that the content does not vary between different languages.\r\n\r\n**QA NOTE:** If the application has the option to change language settings within the application and languages other than those supported by the system are available, ensure that essential text is also checked in these languages.",
    "custom_steps": "1. Press the up button on the home screen\r\n2. Set \"Settings\" > \"System\" > \"Language\" > \"Console Language\" to any language supported by the application.\r\n3. Go back to the home screen, then select the \"Application\"\r\n4. Proceed to points where essential text is displayed",
    "custom_expected": "All essential text is displayed in the set language",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28753729,
    "title": "R5065A - Application supports HD resolutions",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5065",
    "created_by": 349,
    "created_on": 1655831348,
    "updated_by": 349,
    "updated_on": 1655831694,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 14,
    "custom_is_automated": null,
    "custom_preconds": "**Graphical User Interface**\r\n\r\n**R5065 Requirement:** In HD resolution, confirm that visibility required to use the application and play the game is maintained. Moreover, check that application progress is possible regardless of the video output format. Also confirm the visibility at HD resolutions for the essential items described in R5030.",
    "custom_steps": "1. Press the up button on the home screen.\r\n2. Confirm that \"Settings\" > \"Screen and Video\" > \"Video Output\" > \"Resolution\" is set to one of the resolutions to check (\"720p\", \"1080i\", \"1080p\", or \"2160p).\r\n3. Go back to the home screen and select the \"Application\".\r\n4. Check throughout the entire application.\r\n\r\n**Notes:**\r\n- Check with all resolutions in step (4), however when testing 1080 only test \"1080i\" or \"1080p\".\r\n- In particular, be sure to check full motion video/full motion animation.",
    "custom_expected": "- The application can be started in all supported HD resolutions.\r\n- Visibility necessary to use the application and perform gameplay is maintained throughout.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28754233,
    "title": "R5033J - The application does not freeze or become inoperable when a network error occurs",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PS5TV-72, R5033",
    "created_by": 349,
    "created_on": 1655832382,
    "updated_by": 349,
    "updated_on": 1662127897,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 15,
    "custom_is_automated": null,
    "custom_preconds": "**Network**\r\n\r\n**R5033 Premise:** If network features are used\r\n\r\n**R5033 Requirement:** The application does not freeze, user cancel operations are not blocked, and the application does not otherwise become inoperable from the effects of communication errors or another client's actions.",
    "custom_steps": "1. Sign into PlayStation™Network\r\n2. Disconnect from the network to cause a network error\r\n3. Select the \"Application\" on the home screen\r\n4. Proceed to a point that uses the network features and attempt to start the network features\r\n\r\n**Notes:**\r\n- Check at all points where network features are used. This includes non-gameplay features such as leaderboards, SNS features, where information is displayed only when connected to a network (for example, news ticker, update information) etc.\r\n- For methods to disconnect from the network in step (2), refer to the following.\r\n---- When connected to a Wi-Fi network, turn off the power of the wireless router or unplug the WAN-side LAN cable from the wireless router.\r\n---- When using a wired LAN connection, remove the LAN cable connected to the PlayStation®5 console.\r\n---- Select \"Settings\" on the System View > \"Network\" > \"Settings\" and disable \"Connect to the Internet\".\r\n---- Select \"Settings\" on the System View > \"Users and Accounts\" > \"Other\" > \"Sign Out\".",
    "custom_expected": "The application does not freeze or otherwise become inoperable when attempting to use network features in a state where there is a network error",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28754235,
    "title": "R5034A - Display a message when a network error occurs",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PS5TV-72, R5034",
    "created_by": 349,
    "created_on": 1655833145,
    "updated_by": 349,
    "updated_on": 1662127915,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 16,
    "custom_is_automated": null,
    "custom_preconds": "**Network**\r\n\r\n**R5034 Premise:** If network features are used\r\n\r\n**R5034 Requirement:** When a network error occurs, the application displays a message appropriate to the network error that occurred.\r\n\r\n**Description**\r\nWhen a network error occurs, notify the user with a message indicating the occurrence of the error such as, \"A network error occurred\". In addition to the error notification, it is recommended that the user is notified of the cause of the error and how to address the error. The appropriateness of this information is outside the scope of the requirement, however, it will be a violation of this requirement if a clearly incorrect message is displayed - for example, a message describing the cause of the error to be restrictions of social features when the real cause is a network disconnection.\r\n\r\nThis requirement excludes situations when a network error occurs upon an application suspend/resume, but the network communication can be restored and game progress can be resumed immediately.\r\n\r\nIf there is a game interruption due to an error code generated from the system or library, calling the error dialog is recommended. The appropriate message and/or error handling will be displayed according to the error code.\r\n\r\n**QA NOTE**\r\n- Check at all points where the application uses network features.\r\n- This requirement only applies when a communication error occurs during usage of network features and not when starting network features while disconnected from the network.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Proceed to a point that uses network features\r\n3. Disconnect from the network to cause a communication error\r\n\r\n**Notes:**\r\nConfirm by disconnecting from the network with the following methods.\r\n- When connected to a Wi-Fi network, turn off the power of the wireless router or unplug the WAN-side LAN cable from the wireless router.\r\n- When using a wired LAN connection, remove the LAN cable connected to the PlayStation®5 console.\r\n- Press and hold the PS button to return to the home screen > press the up button > select \"Settings\" > \"Network\" > \"Settings\" and disable \"Connect to the Internet\".",
    "custom_expected": "When a communication error occurs, a message is displayed stating that a network error occurred",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28758941,
    "title": "R5068A - Audio outputs when set to 2ch LPCM",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5068",
    "created_by": 349,
    "created_on": 1655911256,
    "updated_by": 349,
    "updated_on": 1655911376,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 17,
    "custom_is_automated": null,
    "custom_preconds": "**Audio**\r\n\r\n**R5068 Requirement:** 2ch linear PCM output is supported, and it has been confirmed that audio is output in all of the supported audio formats.",
    "custom_steps": "1. On the home screen, set \"★Debug Settings\" > \"Sound and Screen\" > \"Audio Output Format\" to \"LPCM 2ch\"\r\n2. Go back to the home screen and select the \"Application\"\r\n3. Check throughout the entire application",
    "custom_expected": "2ch LPCM output is supported and the user can hear audio",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28758942,
    "title": "R5162A - Audio is played back for different Audio Output Format settings",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5162",
    "created_by": 349,
    "created_on": 1655911411,
    "updated_by": 349,
    "updated_on": 1655915575,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 18,
    "custom_is_automated": null,
    "custom_preconds": "**Audio**\r\n\r\n**R5162 Requirement:** The application’s audio output works correctly even if the system software audio output format and/or audio output attributes are modified.",
    "custom_steps": "1. To confirm \"Audio Output Format\", on the home screen, set \"★Debug Settings\" > \"Sound and Screen\" > \"Audio Output Format\" to \"LPCM 2ch\"\r\n2. Return to the home screen\r\n3. Select the \"Application\" and check that the application's audio is played\r\n4. Close the \"Application\"\r\n5. Repeat steps (1) to (4) for each of the following settings\r\n- \"LPCM 5.1ch\"\r\n- \"LPCM 7.1ch\"\r\n- \"LPCM 2ch (TV Virtual Surround)\"\r\n6. To confirm headphones, on the home screen, set \"★Debug Settings\" > \"Sound and Screen\" > \"Audio Output Format\" to \"Auto\"\r\n7. Connect headphones to the headphone jack of the wireless controller for PlayStation®5\r\n8. Return to the home screen, set \"Settings\" > \"Sound\" > \"Audio Output\" > \"Output to Headphones\" to \"All Audio\" and enable \"Enable 3D Audio for Headphones\"\r\n9. Return to the home screen\r\n10. Select the \"Application\" and check that the application's audio is played\r\n\r\n**Notes:**\r\nRegardless of application support/lack of support, confirm that audio is played in all audio output formats (2ch/5.1ch/7.1ch/2ch(TV Virtual Surround)) and when headphones are connected.",
    "custom_expected": "Audio is played back regardless of the \"Audio Output Format\" setting\r\nAudio is played back even when headphones are connected",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28759562,
    "title": "R5037A - No references are made to Sony or Playstation",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5037",
    "created_by": 349,
    "created_on": 1655926827,
    "updated_by": 349,
    "updated_on": 1655926939,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 19,
    "custom_is_automated": null,
    "custom_preconds": "**Intellectual Property**\r\n\r\n**R5037 Requirement:** The four-letter SONY logo, PlayStation® related logos, and the SIE corporate logo are not used in the application except in the following cases.\r\n- Line drawing, newly-created illustration, or photo image provided by SIE is used pursuant to R5038\r\n- The SIE trademark notices are displayed pursuant to R5039\r\n- The combination of the PlayStation™Store logo and the PlayStation™Store icon is displayed pursuant to R5051\r\n- Promotional videos related to PlayStation® platform titles\r\n\r\n**Note:** The MLB app makes no references to, or mentions Sony/Playstation in any form or fashion.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Check throughout the entire application",
    "custom_expected": "The SIE corporate logo is not used.\r\n\r\nThe four-letter SONY logo and PlayStation® related logos are not used on anything except SIE-provided line drawings of systems/peripherals, photo images, and when displaying the PlayStation™Store icon.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763669,
    "title": "R5005A - Age level for Boot Restriction is set",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5005",
    "created_by": 349,
    "created_on": 1655993677,
    "updated_by": 349,
    "updated_on": 1655993762,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 20,
    "custom_is_automated": null,
    "custom_preconds": "**Parental Control and Content Restriction**\r\n\r\n**R5005 Requirement:** The Age Level for Boot Restriction is correctly specified in the parameter file (param.json) based on obtained/expected rating.",
    "custom_steps": "1. Place the cursor on the \"Application\" on the home screen\r\n2. Press the options button and select \"★Check\"\r\n3. Check the value of \"param.json: Age Level=\" in [Log #000 (original app)]",
    "custom_expected": "The lowest age is correctly set for application launch in the application's target license area.\r\n\r\nFor the MLB app, I believe this should be \"0\"",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763681,
    "title": "R5023A - Application runs after app version is updated",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5023",
    "created_by": 349,
    "created_on": 1656010369,
    "updated_by": 349,
    "updated_on": 1656010454,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 21,
    "custom_is_automated": null,
    "custom_preconds": "**Compatibility**\r\n\r\n**R5023 Requirement:** The application runs correctly in all possible combinations and orders of previously QA approved packages and the package to be submitted\r\n\r\n**Description:** Before submitting the current package, check that the application runs correctly in all possible combinations of previously QA passed application packages and additional contents.",
    "custom_steps": "1. Place the cursor on the \"Application\" on the home screen\r\n2. Press the options button and select \"★Check\"\r\n3. Confirm the value of \"param.json Content Version = \" is larger than 01.000.000 in [Log #000 (original app)]\r\n4. Go back to the home screen, then select the \"Application\"\r\n5. Check throughout the entire application",
    "custom_expected": "The application runs correctly when installing an application package with an application version (contentVersion) greater than 01.000.000 without prior installation of the 01.000.000 version package.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763682,
    "title": "R5023D - Application runs after installation",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5023",
    "created_by": 349,
    "created_on": 1656010489,
    "updated_by": 349,
    "updated_on": 1656010544,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 22,
    "custom_is_automated": null,
    "custom_preconds": "**Compatibility**\r\n\r\n**R5023 Requirement:** The application runs correctly in all possible combinations and orders of previously QA approved packages and the package to be submitted\r\n\r\n**Description:** Before submitting the current package, check that the application runs correctly in all possible combinations of previously QA passed application packages and additional contents.",
    "custom_steps": "1. On the home screen, select \"★Debug Settings\" > \"Game\" > \"Package Installer\" and install all additional content and the latest application\r\n2. Go back to the home screen, then select the \"Application\"\r\n3. Check throughout the entire application",
    "custom_expected": "The application runs when installing the latest application after all additional content that has been released (including the latest) has been installed.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763683,
    "title": "R5024A - Application runs with Slow SSD Mode ON",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5024",
    "created_by": 349,
    "created_on": 1656011137,
    "updated_by": 349,
    "updated_on": 1656011200,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 23,
    "custom_is_automated": null,
    "custom_preconds": "**Compatibility**\r\n\r\n**R5024 Requirement:** When setting \"★Debug Settings\" > \"Game\" > \"Slow SSD Mode\" to \"On\", the application behaves the same way as when the option is set to \"Off\".",
    "custom_steps": "1. Select the \"Application\"\r\n2. Check the performance in the application\r\n\r\n**QA NOTE:**\r\nPlease also check the state where set \"★Debug Settings\" >\"Game\" > \"Slow SSD Mode\" to \"Off\"\r\nPay particular attention to the following locations.\r\n- Locations where streaming playback is performed.\r\n- Locations with a high operation load such as when many characters are active on screen.",
    "custom_expected": "Performance issues, such as the following, do not occur due to \"Slow SSD Mode\" being set to \"On\":\r\n- Any processing delays (including video and audio).\r\n- The application freezes or otherwise becomes inoperable.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763684,
    "title": "R5083A - Verify SDK version",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5083",
    "created_by": 349,
    "created_on": 1656011815,
    "updated_by": 349,
    "updated_on": 1656011989,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 24,
    "custom_is_automated": null,
    "custom_preconds": "**Security**\r\n\r\n**R5083 Requirement:** Runtime libraries used by the application are included in the SDK available for submission to GFQA.\r\n\r\nAcceptable Versions for Submission - https://p.siedev.net/docs/master_submission/",
    "custom_steps": "1. Place the cursor on the \"Application\" on the home screen, press the options button, and then select \"★Check\"\r\n2. Check the value of \"param.json: SDK Version=\"\r\n3. Confirm the SDK versions listed on the Acceptable Versions for Submission page.",
    "custom_expected": "The application's SDK version matches the SDK version indicated by SIE.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763685,
    "title": "R5026A - Verify SIE-licensed peripherals work as expected",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5026",
    "created_by": 349,
    "created_on": 1656014096,
    "updated_by": 349,
    "updated_on": 1656014184,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 25,
    "custom_is_automated": null,
    "custom_preconds": "**Peripheral Devices**\r\n\r\n**R5026 Requirement:**\r\nThe application runs correctly when any supported SIE-licensed peripheral is:\r\n- already connected on boot\r\n- connected or disconnected while the application is running\r\n\r\n**Description:**\r\nConnecting or disconnecting SIE-licensed peripherals that are supported by the application must not cause the application to malfunction.\r\n\r\nIf a non-SIE-licensed peripheral (the use of which has been previously approved by SIE) is required, SIE may request provision of the peripheral upon master submission.\r\n\r\n**QA NOTE:**\r\nPeripherals to be tested by GFQA are as follows. Only peripherals that are supported by the application are used for testing.\r\n- Wireless controller for PlayStation®5",
    "custom_steps": "For each peripheral device:\r\n1. Connect the peripheral\r\n2. Select the \"Application\" on the home screen\r\n3. Proceed to where the peripheral will be used and use it\r\n4. Disconnect the peripheral\r\n5. Reconnect the peripheral\r\n\r\n**Notes**\r\nPerform this test at various points in each application mode, the options screen, and any screens that display messages.",
    "custom_expected": "The peripheral to be tested can be used.\r\nWhen connecting and disconnecting the peripheral, the application does not freeze or otherwise become inoperable.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28763686,
    "title": "R5071A - The shake test",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5071",
    "created_by": 349,
    "created_on": 1656014635,
    "updated_by": 349,
    "updated_on": 1656014690,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 26,
    "custom_is_automated": null,
    "custom_preconds": "**Peripheral Devices**\r\n\r\n**R5071 Requirement:**\r\nThe application does not instruct or ask the user to vigorously shake the controller with one hand.",
    "custom_steps": "1. Select the \"Application\" on the home screen\r\n2. Check throughout the entire application\r\n\r\n**Notes:**\r\nPay particular attention when motion sensor features are being used.",
    "custom_expected": "Users are not requested or instructed to vigorously shake the wireless controller for PlayStation®5 with one hand.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28730598,
    "title": "N/A - R5096F - The application does not crash when there is insufficient free space for save data",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 349,
    "created_on": 1655480372,
    "updated_by": 349,
    "updated_on": 1684338698,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 27,
    "custom_is_automated": null,
    "custom_preconds": "**NOTE:** The PS5 app doesn't use saved data on the kit.\r\n\r\n**Save Data/Download Data**\r\n\r\n**R5096 Requirement:** When there is insufficient space to create or update save data, the following are fulfilled.\r\n-- Allow the user to retry the saving process\r\n-- The user is not required to restart the application to enable saving\r\n-- The application calls sceSaveDataDialogOpen() using the values specified in the table in the Description section below\r\n\r\n**Description**\r\n**Cannot be saved**\r\nIf saving could not be performed due to insufficient space or another reason, allow the user to retry the saving process. The application can either allow the user to retry immediately or delay retrying until the user progresses to the next saving point. (Infinite loops, aside from situations related to insufficient space, are not recommended)\r\n\r\nSaving must not be disabled throughout the application after the process has been interrupted; whether the application utilizes an autosave feature or a user initiated save feature.\r\n\r\nIf an error occurs during saving of the save data, it is possible to display the type of error to the user by using the error code display mode of Save Data Dialog.\r\n\r\n**Cannot save due to insufficient free space**\r\nWhen there is insufficient free space to mount save data directories, sceSaveDataMount3() will return SCE_SAVE_DATA_ERROR_NO_SPACE_FS. When this occurs, the sceSaveDataDialogOpen() needs to be called as detailed below:\r\n\r\n|||Arguments|Value to specify\r\n||SceSaveDataDialogParam.mode|SCE_SAVE_DATA_DIALOG_MODE_SYSTEM_MSG\r\n||SceSaveDataDialogParam.dispType|SCE_SAVE_DATA_DIALOG_TYPE_SAVE\r\n||SceSaveDataDialogParam.sysMsgParam->sysMsgType|SCE_SAVE_DATA_DIALOG_SYSMSG_TYPE_NOSPACE or SCE_SAVE_DATA_DIALOG_SYSMSG_TYPE_NOSPACE_CONTINUABLE\r\n\r\nAfter displaying the system defined message, when free space is not available, the application can either allow game progress, or block it until the user frees the necessary space.\r\n\r\nSave data memory processing is not relevant to this requirement. However, for applications that use both save data memory and normal save data, ensure the normal save data complies with this requirement because insufficient free space is occurred for the normal save data.",
    "custom_steps": "1. Press the up button on the home screen\r\n2. Select \"Settings\" > \"Saved Data and Game/Apps Settings\" > \"Saved Data (PS5)\" > \"Console Storage\" > \"Delete\", and check that the save data for the corresponding application has not been created\r\n3. Return to the home screen and set \"★Debug Settings\" > \"Game\" > \"SaveData\" > \"Fake Free Space\" to \"On\"\r\n4. Go back to the home screen, then select the \"Application\"\r\n5. Proceed to a save point and attempt to create save data\r\n\r\n**Notes**\r\nAlso check when overwriting existing save data.\r\nIt is permissible to display a system defined message until insufficient free space is resolved.",
    "custom_expected": "1. If a save fails due to insufficient free space, the application recovers to a state where the save can be attempted again without losing any progress information.\r\n2. When save data mounting fails due to insufficient free space, one of the following system messages is displayed.\r\n\r\n[T-003][Info]\r\nSaveDataDialog:\r\nSystem Message - NOSPACE\r\n\r\n[T-003][Info]\r\nSaveDataDialog:\r\nSystem Message - NOSPACE_CONTINUABLE",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 28730599,
    "title": "N/A - R5100B - The total save data doesn't exceed 1GB",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "R5100",
    "created_by": 349,
    "created_on": 1655484285,
    "updated_by": 349,
    "updated_on": 1684338698,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 28,
    "custom_is_automated": null,
    "custom_preconds": "**NOTE:** The PS5 app doesn't use saved data on the kit.\r\n\r\n**Save Data/Download  Data**\r\n\r\n**R5100 Requirement:** The total save data size used by the application is 1 GiB or less per user\r\n\r\n**Description**\r\nThe backup data size for save data and size of the save data system area are not included in the save data size.\r\nRefer to the SaveData Library Overview document regarding size of the save data system area.",
    "custom_steps": "1. Select \"Application\" on the home screen\r\n2. Create all save data that can be created by the application\r\n3. Go back to the home screen, then press the up button\r\n4. Select \"Settings\" > \"Saved Data and Games/Apps Settings\" > \"Saved Data (PS5)\" > \"Console Storage\" > \"Delete\" > the applicable application and press options button\r\n5. Check the value of XXXX of \"★Size XXXXMB\" in \"★Information\"",
    "custom_expected": "The total save data size per user is \"1.08 GB\" or less.",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  },
  {
    "id": 30929572,
    "title": "PS5 Media Remote Control",
    "section_id": 1521279,
    "template_id": 1,
    "type_id": 7,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PS5TV-542",
    "created_by": 349,
    "created_on": 1688066013,
    "updated_by": 349,
    "updated_on": 1688145510,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 522057,
    "display_order": 29,
    "custom_is_automated": null,
    "custom_preconds": "GIVEN a user is using a PS5 media remote instead of a game controller",
    "custom_steps": "WHEN the user uses the remote to interact with the app",
    "custom_expected": "THEN the Play/Pause button pauses video playback\r\nAND the Play/Pause button resumes video playback\r\nAND the FF button initiates FF\r\nAND the RW button initiates RW\r\nAND the Return button functions as \"Go Back\"\r\nAND the top navigation button navigates the user up\r\nAND the bottom navigation button navigates the user down\r\nAND the left navigation button navigates the user to the left\r\nAND the right navigation button navigates the user to the right\r\nAND the center navigation button functions as select\r\nAND the center navigation button functions as play/pause during video playback",
    "custom_steps_separated": null,
    "custom_feature_tag": null
  }
]