[
  {
    "id": 203601,
    "title": "As BOC, I want player to get service if he was DFA from a service accruing status",
    "section_id": 28417,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768125",
    "created_by": 99,
    "created_on": 1471874004,
    "updated_by": 99,
    "updated_on": 1471894847,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 2,
    "custom_preconds": "GIVEN that user is running the MJ Services batch",
    "custom_steps": "WHEN considering the service accruing status \"DFA\" to give player service",
    "custom_expected": "THEN check the player's previous Roster status before becoming DFA.\r\nAND Only give service to the player for each day he was DFA if the previous roster status was a service accruing status. If his previous roster status was not service accruing, the player does not qualify for service for the days he was DFA unless he has another service accruing roster status on that day",
    "custom_steps_separated": null
  },
  {
    "id": 203602,
    "title": "As BOC, I want a player who was traded to get service with his destination club",
    "section_id": 28417,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768195",
    "created_by": 99,
    "created_on": 1471874004,
    "updated_by": 99,
    "updated_on": 1471894847,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 3,
    "custom_preconds": "GIVEN that user is running the MJ Service Batch",
    "custom_steps": "WHEN a player that was traded is run through the batch",
    "custom_expected": "THEN on days where the player was part of Multiple Orgs in the same day (eg. during a trade), check if player had a service accruing roster status after the Org Change. If so then the credit for that Service day goes to the \"to\" Org.\r\nAND if player did not have a roster accruing status after the Org change but had a roster accruing status before the Org change, then the credit goes to the \"From\" org.",
    "custom_steps_separated": null
  },
  {
    "id": 212210,
    "title": "As BOC, I want to give players a day of service when he has a service accruing roster status",
    "section_id": 29500,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120766131, 121619895",
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN - The Major League Service Batch is run in Test and Update mode\r\n\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN on the population of players identified in #121619895 (Link in References, [test case C196243](http://10.4.36.21/testrail/index.php?/cases/edit/196243)), the batch should calculate \"Current Season Service\" in days.\r\nAND The current season begins with Opening Day (System date) until current day or Last day of season (system date), whichever is earlier.\r\nAND For each day of the season, including the first and last day, if the player had a roster accruing status at any point during the day, he gets one day of service for that day. \r\nAND The \"Current Season Service\" days is the number of days he has gotten service in the current season including today (day batch is run) if applicable\r\nAND Once the batch has been run, update the \"Current Season Service\" field on the player profile with the updated value in days. Eg. 62 days\r\n\r\nAND all global batch AC are followed:\r\n- Batch can be aborted\r\n- Show progress bar when processing\r\n- Any errors are returned in results\r\n- Previous batch results can be viewed\r\n- Batch can be run in Test mode where the batch changes can be reversed\r\n- Batch can be run in Update mode where they are actually changed",
    "custom_steps_separated": null
  },
  {
    "id": 212211,
    "title": "As BOC, I do not want a player to get service credit for more than 172 days per season",
    "section_id": 29500,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121621109",
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "WHEN user runs the MJ Service Batch\r\n",
    "custom_expected": "THEN Current Service service cannot exceed 172 days per season. \r\nAND Once the player reaches 172 days, player no longer gets a day of service for the current season",
    "custom_steps_separated": null
  },
  {
    "id": 212212,
    "title": "As BOC, I want to see a player's total MLS",
    "section_id": 29500,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121621195",
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "WHEN the user runs the MJ Service Batch",
    "custom_expected": "THEN Using the \"Current Season Service\" value, update the player's Total MLS on the service tab on his player profile and the player header.\r\nAND To get the total MLS, add the Current season MLS to Prior season MLS.\r\nAND Major League Service is displayed as \"XX.YYY\"; \"X\" is the full season year while \"YYY\" is the number of days in the current season. A player earns a full season by accruing 172 days of Major League Service.  For example, \"1.105\" means that a player have  one full year (172 days) plus 105 days of Major League Service.\r\nAND XX will increment once YYY reaches 171.  For example, if a player is at 1.171, the next value would be 2.000.",
    "custom_steps_separated": null
  },
  {
    "id": 212213,
    "title": "I want to see MLS in the profile header for players who have not played in at least two seasons",
    "section_id": 29500,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 212208,
    "title": "As BOC, I want to see a yearly summary of MJ Service on the player's profile from ebis 1",
    "section_id": 29501,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768541",
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN user views a player's service tab on their profile",
    "custom_expected": "THEN the Major League Summary section appears as a collapsible section to the page. It should be expanded by default. http://ll2j6l.axshare.com/#p=service\r\nAND Bring over all Service history from ebis 1 and display in this section.\r\nAND When player has played for multiple Orgs in the same year, each Org has it's own row for that year.\r\nAND Note that in ebis 1, Adjustments was split up into Option days, strike days and Misc days. In Ebis 2, this is combined into one adjustments field which is the sum of the 3 values in ebis 1\r\n- Any comments entered in ebis 1 should show in bubble format in ebis 2",
    "custom_steps_separated": null
  },
  {
    "id": 212209,
    "title": "As Club/BOC, I do not want to see MJ service section for players who have never played in the MJ leagues",
    "section_id": 29501,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121994693",
    "created_by": 126,
    "created_on": 1473713983,
    "updated_by": 126,
    "updated_on": 1473713983,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3128,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "WHEN viewing a player's stats tab",
    "custom_expected": "THEN if player has never played in the Major leagues, hide the following sections on the Service tab\r\nService Info\r\n- Major League Service \r\n- Milestones section",
    "custom_steps_separated": null
  }
]