[
  {
    "id": 851929,
    "title": "As a user I want to be able to view a player's Investigation History",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390543",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487109304,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 2,
    "custom_preconds": "GIVEN the user is in Player's profile\r\n",
    "custom_steps": "WHEN user selects \"Contracts\" tab of a player profile",
    "custom_expected": "THEN Investigation History widget will appear beneath the Contract History, and follows the provided wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 851932,
    "title": "Investigation History - Permissions",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390755",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1488828514,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 5,
    "custom_preconds": "GIVEN a CLUB or a BOC user has limited Investigation Permission\r\n(test_boc_approver@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com, Test-NYY-admin@mlb.com, Test-NYY-viewer@mlb.com, and test-basic-stl@mlb.com)\r\n",
    "custom_steps": "WHEN the user is in a players profile under 'Contracts' tab\r\n\r\n\r\n",
    "custom_expected": "THEN user should only be able to view what they have permission to. ",
    "custom_steps_separated": null
  },
  {
    "id": 851933,
    "title": "As a user I want to be able to search for Investigations",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250111",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487175663,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 6,
    "custom_preconds": "GIVEN the user is in advance search tab",
    "custom_steps": "WHEN user select 'Investigation' under Advanced Search\r\n\r\n",
    "custom_expected": "THEN the available filters should match the requirements. \r\nAND the columns displayed should match the requirements. \r\nAND The \"Date\" column should be hyperlink to the Investigation form for BOC users only.",
    "custom_steps_separated": null
  },
  {
    "id": 851934,
    "title": "Investigations Search - Permissions",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139251803",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487708926,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 7,
    "custom_preconds": "GIVEN a CLUB or BOC user with/without Investigation permission logs in",
    "custom_steps": "WHEN user is in advance search\r\n",
    "custom_expected": "THEN only users that have Investigations permissions should see \"Investigations\" as an option in advanced search. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 851935,
    "title": "As a Club user I want to create a new Investigation Request",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512519",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487177531,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 8,
    "custom_preconds": "GIVEN a Club user wants to create a new investigation request for International Amateur players or Professional players",
    "custom_steps": "WHEN user selects \"Investigation Request\" option in the Create New top-level menu for Club users on International Amateur players or Professional players\r\n\r\n",
    "custom_expected": "THEN system will launch a new Investigation Request for the player. \r\nAND the form will follow the wireframe and data discovery.\r\nAND Investigation Type is defaulted based on whether or not the Club submitting the request has a submitted contract for the player. If there is a Terms Submitted or higher contract for the player from the submitting Club, then the default is \"Contract\". Otherwise it is \"Pre-Contract\".",
    "custom_steps_separated": null
  },
  {
    "id": 851937,
    "title": "As a Club user I want to be able to save an Investigation Request",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139511133",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487187044,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 10,
    "custom_preconds": "GIVEN a Club user logs into the system ",
    "custom_steps": "WHEN Club creates or opens an Investigation Request form in Edit mode\r\n\r\n",
    "custom_expected": "THEN\r\n\r\nSAVE\r\n* A Save button will be available anytime the form is in edit mode. \r\n* Clicking Save will save the form and its current values and reload the form in view mode. \r\n* The request's status will be set to \"Preliminary\" if this is the first time the request is being saved. Otherwise the status will not change.  \r\n* After a successful save the system will display a successful save blue notification. \r\n\r\nCANCEL\r\n* Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \r\n* Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\n* If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\n* If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\n* If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 851939,
    "title": "As a BOC user I want to receive an approvals item for a submitted Investigation Request",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139595277",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1488395620,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 12,
    "custom_preconds": "GIVEN an Investigation Request has been Submitted by Club",
    "custom_steps": "WHEN BOC checks the BOC - Investigations - Admin's Approvals widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN an approval item will be generated and displayed in the widget\r\nAND The files attached are displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated, they display in the Comments column of the Approvals widget.\r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink.\r\nAND Clicking on the type hyperlink will open the submitted request in view mode in the same window/tab. \r\nAND This Approvals item should display under the \"Micellaneous\" filter in the approvals widget.",
    "custom_steps_separated": null
  },
  {
    "id": 851940,
    "title": "As a user I want to be able to delete an Investigation Request",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512675",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487189615,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 13,
    "custom_preconds": "GIVEN the user has edit permissions for the form in Preliminary states",
    "custom_steps": "WHEN user clicks on 'Delete' button(Grey) on the Investigation Request form in view or edit mode\r\n\r\n",
    "custom_expected": "THEN system will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? \r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown confirming the deletion.\r\nOr If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted requests should not appear on the front end or be searchable.",
    "custom_steps_separated": null
  },
  {
    "id": 851947,
    "title": "As a Club user I want to be prevented from creating a request for a player I do not have permission to request an inviestigation for",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515725",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487260535,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 20,
    "custom_preconds": "GIVEN A club user is viewing different org's player profile ",
    "custom_steps": "WHEN Club Selects \"Investigation Request\" for that player\r\n\r\n",
    "custom_expected": "THEN system will know player is currently under contract with a different Org, then an error will display. \r\n**Error Message:**\r\nThis player is currently under contract with another Organization. You may not request an investigation for this player. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 851949,
    "title": "As a Club user I want to be prevented from creating a request for a player my org has a current pending request for",
    "section_id": 102946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515901",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 136,
    "updated_on": 1487263362,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 15765,
    "display_order": 22,
    "custom_preconds": "GIVEN the Club's ORG already has a current pending Investigation request for a player in a Preliminary, Submitted or Update Needed state",
    "custom_steps": "WHEN Club attempts to create a new request for the player \r\nAND selects \"Investigation Request\" \r\n\r\n",
    "custom_expected": "THEN an error will display. \r\n**Error Message:** \r\nYour Organization already has a Preliminary or Submitted request for this player. You may not submit another request until the existing request has been reviewed. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  }
]