[
  {
    "id": 649343,
    "title": "User wants to generate a blank Notice to Player of UR and Termination of Major League contract letter",
    "section_id": 79110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132338373",
    "created_by": 75,
    "created_on": 1479140862,
    "updated_by": 103,
    "updated_on": 1479756573,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as club or BOC\r\nAND \"Notice to Player of UR and Termination of Major League Contract\" appears as an option in the Reporting widget under the Type \"Blank Letters\". ",
    "custom_steps": "WHEN user selects \"Notice to Player of UR and Termination of Major League Contract\"\r\n",
    "custom_expected": "THEN system should print proper PDF of the letter\r\nAND users should have the ability to choose whether to print the letter in English or Spanish. \r\nAND form should be generated in English if the language selected is English.\r\nAND form should be generated in Spanish if the language selected is Spanish. \r\nAND PDF should follow the provided format and details.",
    "custom_steps_separated": null
  },
  {
    "id": 649345,
    "title": "User wants to generate a Notice of Unconditional Release Waivers letter for a player",
    "section_id": 79110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132210973",
    "created_by": 75,
    "created_on": 1479140862,
    "updated_by": 103,
    "updated_on": 1479756573,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 2,
    "custom_preconds": "GIVEN \"Notice of Unconditional Release Waivers\" appears as an option in the Create New menu for players under \"Player Letters\". \r\nAND user is logged in as club or BOC",
    "custom_steps": "WHEN user selects \"Notice of Unconditional Release Waivers\" from the Create New menu for players under \"Player Letters",
    "custom_expected": "THEN system should print the proper pdf of the letter using the proper information from the player's profile.\r\nAND users should have the ability to alter the Date used for the form. (Should be pre-populated with current date)\r\nAND users should have the ability to alter the player's name as it will appear on the form. (Should be pre-populated with player's First Last)\r\nAND users should have the ability to enter the Waiver Expiration Date to be populated on the form. \r\nAND users should have the ability to enter the Request Date to be populated on the form. \r\nAND users should have the ability to enter the Office Number to be populated on the form. \r\nAND form should be generated in English if the language on the player's profile is set to anything other than Spanish. \r\nAND form should be generated in Spanish if the language on the player's profile is set to Spanish. \r\nAND pdf should follow the provided format and details.",
    "custom_steps_separated": null
  },
  {
    "id": 649346,
    "title": "User wants to generate a blank Notice of Unconditional Release Waivers letter",
    "section_id": 79110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132338405",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756573,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 3,
    "custom_preconds": "GIVEN \"Notice of Unconditional Release Waivers\" appears as an option in the Reporting widget under the Type \"Blank Letters\"\r\nAND user is logged in as club or BOC",
    "custom_steps": "WHEN user selects \"Notice of Unconditional Release Waivers\" option ",
    "custom_expected": "THEN system should print the proper pdf of the letter\r\nAND users should have the ability to choose whether to print the letter in English or Spanish. \r\nAND form should be generated in English if the language selected is English.\r\nAND form should be generated in Spanish if the language selected is Spanish. \r\nAND pdf should follow the provided format and details.",
    "custom_steps_separated": null
  },
  {
    "id": 649347,
    "title": "User wants to generate a blank Notice to Player of Intention of Unconditional Release letter",
    "section_id": 79110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132338399",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756573,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 4,
    "custom_preconds": "GIVEN \"Notice to Player of Intention of Unconditional Release\" appears as an option in the Reporting widget under the Type \"Blank Letters\"\r\nAND user is logged in as club or BOC",
    "custom_steps": "WHEN user selects \"Notice to Player of Intention of Unconditional Release\" option ",
    "custom_expected": "THEN system should print the proper pdf of the letter.\r\nAND users should have the ability to choose whether to print the letter in English or Spanish. \r\nAND form should be generated in English if the language selected is English.\r\nAND form should be generated in Spanish if the language selected is Spanish. \r\nAND pdf should follow the provided format and details.",
    "custom_steps_separated": null
  },
  {
    "id": 612374,
    "title": "Club user wants to print PDF of Results Bulletin",
    "section_id": 79110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131379927",
    "created_by": 103,
    "created_on": 1477318341,
    "updated_by": 103,
    "updated_on": 1479141652,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 7,
    "custom_preconds": "GIVEN a club user is logged in with waivers permissions\r\nAND user has navigated to waivers screen\r\nAND user has selected a request date for which the results bulletin has already been sent \r\nAND a Print button is displayed",
    "custom_steps": "WHEN user clicks the Print button",
    "custom_expected": "THEN user should be able to select \"Result Bulletin\" from the options available\r\nAND selecting Result Bulletin should download a pdf of that day's Result Bulletin for the viewing Org to the user's computer\r\nBUT If no Requests exist for the date then no Print button should display",
    "custom_steps_separated": null
  },
  {
    "id": 612375,
    "title": "Club user wants PDF of Results Bulletin attached to email",
    "section_id": 79111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131379917",
    "created_by": 103,
    "created_on": 1477318388,
    "updated_by": 103,
    "updated_on": 1479141652,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is logged in\r\nAND user has entered a valid email address in the Email Utility to receive waiver Results bulletin emails ",
    "custom_steps": "WHEN Waiver Results bulletin is sent for the first time or resent",
    "custom_expected": "THEN emails received by the club should have the pdf of the day's bulletin attached\r\nBUT if no entries exist, then no attachment should be provided",
    "custom_steps_separated": null
  },
  {
    "id": 612376,
    "title": "Club user wants PDF of Results Bulletin attached to notification",
    "section_id": 79111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "131379913",
    "created_by": 103,
    "created_on": 1477318577,
    "updated_by": 103,
    "updated_on": 1479141652,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in\r\nAND user is viewing their club's notifications widget ",
    "custom_steps": "WHEN Waiver Results bulletin is sent for the first time or resent",
    "custom_expected": "THEN description of the notification generated by the sending of the results bulletin or the resending of notifications should be clickable\r\nAND clicking on the description should download the associated pdf of the results bulletin",
    "custom_steps_separated": null
  },
  {
    "id": 612386,
    "title": "BOC user doesn't want to see certain buttons for player in Results table",
    "section_id": 79111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "129378967",
    "created_by": 103,
    "created_on": 1477319198,
    "updated_by": 103,
    "updated_on": 1479756718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in \r\nAND user has navigated to Waivers screen\r\nAND user has selected a request date for which Results Bulletin has been sent ",
    "custom_steps": "WHEN user views the Claims/Results section ",
    "custom_expected": "THEN If Waivers have been cancelled for a player, then no button should display\r\nAND if BOC can only Cancel waivers for the player, then a simple \"Cancel\" button should be displayed\r\nAND if BOC can create a player notification, then a split button should be available with \"Player Notif.\", and \"Cancel\" available. (requested UR waivers that were not Claimed and not Cancelled)\r\nAND if BOC can Player Accept or Player Reject, then a split button should be available with \"Player Notif.\", \"Player Accept\", \"Player Reject\" and \"Cancel\" available. (requested UR waivers that were Claimed and not Cancelled for which a waiver claim assignment has not yet been created.)\r\nAND once \"Player Accept\" or \"Player Reject\" has been selected for a player, BOTH of these options should no longer display for that player\r\nAND if BOC can Create a Waiver Claim for a player, then a split button should be available with \"Create Waiver Claim\" and \"Cancel\" available. (request is awarded AND it is revocable AND we are before the withdrawal expiration date)",
    "custom_steps_separated": null
  },
  {
    "id": 612384,
    "title": "User wants to create Waiver Claim Assignment",
    "section_id": 79113,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "119045465",
    "created_by": 103,
    "created_on": 1477319112,
    "updated_by": 103,
    "updated_on": 1479141652,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as club or BOC\r\nAND user has navigated to waivers screen\r\nAND user has selected a request date for which results bulletin has been sent\r\nAND user is viewing claims/results section\r\nAND \"Create Waiver Claim\" button is available for one or more players",
    "custom_steps": "WHEN user clicks \"Create Waiver Claim\" \r\n",
    "custom_expected": "THEN system should create a preliminary waiver claim assignment for the selected player and redirect the user to the transaction\r\nAND Waiver Claim Assignment should have the creating Org's consideration be for the player\r\nAND claiming Org's Cash Consideration should = $20,000 for all Waiver types except UR\r\nBUT if player is a R5 DE/SEL player, then it should be $25,000\r\nAND the player the waivers were requested for should NOT be able to be removed from the transaction\r\nAND if a preliminary waiver claim assignment already exists for the selected player, the system should redirect the user to the existing waiver claim assignment instead of creating a new one\r\nAND club should have the ability to add additional players and conditions as needed, then the WCA will follow the stateflow of a Trade",
    "custom_steps_separated": null
  },
  {
    "id": 649344,
    "title": "User wants to receive a notification if any UR Waiver Requests have not yet been accepted or rejected",
    "section_id": 79113,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132792873",
    "created_by": 75,
    "created_on": 1479140862,
    "updated_by": 103,
    "updated_on": 1479756635,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 2,
    "custom_preconds": "GIVEN a claimed UR waiver request exists for a player that still has not been player accepted or player rejected\r\nAND a user is logged in as BOC Waiver Admin or player's Club's Waiver Admin user",
    "custom_steps": "WHEN the nightly notification batch runs ",
    "custom_expected": "THEN system should check to see if any UR Waiver Requests that have been claimed still have not been player accepted or player rejected. \r\nAND if a waiver request is found that meets the above criteria, then the following notification should be generated for the BOC Waiver Admin as well as the player's Club's Waiver Admin user:       \" Unconditional Release Waiver Claim Reminder.  [player name], has until [date] to accept or reject the assignment from [club].\"",
    "custom_steps_separated": null
  },
  {
    "id": 649350,
    "title": "Batch Admin wants to see an Admin section on the Batches screen",
    "section_id": 80080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "133374313",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1481664663,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 2,
    "custom_preconds": "GIVEN an \"Admin\" collapsible section has been added to the batches screen that is controlled by a new, batches admin LDAP group\r\nAND a user is logged in with Batch Admin permissions",
    "custom_steps": "WHEN the user navigates to the \"Admin\" collapsible section of the batches screen\r\n\r\n",
    "custom_expected": "THEN there should be a \"Scheduled Batches\" subsection\r\nAND available within this subsection should be a \"Run Now\" button and a \"Hold All\" checkbox",
    "custom_steps_separated": null
  },
  {
    "id": 649351,
    "title": "BOC IT user wants to be able to hold all batches from running",
    "section_id": 80080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "133216955",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756598,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in with Batch Admin permissions\r\nAND user has navigated to the Admin subsection of the Batches screen",
    "custom_steps": "WHEN user checks the \"Hold All\" checkbox within the Admin subsection of the Batches screen ",
    "custom_expected": "THEN system should prevent any scheduled batches from running \r\nBUT when this checkbox is unchecked, scheduled batches should run according to their scheduled time and priority order",
    "custom_steps_separated": null
  },
  {
    "id": 649352,
    "title": "BOC IT user wants to kick off all scheduled batches immediately",
    "section_id": 80080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "134230185",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756598,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 4,
    "custom_preconds": "GIVEN a user is logged in with Batch Admin permissions\r\nAND user has navigated to the Admin subsection of the Batches screen",
    "custom_steps": "WHEN user checks the \"Run Now\" checkbox within the Admin subsection of the Batches screen ",
    "custom_expected": "THEN system should kick off the nightly batch process immediately, regardless of the time\r\nAND the batches should run in the same order they normally run at night",
    "custom_steps_separated": null
  },
  {
    "id": 649353,
    "title": "BOC IT user wants to be able to schedule the Waiver Expiration batch not to run",
    "section_id": 80080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "133216965",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756598,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 5,
    "custom_preconds": "GIVEN the backend has been set up to schedule the Waiver Expiration batch to NOT run on certain days",
    "custom_steps": "WHEN current date is equal to one of the dates the Waiver Expiration batch is set to NOT run ",
    "custom_expected": "THEN Waiver Expiration Batch should not run\r\nAND players with waivers in effect that are set to expire should not be expired",
    "custom_steps_separated": null
  },
  {
    "id": 649348,
    "title": "UAT Feedback - BOC Confirmation message on removal of UR waiver request",
    "section_id": 80082,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132211761",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756690,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in\r\nAND a submitted UR waiver request exists for a player",
    "custom_steps": "WHEN BOC user clicks the trash can icon of an Unconditional Waiver request ",
    "custom_expected": "THEN system should should prompt the BOC to confirm its removal\r\nAND warning should say \"Are you sure you want to delete the UR waiver request for {Player} on {request date}?\"\r\nAND clicking \"Ignore and Continue\" should ignore the error and continue with deletion\r\nAND clicking \"Back\" should return user to the form ",
    "custom_steps_separated": null
  },
  {
    "id": 649349,
    "title": "UAT Feedback - Update order of Request Bulletin",
    "section_id": 80082,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132191111",
    "created_by": 103,
    "created_on": 1479141020,
    "updated_by": 103,
    "updated_on": 1479756690,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13025,
    "display_order": 2,
    "custom_preconds": "GIVEN valid emails are entered to receive Request Bulletin Email notifications in the Email Utility\r\nAND \"Send Emails\" is set to yes\r\n",
    "custom_steps": "WHEN the Waiver Request Bulletin is sent \r\n",
    "custom_expected": "THEN on the body of the email received for the Request bulletin, the order should be: \r\n1) Waiver type\r\n2) Org alpha\r\n3) Name alpha\r\n AND league order should no longer be present ",
    "custom_steps_separated": null
  }
]