[
  {
    "id": 918403,
    "title": "As a user I want the MJC Stat batch to use the same mechanism to get stats as the rest of the system",
    "section_id": 109892,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141701991",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490974275,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 2,
    "custom_preconds": "GIVEN a user wants the MJC stat batch to use the same source for stats as the stats tab of player profile",
    "custom_steps": "WHEN user runs the MJC stat batch",
    "custom_expected": "THEN system should use the same source for stats as the stats tab on the player profile\r\nAND MJ Stat batch should still work the same after this change, and generate the proper notifications and contract updates. Only the source for the stats should change",
    "custom_steps_separated": null
  },
  {
    "id": 918391,
    "title": "As a user, I want to run the Payroll Player Details Report Straight to Excel",
    "section_id": 109298,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142538587",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490974866,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 6,
    "custom_preconds": "GIVEN  EBIS1 \"Run Excel Report\" version of the player details report has been replicated in EBIS2",
    "custom_steps": "WHEN user navigates to reports widget",
    "custom_expected": "THEN the popup to run the Payroll - Player Details report should have a \"Run Excel\" button which generates this document\r\nAND  columns and layout of the printed excel report will match ebis1",
    "custom_steps_separated": null
  },
  {
    "id": 918398,
    "title": "As an LRD user I want to be able to print the Forecast Utility",
    "section_id": 109298,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130338445",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490975203,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 8,
    "custom_preconds": "GIVEN an LRD user is viewing the Payroll Forecast Utility\r\nAND there is a \"Print\" button available ",
    "custom_steps": "WHEN user clicks Print",
    "custom_expected": "THEN system should run the Payroll Forecast Utility report with the same criteria as are currently selected on screen\r\nAND the report should run successfully just as if it had been run directly from the Reports widget",
    "custom_steps_separated": null
  },
  {
    "id": 851928,
    "title": "As a BOC user I want to be able to view an existing Investigation",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390841",
    "created_by": 136,
    "created_on": 1487104194,
    "updated_by": 103,
    "updated_on": 1490620642,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is in a Players profile under 'Contracts' tab\r\nAND Investigations that were created in ebis1 are visible in ebis2",
    "custom_steps": "WHEN user opens one of the exiting investigations\r\n\r\n",
    "custom_expected": "THEN system will display the form according to the provided wireframe. \r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 901781,
    "title": "Investigation Form - Permissions",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138391269",
    "created_by": 136,
    "created_on": 1489698103,
    "updated_by": 136,
    "updated_on": 1492526689,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 2,
    "custom_preconds": "GIVEN Investigation permission varies for different user (Test-ARI-viewer@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com and test_boc_approver@mlb.com)",
    "custom_steps": "WHEN the users logs in \r\n",
    "custom_expected": "THEN the following should be true \r\n-The form has a view only permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but cannot edit anything.  Users without the permission cannot view the form anywhere in the system.\r\n-The form has a \"registration\" permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but can only edit/create Investigations with a type = Registration. Users without this permission or the admin permission cannot edit or create Investigations anywhere in the system. \r\n-The form has an admin permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, and can edit/create any Investigation type. Users without this permission cannot edit or create non-Registration Investigations anywhere in the system. ",
    "custom_steps_separated": null
  },
  {
    "id": 901806,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created prior to EBIS2)",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 136,
    "created_on": 1489698103,
    "updated_by": 103,
    "updated_on": 1490819458,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 12,
    "custom_preconds": "GIVEN a club user is logged in and attempting to Adv Search for an Investigation created prior to ebis2 implementation\r\nAND club user is from requesting Club for the investigation they're searching for (The Org on the Investigation Form is their Org)\r\nAND player on this investigation is currently under contract with user's org OR the player is a Free Agent\r\nAND the investigation was entered on or after January 1, 2011. \r\n",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN only Investigations that meet ALL of the above criteria should display\r\nAND Investigations that do not meet ALL of the criteria above should not display",
    "custom_steps_separated": null
  },
  {
    "id": 901809,
    "title": "As a user I want to only see Investigations that I have permission to see within the player's Investigation History (updated for ebis2 investigations)",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250327",
    "created_by": 136,
    "created_on": 1489698103,
    "updated_by": 103,
    "updated_on": 1490819458,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in and attempting to view a player's Investigation History",
    "custom_steps": "WHEN user navigates to Investigation History Table on Player Profile ",
    "custom_expected": "THEN Investigation requests should only be visible to the submitting Org, and BOC Investigations\r\nAND Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History.",
    "custom_steps_separated": null
  },
  {
    "id": 901812,
    "title": "As a BOC user I want to have the option to link an investigation request to an existing investigation on approval of a request",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513471",
    "created_by": 136,
    "created_on": 1489698103,
    "updated_by": 103,
    "updated_on": 1490819458,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 14,
    "custom_preconds": "GIVEN an Investigation Request has been submitted to the BOC",
    "custom_steps": " WHEN BOC user reviews the Investigation Request",
    "custom_expected": "THEN system should display only a standard \"Approve\" button if the player has no investigations in the system\r\nBUT if the player has at least one investigation in the system, the user should see a split button that allows the BOC to choose whether or not they want to start a new Investigation, or add this request to an existing Investigation form\r\nAND if the user clicks Approve - Create New, then the Investigation Request should be marked approved and the player should have a new investigation created as laid out in #139513527\r\nBUT if the user clicks Approve - Add to Existing, then the system should do the following: \r\n -System saves any changes that were made to the form. System marks the investigation request as approved and displays a successful approval notification. \r\n - If only one investigation exists for the player then the system automatically adds the club who submitted the request as a requesting Org for the existing investigation. \r\n - If more than one investigation exists in the system for the player - the system displays a pop-up prompting the user to select to which investigation to add the requesting Org.\r\n - If the visibility of the Investigation was set to include \"Requesting Org\" then the Org that submitted this request can now see the investigation in the Player's History. \r\n - The player's Investigation History is updated. Club is notified of the approval of their request. See Clipboard #2.",
    "custom_steps_separated": null
  },
  {
    "id": 914405,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created in EBIS2)",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 136,
    "created_on": 1490631389,
    "updated_by": 103,
    "updated_on": 1490819513,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 16,
    "custom_preconds": "GIVEN a user is logged in and attempting to Adv Search for an Investigation created in ebis2",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History",
    "custom_steps_separated": null
  },
  {
    "id": 918401,
    "title": "As a user I want to see useful information in my browser tab for Investigations, Investigation Requests and Investigation Waiver Requests",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141257297",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1491250448,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 18,
    "custom_preconds": "GIVEN a user is logged in as club or BOC admin",
    "custom_steps": "WHEN user navigates to the Contracts & Inv tab of a player profile\r\nAND user opens an Investigation Request, Investigation Waiver Request, or Investigation\r\n",
    "custom_expected": "THEN browser tab text should be updated with the following:\r\n- Investigation Requests \"INV RQ - Last, Roster First\"\r\n- Investigation Waiver Requests \"INV WRQ - Last, Roster First\"\r\n- Investigation \"INV - Last, Roster First\"",
    "custom_steps_separated": null
  },
  {
    "id": 918402,
    "title": "As a user I want to be able to select an existing trainer/agent for use in the Investigation Form",
    "section_id": 109299,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142187677",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1491250665,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 19,
    "custom_preconds": "GIVEN a user is logged in with permissions to edit Investigation form \r\nAND user is viewing an Investigation form in edit mode",
    "custom_steps": "WHEN user selects \"Trainer/Agent\" dropdown\r\n",
    "custom_expected": "THEN Trainer/Agent field on an Investigation Form should be linked to the database of trainer/agents maintained in ebis amateur\r\nAND the field should be an auto-complete and work similar to player quicksearch \r\nAND user should be required to enter at least 3 characters to see any possible results\r\nAND the results returned are roughly as follows: \r\n - Any names where the entered characters match the Last exactly. (Ex if you enter \"Rodr\", then any trainer/agents with last names that start with Rodr would be displayed first, in alpha order by Last, First). \r\n - Followed by any names where the entered characters match the First exactly. (Ex: if you enter \"Rodr\", then any trainer/agents with first names that start with Rodr would be displayed following the above bullet's list, in alpha order by Last, First)\r\n - Any names that contain \"rodr\" in last name - but they don't start with Rodr. \r\n - Any names that contain \"rodr\" in first name - but they don't start with Rodr.",
    "custom_steps_separated": null
  },
  {
    "id": 918393,
    "title": "As a User, I want to view an existing Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337369",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1492450456,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 5,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests\r\n\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in a player's Winter League History widget\r\n\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window\r\nAND Browser tab info = \"WNTRQ - Last, Roster First\"\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 918394,
    "title": "As a User, I want to edit an existing Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337431",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490906436,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 6,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests",
    "custom_steps": "WHEN user opens existing Winter League Requests\r\n",
    "custom_expected": "THEN an Edit(grey) button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \r\nAND Clicking  Edit will reload the form in edit mode, and a Save(grey) button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND Editable fields will match what is in the provided Data Discovery (Note the special behaviors)\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND Clicking Save will save the transaction and it's current values and reload the transaction in view mode. \r\nAND Required field and format checks will only be made if the transaction is in a post-Approval state.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \r\nAND After a successful save the system will display a successful save blue notification. See Messages #77.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nAND If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 918395,
    "title": "As a BOC User, I want to create a new Winter League Request Transaction",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141872501",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490968099,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 7,
    "custom_preconds": "GIVEN BOC user logs in\r\n",
    "custom_steps": "WHEN user clicks on any of the Create New Icon > Minor League > Assignments > Winter League Request\r\nOR Create New Icon > Major League > Assignments > Winter League Request\r\n\r\n\r\n",
    "custom_expected": "THEN system will check to see if there is an existing Preliminary Request for the same player \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction.\r\nOR If no preliminary transaction already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND The status of preliminary will display in red on the form in view and edit mode\r\nAND Transaction should follow the wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 918396,
    "title": "As a BOC user, I want to submit a Winter League Request to Club",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085227",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490973166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC user logs in to submit a Winter League request to club",
    "custom_steps": "WHEN BOC has the preliminary form in edit mode or view mode.\r\n\r\n\r\n",
    "custom_expected": "THEN Submit to Club button will be available on the form.The button is blue. \r\nAND Clicking Submit to Club will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. (Global error messaging, modal, pinned errors, red highlight for missing required fields)\r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Pending to Club\"  \r\nAND The status \"Pending to Club\" appears in green on the form in view and edit mode.\r\nAND System reloads the transaction in view mode, and displays a successful approve blue notification. Messages #76.\r\nAND No entry is added to the player's player history.  \r\nAND An Approval item should be generated for BOC Users\r\nAND An Action Item should be generated for Club Users \r\n\r\nNOTE: This is not a standard transaction and should not be subject to the standard rule checks (similar to DL Recertifications)\r\n ",
    "custom_steps_separated": null
  },
  {
    "id": 918407,
    "title": "As a User, I want to view a player's Winter League Request History on their profile",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864301",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490986865,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 19,
    "custom_preconds": "GIVEN user is in Professional Players profile",
    "custom_steps": "WHEN user is in Transaction Tab\r\n\r\n",
    "custom_expected": "THEN \"Winter League Request History\" will be displayed on the last collapsible section. \r\nAND it will be expanded by default.\r\nAND Inside the section will be a widget that matches the provided wireframe and data discovery. http://ll2j6l.axshare.com/waivers___transactions.html\r\nAND Pending requests should appear in green\r\nOR If no Winter League Requests exist for the player the section header still going to display but there won't be any table (including the table headers). ",
    "custom_steps_separated": null
  },
  {
    "id": 918409,
    "title": "As a User, I want to Grant a Winter League Request Transactions",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864061",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490987447,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 21,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Grant button will be available.\r\nAND User can click Grant button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Granted\r\nAND All other pending requests for the player will be automatically denied when the request is granted\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been granted.\"\r\nAND When request is granted, \"Agreement Reached\" and checkbox will appear on the request\r\nAND BOC Users receive a Notification when Request is Granted\r\nOr Club Users receive a Notification when Request is Granted",
    "custom_steps_separated": null
  },
  {
    "id": 918410,
    "title": "As a User, I want to Deny a Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142155129",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490988154,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 22,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Deny(grey) button will be available in both View and Edit mode.\r\nAND User can click Deny button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Denied\r\nAND No other request is modified as a result of denying this request\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been denied.\"\r\nAND BOC Users receive a Notification when Request is Denied\r\nAND Club Users receive a Notification when Request is Denied",
    "custom_steps_separated": null
  },
  {
    "id": 918411,
    "title": "As a BOC User, I want to delete a Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142473377",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490989141,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 23,
    "custom_preconds": "GIVEN BOC user has edit permission for the Winter League Request form in Preliminary and Pending to Club states ",
    "custom_steps": "WHEN the form is in view or edit mode\r\n\r\n",
    "custom_expected": "THEN there should a \"Delete\" button on the form in grey\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this Winter League Request?\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted transactions should not appear on the front end or be searchable.\r\nAND Any Approval Items or Action Items related to the deleted Request should be deleted as well",
    "custom_steps_separated": null
  },
  {
    "id": 918412,
    "title": "As a BOC user, I want to be able to reverse or reverse and suppress a Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085113",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490989634,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 24,
    "custom_preconds": "GIVEN BOC logs in\r\nAND Winter League Request is in Approved state",
    "custom_steps": "WHEN user is viewing the transaction in View or Edit mode\r\n\r\n",
    "custom_expected": "THEN \"Reverse\" button will be available in grey\r\nAND Successful reverse notification will be displayed. See Messages #79\r\nAND The transaction status is updated to \"Reversed\"\r\nAND If the Request was originally Granted, the decision on the Request is updated to be Denied.\r\nOR If the Request was originally Denied, the decision on the Request is updated to be Granted.\r\nAND BOC Admins will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the player's Winter League History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.",
    "custom_steps_separated": null
  },
  {
    "id": 918413,
    "title": "As a User, I want to receive an email when a Winter League Request is submitted to club",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142525267",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 136,
    "updated_on": 1490990420,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 25,
    "custom_preconds": "GIVEN the Winter League Request in Preliminary state",
    "custom_steps": "WHEN user clicks on Submit to Club \r\n\r\n",
    "custom_expected": "THEN upon submitting to club, an email is sent to users defined in the Email Utility\r\n - Subject: Winter League Request\r\n - Body: A Winter League Request has been received on \" + requestDate + \" from club \" + fromTeam + \" of the \" + winterLeague + \" for player \" + playerName + \".\"\r\nAND Emails are generated whether the Request was created in ebis or the Winter League Portal",
    "custom_steps_separated": null
  },
  {
    "id": 918414,
    "title": "As a User, I want to receive an error if the Winter League Team has 10 pending requests",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141970155",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490989322,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 26,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player\r\nAND the Winter League Team on the request already had 10 pending requests",
    "custom_steps": "WHEN user clicks submit to Club ",
    "custom_expected": "THEN system should check for existing requests from Winter League Team in \"Pending to Club\" status\r\nAND if user finds 10 or more of these requests then system should display message:\"Invalid Winter League Request.  <club> currently have <number pending requests> pending Winter League Requests.\"\r\nAND Hint Text should say:\"The maximum is 10.\"  \r\nAND Clicking Back should return the user to the entry point\r\nAND clicking Override should submit the request",
    "custom_steps_separated": null
  },
  {
    "id": 918415,
    "title": "As a User, I want to receive an error if Player already has an Approved Winter League Request",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142059295",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490985513,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 27,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player\r\nAND an APPROVED (granted or denied) winter league request already exists for the player for the current period ",
    "custom_steps": "WHEN user attempts to submit Winter League Request\r\n\r\n",
    "custom_expected": "THEN if request is on or after 6/1, system should look from 6/1 of current year to 5/31 of next year\r\nBUT if request is before 6/1, system should look from 6/1 of last year to 5/31 of current year\r\nAND if system finds an Approved(granted or denied) Winter League Request for the player, for which an agreement was reached system should display message: \"Invalid Winter League Request.  An agreement has already been reached for the Winter League Request granted on <date> for <club>.\"\r\nBUT if system finds an Approved(granted or denied) Winter League Request for the player, for which an agreement was NOT reached system should display message: \"Invalid Winter League Request.  A Request was previously Granted on <date> for <club>.\" ",
    "custom_steps_separated": null
  },
  {
    "id": 918417,
    "title": "Winter League Requests Permissions - BOC - Minor Transactions",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887591",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490980640,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 29,
    "custom_preconds": "GIVEN a user is logged in as BOC admin or BOC basic user",
    "custom_steps": "WHEN user attempts to do anything with Winter League Requests\r\n",
    "custom_expected": "THEN BOC Admin users should be able to View, Create, Edit, Grant, Deny, Submit, Reverse, Delete and Search Winter League Requests\r\nBUT BOC Basic Users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 918418,
    "title": "Winter League Requests Permissions - Club - Minor Transactions",
    "section_id": 110009,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887645",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490980539,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 30,
    "custom_preconds": "GIVEN a user is logged in as club basic or club admin user",
    "custom_steps": "WHEN user attempts to do anything with a Winter League Request\r\n",
    "custom_expected": "THEN Club Admin users should be able to  Grant, Deny, and  Update Winter League Requests\r\nBUT Club Basic users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 918389,
    "title": "Display of accordion headers with a long title a and a toggle is incorrect at smaller screen sizes",
    "section_id": 109888,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120588953",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490979253,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is viewing a page with an accordion header in EBIS2",
    "custom_steps": "WHEN user views the screen on a screen size below 768px\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN the following updates should be applied:\r\n- Assign font-size:12px; to .panel-title \r\n- Decrease the left and right padding of .btn-ebis-toggle  .btn to 6px\r\n- Ellipse titles at some max-width",
    "custom_steps_separated": null
  },
  {
    "id": 918390,
    "title": "As a User, I want to edit users on the email utility",
    "section_id": 109888,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142526385",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490979385,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 3,
    "custom_preconds": "GIVEN Winter League Requests have already been integrated into the email utility",
    "custom_steps": "WHEN user with email utility edit permissions navigates to email utility page",
    "custom_expected": "THEN user should be able to add users to the utility for Winter League Requests\r\nAND user should be able to remove users from utility for Winter League Requests\r\nAND user should be able to save edits to utility ",
    "custom_steps_separated": null
  },
  {
    "id": 918404,
    "title": "As a user I want to be able to print a Trade Checklist from a Waiver Claim Assignment",
    "section_id": 109888,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "136220477",
    "created_by": 103,
    "created_on": 1490819339,
    "updated_by": 103,
    "updated_on": 1490979698,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 16745,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is viewing a Waiver Claim Assignment\r\nAND there is a Print button at the bottom of a waiver claim assignment",
    "custom_steps": "WHEN user clicks on the Print button ",
    "custom_expected": "THEN system should allow the user to choose to print a Trade Checklist\r\nand printing the Trade Checklist should generate a trade checklist for the WCA just like for an outright trade",
    "custom_steps_separated": null
  }
]