[
  {
    "id": 204972,
    "title": "As BOC, I can view cash considerations that are part of a trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126234619",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1472839594,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN I view a trade as BOC",
    "custom_expected": "**Wireframe:**\r\nhttp://t4lvuq.axshare.com/#p=view_an_existing_trade\r\n\r\n\r\nTHEN\r\nhttp://t4lvuq.axshare.com/#p=cash\r\n- Each cash consideration in the trade should be displayed under the ORG that is paying the money, under a collapsible sub-section called 'Cash'\r\n\r\nAND\r\nThe columns in the cash table are\r\n- *To* - The Org that the payment is being made to\r\n- *Amount* - Show commas and $\r\n- *Competitive Balance Amount* - Show commas and $\r\n- *Payable On/Before* - Format date as mm/dd/yyyy\r\n- *Paid on* - If populated, show as mm/dd/yyyy",
    "custom_steps_separated": null
  },
  {
    "id": 204978,
    "title": "As BOC, I can view the status and dates of an existing trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126232863",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1473696292,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 4,
    "custom_preconds": "GIVEN that user is logged in as BOC",
    "custom_steps": "WHEN user clicks a search result for an existing approved trade",
    "custom_expected": "**Wireframe:**\r\nhttp://t4lvuq.axshare.com/#p=view_an_existing_trade\r\n\r\n**AC**\r\nTHEN each player in the trade is listed as a separate search result\r\n- Or as BOC, I can click on an approved trade from a player's history to view the trade\r\n- When the trade opens, display the player header, and the status and dates section as shown in the wireframe\r\n- All applicable fields in the status and dates section should be populated with the equivalent information from ebis 1\r\n- The field \"Submitted to Club\" in ebis 1 will become \"Submitted by [initiating club]\" in ebis 2. For example if Boston RedSox initiated the transaction, show as 'Submitted by BOS'\r\n- The field 'Submitted to BOC' in ebis 1, will become 'Submitted by [Approving club]' in ebis 2.  For example if MIA was the club that approved the trade, show as 'Submitted by MIA'. This field should be ordered after the initiating club.\r\n\r\nAND\r\n\r\n**Global**\r\n- Date format should be mm/dd/yyyy - hh:mm am/pm\r\n- Quick jump menu is available\r\n- Transaction has a Close button that takes you Back to previous location",
    "custom_steps_separated": null
  },
  {
    "id": 204979,
    "title": "As BOC, I want to view a pay schedule if one was entered",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "127358489",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473696876,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 5,
    "custom_preconds": "GIVEN that user is viewing a past approved trade with a pay schedule",
    "custom_steps": null,
    "custom_expected": "**Wire**\r\n1. http://t4lvuq.axshare.com/#p=cash\r\n2. http://t4lvuq.axshare.com/#p=pay_scheduler\r\n\r\nTHEN\r\n\r\n**Ac**\r\n- Only display the pay schedule button if one was entered. See wire 1\r\n- When Pay schedule button is clicked, open a light box that shows the pay schedule and the totals in view mode\r\n- Date in ebis 2 should match equivalent values in ebis 1\r\n- Numbers should be formatted with commas and dates should be formatted correctly",
    "custom_steps_separated": null
  },
  {
    "id": 204984,
    "title": "As BOC, I can view conditional cash considerations that are part of a trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126234781",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473696907,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 8,
    "custom_preconds": "GIVEN that user is viewing a past approved trade",
    "custom_steps": null,
    "custom_expected": "**Wireframe:**\r\nhttp://t4lvuq.axshare.com/#p=conditional_cash__boc_only_\r\n\r\n\r\nTHEN \r\n\r\n**AC**\r\n- If there was a conditional cash consideration, display under the Org that is paying the cash consideration\r\n- Show the values in view mode in table as shown in wire\r\n- If a pay schedule was included, show a button to open the pay schedule. \r\n- The Pay schedule works similar to the Cash considerations pay schedule. See #127358489\r\n- Data in ebis 1 and ebis 2 should match",
    "custom_steps_separated": null
  },
  {
    "id": 204975,
    "title": "As BOC, I can view players who are part of a trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126234175",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1473696925,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 9,
    "custom_preconds": "GIVEN that user is viewing a past approved trade",
    "custom_steps": null,
    "custom_expected": "**Wireframe:**\r\n1. http://t4lvuq.axshare.com/#p=view_an_existing_trade\r\n2. http://t4lvuq.axshare.com/#p=minor_league_player\r\n\r\nTHEN\r\n\r\n**AC**\r\n- When viewing an existing approved trade, for each Org that was involved,  show a separate collapsible header with title '[Org name] Considerations'\r\n- Each player that participated in the trade should be displayed under the ORG that he **originated** from under a collapsible sub-section called 'Player'\r\n- Each player should be displayed as a row in a table. If multiple players originated from the same org, the table should have multiple rows.\r\n- If a player has Special Coventants in his MJ contract, display a Flag (see wire #2). Clicking on the flag opens pop-out with text \"Player's contract contains special covenants\"\r\n- Data must match equivalent values in ebis 1\r\n\r\nThe columns in the Player table are\r\n- Flags column - Only show if at least 1 player in the table has special covenants\r\n- *Player* - Last name, Roster name. Link to player history\r\n- *Pos* - abbreviated position\r\n- *Roster status* - Player's roster status at time of Trade submission\r\n- *From Club* - The full name of minor or major club that player originated from\r\n- *To Org* - Org that player is being traded to\r\n- *To Club* - The full name of minor or major club that player is traded to\r\n- *Written Consent* - Only show this column if at least 1 player in the table has it checked\r\n- *Received Ins form*\r\n\r\n**Note**\r\n- Attachment column will be introduced in a later story\r\n- There is no need to list the special covenants in the pop out. That is a future enhancement",
    "custom_steps_separated": null
  },
  {
    "id": 204983,
    "title": "As BOC, I want to view comments on a trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "127823521",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473696947,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 10,
    "custom_preconds": "GIVEN that user is viewing a past approved trade",
    "custom_steps": null,
    "custom_expected": "**Wire**\r\nhttp://t4lvuq.axshare.com/#p=view_an_existing_trade\r\n\r\nTHEN\r\n\r\n**AC**\r\n- Add the BOC notes and Comments sections to the trade. Any existing comments from ebis 1 should appear in the comments field",
    "custom_steps_separated": null
  },
  {
    "id": 204985,
    "title": "As BOC, I want to view existing attachments in a trade",
    "section_id": 28562,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "127355309",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473696961,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 11,
    "custom_preconds": "GIVEN that user is viewing a past approved trade",
    "custom_steps": null,
    "custom_expected": "**Wire**\r\nhttp://t4lvuq.axshare.com/#p=view_an_existing_trade\r\n\r\nTHEN \r\n\r\n**AC**\r\n- If a Notice of disposition and/or insurance form was attached to the trade,  display against the corresponding player with an attachment icon.\r\n- Clicking on the attachment icon opens a pop out listing the attached form names. The form names can be clicked on to open the attachment\r\n- If an Assignment Agreement was attached to the Trade, show the attachment in the general form Attached files section",
    "custom_steps_separated": null
  },
  {
    "id": 204973,
    "title": "As a club, I can select the Orgs that will participate in my trade",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126075863",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1473696996,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 1,
    "custom_preconds": "GIVEN that user is viewing a trade",
    "custom_steps": "WHEN trade is in edit mode",
    "custom_expected": "**Wireframe:**\r\nhttp://t4lvuq.axshare.com/#p=add_additional_orgs\r\n\r\nTHEN\r\n\r\n**AC**\r\n- The ADD ORG button appears as shown in wire\r\n- Clicking on this button lets you select 1 or more Orgs using multi-select\r\n- Clicking 'Add' creates a section header for each Org on the Trade screen. \r\n- The Section header has a delete icon that will remove the Org from the screen\r\n- Once an Org is added to the screen, it cannot be selected from the dropdown to be added again unless it is deleted.\r\n- A club user cannot delete thier own Org from the screen\r\n- 'Cancel' button in the popout closes the pop out. Clicking anywhere else on the screen closes the pop out",
    "custom_steps_separated": null
  },
  {
    "id": 204974,
    "title": "As a club, I want to select an Authorized signatory for each Org",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "127807975",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1473697031,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 2,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade",
    "custom_steps": null,
    "custom_expected": "**Wire**\r\nhttp://t4lvuq.axshare.com/#p=add_additional_orgs\r\n\r\nTHEN\r\n\r\n**AC**\r\n- For each Org on the screen, add an \"Authorized Signatory' field. \r\n- The dropdown for each Org shows that Org's Authorized signatories\r\n- If it's a Minor league Trade, only show Signatories with 'MN Trans' in the signatory widget. \r\n- If it's a Major league trade, only show Signatories with 'MJ Trans' checked in the signatory widget\r\n- This field is not required.\r\n- The \"Create New\" option only appears next to the Authorized Signatory field of the logged in club. Club can use this to add a new signatory from the form.",
    "custom_steps_separated": null
  },
  {
    "id": 204989,
    "title": "As a club, I want to be stopped from trading an MJ player to an MN team or MN player to MJ team",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126081417",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473698152,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 3,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade",
    "custom_steps": "WHEN populating the Player section of a trade",
    "custom_expected": "**AC**\r\n\r\nTHEN\r\n\r\n- if the club selects a Major League player, lock the \"To Club\" field for that row and default the field to the major league club\r\n- If a Minor league player is picked, re-enable the \"To Club\" field.\r\n- If a Minor league player is selected, remove the Major league club option from the \"To Club\" dropdown\r\n- Use player's 'Pending club' if he has one before using Current club",
    "custom_steps_separated": null
  },
  {
    "id": 204995,
    "title": "As a club, I want to attach forms for each player",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126083945",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473699053,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 5,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade\r\n",
    "custom_steps": "WHEN user adds a player to the trade",
    "custom_expected": "THEN \r\n\r\n- Show an upload button against each player when the form is in edit mode as shown in wire.\r\n- A club can only view the upload icon for players currently in thier Org\r\n- Clicking on upload icon, opens an attached files popout\r\n- Available labels are 'Notice of Disposition', 'Insurance Form' and 'Miscellaneous'\r\n- Hitting 'continue' on the pop out closes the modal. However user must save the main form to fully save the attachments\r\n- Hitting cancel undoes any changes to attached files\r\n- Hitting anywhere outside closes the pop out\r\n- User can use drag and drop and delete attachments from the pop out.",
    "custom_steps_separated": null
  },
  {
    "id": 204996,
    "title": "As a club, I can add cash considerations to the trade",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126242057",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473699080,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 6,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade",
    "custom_steps": null,
    "custom_expected": "THEN\r\n\r\n- Club can use the \"Add Considerations\" menu to add a Cash Section to any Org\r\n- A maximum of one cash consideration can be added per org so this option is no longer available in the menu once added\r\n- The 'To' dropdown lists Orgs participating in the trade except the Org that the cash section is under. Field is required\r\n- Amount column only accepts numbers. Auto-add commas. Field is required\r\n- Competitive Balance Amount column is locked for editing and has the same value as Amount\r\n- Payable on/Before is a date picker. Limit date range value from 1 month past until 2 years into the future. Field is required\r\n- 'Paid on' field is not editable to clubs.\r\n- Cash section can be removed with the delete icon",
    "custom_steps_separated": null
  },
  {
    "id": 204999,
    "title": "As a club, I can add a payment schedule for my cash considerations",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126243483",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473699231,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 8,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade\r\n",
    "custom_steps": null,
    "custom_expected": "**Wire**\r\nhttp://t4lvuq.axshare.com/#p=cash\r\nhttp://t4lvuq.axshare.com/#p=pay_scheduler\r\n\r\nTHEN\r\n\r\n- Club can add a Pay Schedule for each consideration.\r\n- If a pay schedule was already entered, the button is blue, otherwise it is not colored. \r\n- Clicking on Pay schedule opens a light box as shown in the wire\r\n- The 'Paid on' column in the pay schedule is not editable by the club\r\n- Club can enter the pay schedule. On closing the pay schedule, the total value of all rows will be automatically populated on the main screen and locked for editing\r\n- System will also update the \"Payable on/Before\" field on the main screen with the latest date in the pay schedule \r\n- Once a pay schedule is entered, the Amount value and Payable on/Before fields in the main screen are locked for editing.\r\n- If all rows from a pay schedule are removed, the pay scheduled is removed all together",
    "custom_steps_separated": null
  },
  {
    "id": 204976,
    "title": "As a club, I can add additional players to the Trade",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "126075983",
    "created_by": 99,
    "created_on": 1472063380,
    "updated_by": 99,
    "updated_on": 1473701795,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 10,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade",
    "custom_steps": null,
    "custom_expected": "THEN\r\n\r\n- An 'Add Consideration' button appears under each Org Section\r\n- Club can add a player section to any Org using the Add Consideration button\r\n- The player dropdown shows a list of all Major and Minor league players in the corresponding Org. If the Trade is Minor league, limit to just MN players\r\n- Once you add a player, you cannot re-add the same player\r\n- The 'To Org' column is enabled when at least 2 or more Orgs are part of the trade. The dropdown lists all of the Orgs in the trade except for the one the player is coming from. The dropdown should default to the first Org in the list\r\n- The 'To Club' column is enabled when the 'To Org' column is selected. It shows a list of major and minor league affiliates of the To Org\r\n- Club can add additional rows to an existing player section for any Org\r\n- Club can delete any row. If all rows are deleted, the entire Player section is removed for that Org.\r\n- The entire player sub section can also be deleted using the Delete icon in the player sub section header\r\n- Player sub section can only be added once per Org, so once added, it does not show in the 'Add Consideration' button dropdown",
    "custom_steps_separated": null
  },
  {
    "id": 204988,
    "title": "As a club, I can create and save a  preliminary trade from the roster",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 4,
    "milestone_id": null,
    "refs": "126075739",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473701851,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 11,
    "custom_preconds": "GIVEN that user is viewing the roster widget, a player profile, or anywhere the \"Create New\" button is available",
    "custom_steps": "WHEN user opens the Create New menu",
    "custom_expected": "THEN\r\n\r\n- Add the \"Outright Trade\" option to the Create New menu. It should be under \"Assignments\" for both Major and Minor League Transactions.\r\n- On selecting this option, create a new Preliminary trade.\r\n- The Preliminary trade is pre-loaded with the Org that the player belongs to and the player's details in Edit mode\r\n- Club can change the player using the dropdown to pick any other player on that Org's Major or Minor league roster. If the Trade is a Minor league trade, limit to only Minor league players\r\n- Pos, Roster status and 'From Club' (if the player is in the minor league) columns should populate automatically \r\n' To org' and 'To club' columns are disabled until additional orgs are added to trade (later story)\r\n- 'Received Ins form' is a date picker and blank by default\r\n- Player, To Club and To Org column headers have a required field asterisk\r\n- Transaction can be saved in preliminary\r\n- The Preliminary transaction can be found through Advanced search (each player is listed as a separate search result)\r\n\r\n**Global**\r\n- Cancel button prevents changes from being saved\r\n\r\n**Note**\r\n- Attachments and uploads will be added in a later story\r\n- Written consent column should be hidden and will be introduced in a later story",
    "custom_steps_separated": null
  },
  {
    "id": 204991,
    "title": "As a club, I want to know if a player's MJ contract contains special covenants",
    "section_id": 28563,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126081275",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473701877,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 14,
    "custom_preconds": "GIVEN that user is viewing a trade",
    "custom_steps": null,
    "custom_expected": "THEN\r\n\r\n- If any of the players involved in the trade have an active Major league contract and that MJ contract has special covenants, show a flag to the left of the player name\r\n- The flag column should appear only if at least one player in the table has a flag\r\n- On clicking on the flag, open pop out  with text as shown in wire and list out the Special covenant names. Clicking anywhere outside the pop out closes it",
    "custom_steps_separated": null
  },
  {
    "id": 204986,
    "title": "As a Club, I can view trades",
    "section_id": 28564,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126234851",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473701898,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 4,
    "custom_preconds": "GIVEN that user is logged in as a club",
    "custom_steps": null,
    "custom_expected": "THEN\r\n\r\n- All Clubs can see all approved trades\r\n- All club users cannot see Conditional Cash Considerations even if they are part of the trade. This is a BOC only section\r\n- Only clubs involved in a trade can see the \"Cash Considerations\". All other clubs do not see this section at all\r\n- Any trades not yet approved can only be viewed by the clubs involved\r\n- Preliminary trades can only be viewed by the initiating clubs\r\n- Attached files and Comments can only be viewed by involved clubs\r\n- BOC Notes cannot be viewed by clubs",
    "custom_steps_separated": null
  },
  {
    "id": 204990,
    "title": "As Club, I can submit a trade for other club's review",
    "section_id": 28564,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "126246391",
    "created_by": 99,
    "created_on": 1472063381,
    "updated_by": 99,
    "updated_on": 1473701991,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3152,
    "display_order": 5,
    "custom_preconds": "GIVEN that user is viewing a preliminary trade",
    "custom_steps": null,
    "custom_expected": "THEN\r\n\r\n- Club can hit the 'Submit to club' button on the Trade. This updates the transaction status to \"Submitted to Club\"\r\n- The status and dates section updates the field \"Submitted by [Org abbreviation]\" with current date/time and username\r\n\r\nAND \r\n\r\n**Global**\r\n- Show success notification\r\n- Submit to Club button is blue\r\n\r\nAND\r\n\r\n**Stateflow**\r\nis https://u8r.jamacloud.com/perspective.req#/items/2310702?projectId=14044",
    "custom_steps_separated": null
  }
]