[
  {
    "id": 1082443,
    "title": "As a User, I want to view an existing Winter League Request",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337369",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 1,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests\r\n\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in a player's Winter League History widget\r\n\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window\r\nAND Browser tab info = \"WNTRQ - Last, Roster First\"\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1082444,
    "title": "As a User, I want to edit an existing Winter League Request",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337431",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 2,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests",
    "custom_steps": "WHEN user opens existing Winter League Requests\r\n",
    "custom_expected": "THEN an Edit(grey) button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \r\nAND Clicking  Edit will reload the form in edit mode, and a Save(grey) button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND Editable fields will match what is in the provided Data Discovery (Note the special behaviors)\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND Clicking Save will save the transaction and it's current values and reload the transaction in view mode. \r\nAND Required field and format checks will only be made if the transaction is in a post-Approval state.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \r\nAND After a successful save the system will display a successful save blue notification. See Messages #77.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nAND If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1082445,
    "title": "As a BOC User, I want to create a new Winter League Request Transaction",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141872501",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user logs in\r\n",
    "custom_steps": "WHEN user clicks on any of the Create New Icon > Minor League > Assignments > Winter League Request\r\nOR Create New Icon > Major League > Assignments > Winter League Request\r\n\r\n\r\n",
    "custom_expected": "THEN system will check to see if there is an existing Preliminary Request for the same player \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction.\r\nOR If no preliminary transaction already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND The status of preliminary will display in red on the form in view and edit mode\r\nAND Transaction should follow the wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1082446,
    "title": "As a BOC user, I want to submit a Winter League Request to Club",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085227",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user logs in to submit a Winter League request to club",
    "custom_steps": "WHEN BOC has the preliminary form in edit mode or view mode.\r\n\r\n\r\n",
    "custom_expected": "THEN Submit to Club button will be available on the form.The button is blue. \r\nAND Clicking Submit to Club will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. (Global error messaging, modal, pinned errors, red highlight for missing required fields)\r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Pending to Club\"  \r\nAND The status \"Pending to Club\" appears in green on the form in view and edit mode.\r\nAND System reloads the transaction in view mode, and displays a successful approve blue notification. Messages #76.\r\nAND No entry is added to the player's player history.  \r\nAND An Approval item should be generated for BOC Users\r\nAND An Action Item should be generated for Club Users \r\n\r\nNOTE: This is not a standard transaction and should not be subject to the standard rule checks (similar to DL Recertifications)\r\n ",
    "custom_steps_separated": null
  },
  {
    "id": 1082447,
    "title": "As a User, I want to view a player's Winter League Request History on their profile",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864301",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 5,
    "custom_preconds": "GIVEN user is in Professional Players profile",
    "custom_steps": "WHEN user is in Transaction Tab\r\n\r\n",
    "custom_expected": "THEN \"Winter League Request History\" will be displayed on the last collapsible section. \r\nAND it will be expanded by default.\r\nAND Inside the section will be a widget that matches the provided wireframe and data discovery. http://ll2j6l.axshare.com/waivers___transactions.html\r\nAND Pending requests should appear in green\r\nOR If no Winter League Requests exist for the player the section header still going to display but there won't be any table (including the table headers). ",
    "custom_steps_separated": null
  },
  {
    "id": 1082448,
    "title": "As a User, I want to Grant a Winter League Request Transactions",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864061",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 6,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Grant button will be available.\r\nAND User can click Grant button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Granted\r\nAND All other pending requests for the player will be automatically denied when the request is granted\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been granted.\"\r\nAND When request is granted, \"Agreement Reached\" and checkbox will appear on the request\r\nAND BOC Users receive a Notification when Request is Granted\r\nOr Club Users receive a Notification when Request is Granted",
    "custom_steps_separated": null
  },
  {
    "id": 1082449,
    "title": "As a User, I want to Deny a Winter League Request",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142155129",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 7,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Deny(grey) button will be available in both View and Edit mode.\r\nAND User can click Deny button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Denied\r\nAND No other request is modified as a result of denying this request\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been denied.\"\r\nAND BOC Users receive a Notification when Request is Denied\r\nAND Club Users receive a Notification when Request is Denied",
    "custom_steps_separated": null
  },
  {
    "id": 1082450,
    "title": "As a BOC User, I want to delete a Winter League Request",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142473377",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC user has edit permission for the Winter League Request form in Preliminary and Pending to Club states ",
    "custom_steps": "WHEN the form is in view or edit mode\r\n\r\n",
    "custom_expected": "THEN there should a \"Delete\" button on the form in grey\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this Winter League Request?\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted transactions should not appear on the front end or be searchable.\r\nAND Any Approval Items or Action Items related to the deleted Request should be deleted as well",
    "custom_steps_separated": null
  },
  {
    "id": 1082451,
    "title": "As a BOC user, I want to be able to reverse or reverse and suppress a Winter League Request",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085113",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 9,
    "custom_preconds": "GIVEN BOC logs in\r\nAND Winter League Request is in Approved state",
    "custom_steps": "WHEN user is viewing the transaction in View or Edit mode\r\n\r\n",
    "custom_expected": "THEN \"Reverse\" button will be available in grey\r\nAND Successful reverse notification will be displayed. See Messages #79\r\nAND The transaction status is updated to \"Reversed\"\r\nAND If the Request was originally Granted, the decision on the Request is updated to be Denied.\r\nOR If the Request was originally Denied, the decision on the Request is updated to be Granted.\r\nAND BOC Admins will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the player's Winter League History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.",
    "custom_steps_separated": null
  },
  {
    "id": 1082452,
    "title": "As a User, I want to receive an email when a Winter League Request is submitted to club",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142525267",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 10,
    "custom_preconds": "GIVEN the Winter League Request in Preliminary state",
    "custom_steps": "WHEN user clicks on Submit to Club \r\n\r\n",
    "custom_expected": "THEN upon submitting to club, an email is sent to users defined in the Email Utility\r\n - Subject: Winter League Request\r\n - Body: A Winter League Request has been received on \" + requestDate + \" from club \" + fromTeam + \" of the \" + winterLeague + \" for player \" + playerName + \".\"\r\nAND Emails are generated whether the Request was created in ebis or the Winter League Portal",
    "custom_steps_separated": null
  },
  {
    "id": 1082453,
    "title": "As a User, I want to receive an error if the Winter League Team has 10 pending requests",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141970155",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player\r\nAND the Winter League Team on the request already had 10 pending requests",
    "custom_steps": "WHEN user clicks submit to Club ",
    "custom_expected": "THEN system should check for existing requests from Winter League Team in \"Pending to Club\" status\r\nAND if user finds 10 or more of these requests then system should display message:\"Invalid Winter League Request.  <club> currently have <number pending requests> pending Winter League Requests.\"\r\nAND Hint Text should say:\"The maximum is 10.\"  \r\nAND Clicking Back should return the user to the entry point\r\nAND clicking Override should submit the request",
    "custom_steps_separated": null
  },
  {
    "id": 1082455,
    "title": "Winter League Requests Permissions - BOC - Minor Transactions",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887591",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in as BOC admin or BOC basic user",
    "custom_steps": "WHEN user attempts to do anything with Winter League Requests\r\n",
    "custom_expected": "THEN BOC Admin users should be able to View, Create, Edit, Grant, Deny, Submit, Reverse, Delete and Search Winter League Requests\r\nBUT BOC Basic Users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 1082456,
    "title": "Winter League Requests Permissions - Club - Minor Transactions",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887645",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 14,
    "custom_preconds": "GIVEN a user is logged in as club basic or club admin user",
    "custom_steps": "WHEN user attempts to do anything with a Winter League Request\r\n",
    "custom_expected": "THEN Club Admin users should be able to  Grant, Deny, and  Update Winter League Requests\r\nBUT Club Basic users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 1082457,
    "title": "As a User, I want to search for Winter League Request Transactions",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864033",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 15,
    "custom_preconds": "GIVEN the user is in Advance Search page",
    "custom_steps": "WHEN the user selects \"Winter League Request\" under \"Search Type\"\r\n\r\n",
    "custom_expected": "THEN \"Decision\" will be the filters under the Transaction search type\r\nAND Filter will be a Select2\r\nAND Possible Values will be \"Granted\" and \"Denied\"\r\nAND Conducting an advanced search will return the standard result columns for a transaction search\r\nAND \"Decision\" will be included in the result columns",
    "custom_steps_separated": null
  },
  {
    "id": 1082458,
    "title": "As a User, I want to receive an error if the player has an Offseason Assignment",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142073633",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 16,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player \r\nAND the player selected as an Offseason Assignment",
    "custom_steps": "WHEN user submits Winter League Request",
    "custom_expected": "THEN if  the request is on or after 6/1, system should look for offseason assignments from 6/1 of current year to 5/31 of next year\r\nBUT if request is before 6/1, system should look for offseason assignments from 6/1 of last year to 5/31 of current year\r\nAND if an approved offseason assignment is found system should display message: \"Invalid Winter League Request.  Player was assigned via an Offseason Assignment on <date> to play for <club>.\"",
    "custom_steps_separated": null
  },
  {
    "id": 1127273,
    "title": "As a user I want to be able to run the Winter League Requests report",
    "section_id": 129581,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143826503",
    "created_by": 136,
    "created_on": 1499965543,
    "updated_by": 136,
    "updated_on": 1499965552,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 17,
    "custom_preconds": "GIVEN \"Winter League Requests \" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1082459,
    "title": "As a User, I want new Winter League Requests entered into the WLP to be sent to ebis",
    "section_id": 129582,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142333481",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 1,
    "custom_preconds": "GIVEN a RESTful interface for the Winter League Portal exists in EBIS",
    "custom_steps": "WHEN a new Request is created in the WLP",
    "custom_expected": " THEN the following fields should be sent to ebis:\r\n -- Player First Name\r\n -- Player Last Name\r\n -- ebisID (player ID)\r\n -- Requesting Team (ebis club ID)\r\n -- Status: Requested\r\n -- Request Date\r\nAND a new Winter League Request should be created and submitted to Club in ebis, with all relevant submission updates being performed as though it was submitted within ebis, including the appropriate notifications and action items\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1082460,
    "title": "As a User, I want the cancellation of Requests in the WLP sent back to EBIS",
    "section_id": 129582,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142335165",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 2,
    "custom_preconds": "GIVEN a RESTful interface exists in EBIS for cancelling a Winter League Request in the Winter League Portal",
    "custom_steps": "WHEN a Winter League Request is cancelled in in the WLP",
    "custom_expected": "THEN fields passed in should match the fields passed in for a new request\r\nAND the fields passed in should be:\r\n-- ebisID (player ID)\r\n-- Requesting Team (ebis club ID)\r\n-- Request Date\r\nAND system should find pending to club requests that match the passed in data\r\nAND these requests in EBIS should be deleted\r\nAND system should return a generic JSON object to WLP with a boolean indicating success/failure as well as a list of error messages",
    "custom_steps_separated": null
  },
  {
    "id": 1082461,
    "title": "As a User, I want Agreements Reached sent to ebis",
    "section_id": 129582,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142343909",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 3,
    "custom_preconds": "GIVEN a RESTful interface exists in EBIS for \"Agreements Reached\" on a Granted Winter League Request in the Winter League Portal",
    "custom_steps": "WHEN an agreement is reached on a granted Winter League Request in in the WLP",
    "custom_expected": "THEN fields passed in should match the fields passed in for a new request \r\nAND fields passed in should be:\r\n -- ebisID (player ID)\r\n -- Requesting Team (ebis club ID)\r\n -- Request Date\r\n -- Agreement Reached Flag\r\n AND agreement Reached checkbox should be checked on the Winter League Request in EBIS\r\nAND system should return a generic JSON object to WLP with a boolean indicating success/failure as well as a list of error messages",
    "custom_steps_separated": null
  },
  {
    "id": 1082462,
    "title": "As a User, I want the granting of Requests sent back to the WLP",
    "section_id": 129582,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142333473",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 4,
    "custom_preconds": "GIVEN RESTful service between EBIS and WLP for granting requests",
    "custom_steps": "WHEN a Request is granted in EBIS\r\n ",
    "custom_expected": "THEN the following fields should be sent to the WLP\r\n -- ebisID (player_id)\r\n -- Requesting Team (club_id)\r\n -- Request Date (request_date)\r\n -- Status: G  (status)\r\n -- Username granting/denying (username)\r\n AND the fields should be sent as a JSON object with field names noted in parens above",
    "custom_steps_separated": null
  },
  {
    "id": 1082463,
    "title": "As a User, I want the denying of Requests sent back to the WLP",
    "section_id": 129582,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142334119",
    "created_by": 103,
    "created_on": 1498832664,
    "updated_by": 103,
    "updated_on": 1498832664,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18952,
    "display_order": 5,
    "custom_preconds": "GIVEN RESTful service between EBIS and WLP for denying requests",
    "custom_steps": "WHEN a Request is denied in EBIS ",
    "custom_expected": "THEN the following fields should be sent to the WLP:\r\n -- ebisID (player_id)\r\n -- Requesting Team (club_id)\r\n -- Request Date (request_date)\r\n -- Status: D  (status)\r\n -- Username granting/denying (username)\r\nAND the fields should be sent as a JSON object with field names noted in parens above",
    "custom_steps_separated": null
  }
]