[
  {
    "id": 1225556,
    "title": "As a BOC user I want to view the System Forms widget",
    "section_id": 148053,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156866317",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN  a BOC user is logged in with System Forms Widget permissions \r\nAND user navigated to the \"Reporting\" dashboard\r\n",
    "custom_steps": "WHEN user click on \"Blank Forms\" tab",
    "custom_expected": "THEN system should load the System Forms widget. \r\nAND The widget should follow the provided data discovery and wireframe.\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=system_forms_-_boc\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+System+Forms+widget",
    "custom_steps_separated": null
  },
  {
    "id": 1225574,
    "title": "As a BOC user I want to add a new Language to the system forms widget",
    "section_id": 148053,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156901505",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user logs in with system forms widget edit permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"Create New\" button on the System Forms widget\r\n\r\n",
    "custom_expected": "THEN system allows the user to select \"Language\" \r\nAND If they click \"Language\" the system opens up a pop-up, per the provided wireframe and data discovery. \r\nAND The user has the ability to select a new Language from the provided list of Languages. \r\nAND Once a value is entered, the \"Save\" button becomes enabled. \r\nAND The \"Cancel\" button is always enabled. \r\nAND Clicking Cancel will close the modal and no new form type is stored.\r\nAND Clicking Save will store the new Language.\r\nAND The new Language will be available for use when creating new and editing existing system forms.\r\nAND The next time the user goes to enter a new Language, this one will no longer be available (cannot add the same language multiple times).\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=new_language\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89350246",
    "custom_steps_separated": null
  },
  {
    "id": 1225571,
    "title": "As a BOC user I want to add a new Form Type to the system forms widget",
    "section_id": 148053,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156901497",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC user logs in with create/Edit permission on System Forms widget\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"Create New\" button on the System Forms widget",
    "custom_expected": "THEN system will allow the user to select \"Form Type\" \r\nAND If they click \"Form Type\" the system opens up a pop-up, per the provided wireframe and data discovery. \r\nAND The user has the ability to enter text and special characters here. \r\nAND Once a value is entered, the \"Save\" button becomes enabled. \r\nAND The \"Cancel\" button is always enabled. \r\nAND Clicking Cancel will close the modal and no new form type is stored.\r\nAND Clicking Save will store the new Form Type as it was entered by the user.\r\nAND The Form Type will be available for use when creating new and editing existing system forms.\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=new_form_type\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89350246",
    "custom_steps_separated": null
  },
  {
    "id": 1225557,
    "title": "As a Club user I want to be able to Request an Investigation for an International Amateur player",
    "section_id": 148054,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479734",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN club user is logged in with Edit permissions for Investigations",
    "custom_steps": "WHEN user opens International Amateur player profile in view mode",
    "custom_expected": "THEN Users with Edit permissions for Investigations see a Create New icon on International Amateur profiles.\r\nAND Club users are able to launch a new Investigation Request for the player via the Create New. \r\nAND The Investigation Request workflow is able to be completed for the new kind of International Amateur profiles, just like it was previously. \r\nAND This needs to still work for existing international amateurs.",
    "custom_steps_separated": null
  },
  {
    "id": 1225569,
    "title": "As a user I want updating an international amateur profile with an investigation to send the update to LARI",
    "section_id": 148054,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156830588",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 2,
    "custom_preconds": "GIVEN an International Player Profile has already been sent to LARI",
    "custom_steps": "WHEN the International Player Profile associated with a player ID a that has already been sent to LARI is updated",
    "custom_expected": "THEN the information should be communicated to LARI \r\nAND saving changes to an International amateur profile that has an investigation associated with it should send those updates to LARI.",
    "custom_steps_separated": null
  },
  {
    "id": 1225568,
    "title": "As a user I want to be able to create a NES List transaction for an international amateur player",
    "section_id": 148054,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479789",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC or club user is logged in with Edit permissions for MN Transactions",
    "custom_steps": "WHEN user opens International amateur player profiles",
    "custom_expected": "THEN Users with Edit permissions for MN Transactions see a Create New icon on International Amateur profiles.\r\nAND BOC users are able to launch a new Place on NES List for the player via the Create New. \r\nAND The Place on NES List transaction should work for the new version of international amateurs just as it does for the old version.",
    "custom_steps_separated": null
  },
  {
    "id": 1225566,
    "title": "As a user I want Terms Accepting the MNC of an International Amateur player to convert the player into a professional player profile",
    "section_id": 148054,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479773",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC user is logged in with edit permissions for MNC\r\nAND user is viewing MNC of an International Amateur player \r\nAND the MNC status is in Terms Submitted",
    "custom_steps": "WHEN user click on \"Update Status\" from Terms Submitted to Terms Accepted ",
    "custom_expected": "THEN the international player profile should be converted to a Professional profile. \r\nAND All of the relevant information should be carried forward from the amateur to the professional profile.\r\nAND The MLB Program Participation and other portions of the \"International\" tab should be appropriately populated, in addition to the Info tab. \r\nAND The player should no longer be visible in International Amateur searches and widgets. \r\nAND This needs to still work for existing international amateurs.",
    "custom_steps_separated": null
  },
  {
    "id": 1225577,
    "title": "As a user I want to be able to create a MJ Contract for an International Amateur player",
    "section_id": 148054,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479757",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 6,
    "custom_preconds": "GIVEN user logs in with MJC Admin permissions",
    "custom_steps": "WHEN user is viewing an International Amateur Profile ",
    "custom_expected": "THEN Users with Edit permissions for MJ Contracts see a Create New icon on International Amateur profiles.\r\nAND Users are able to launch a new MJ Contract for the player via the Create New. \r\nAND The MJ Contract should work for the new version of international amateurs just as it does for the old version, including the conversion to a professional player profile at the appropriate point.",
    "custom_steps_separated": null
  },
  {
    "id": 1224392,
    "title": "As a BOC user I want to merge 2 Profiles",
    "section_id": 148055,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155819222",
    "created_by": 103,
    "created_on": 1522344664,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN If they choose to click \"Cancel\" then the modal closes and no merge is taken. The user is returned to the Registration Admin with no changes saved. A\r\nAND If they click \"Merge\" then the system will merge the two selected profiles. \r\nAND The Bio Information selected as the \"Master\" will now be the record for ANY user that loads that profile in the system. \r\nAND The system will need to maintain a record of the merge, and maintain BOTH player IDs. \r\nAND The attached files selected as \"Master\" will display under the MASTER origin for BOC users. \r\nAND The contact information selected as \"Master\" will display under the MASTER origin for BOC users. \r\nAND Any Origins that were available on BOTH profiles are also available to the BOC under the \"Origin\" dropdown.  (Ex: If Player 1 had Origins of BOC and MLSB, and Player 2 had Origins of BOC and BOS, the profile after the merge will have Master, BOC - 1, BOC- 2, MLSB and BOS)\r\nAND The player will only appear once in the Reg Admin widget, Club Reg List and any searches using the new \"Master\" Bio information.\r\nAND Clubs continue to see ONLY their own Contact information and Attached Files. \r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration\r\n\r\n*Additional merge rules covered in followup stories*\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*",
    "custom_steps_separated": null
  },
  {
    "id": 1225555,
    "title": "As a BOC user I want merging two international player profiles to bring over any relevant Investigation info",
    "section_id": 148055,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155998812",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "When user click \"Merge\"",
    "custom_expected": "THEN the system should check to see if either of the players has an Investigation or Investigation Request associated with them. \r\nAND Regardless of which profile is selected as the \"Master\", all available Investigations and Investigation Requests need to be maintained and available via the newly merged profile. \r\nAND All relevant updates to player information and/or Player ID should also be sent to LARI per #139253907.",
    "custom_steps_separated": null
  },
  {
    "id": 1226025,
    "title": "As a developer i want to be able to get Player ids that were updated (via a data fix)  - intl",
    "section_id": 148055,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157293087",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1526936975,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 4,
    "custom_preconds": "GIVEN one or more fields on an international amateur profile have been data fixed by devs",
    "custom_steps": "WHEN user runs the Ebis Link Updated Batch\r\n",
    "custom_expected": "THEN player IDs for all profiles that were data fixed should display in batch results\r\n\r\n*Note that this will need to work with existing international amateur players AND the \"new\" version after August*",
    "custom_steps_separated": null
  },
  {
    "id": 1225073,
    "title": "As a Club user I want to see a detailed error message around any formatting errors contained in my spreadsheet",
    "section_id": 148056,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155926029",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN a Club user logs in with international player edit permissions\r\nAND user clicks on \"Spreadsheet Upload\" on the Club Reg List widget\r\n\r\n",
    "custom_steps": "WHEN club user clicks on \"Upload\" on the modal\r\n\r\n",
    "custom_expected": "THEN system will check that each row that contains data in the attached spreadsheet fulfills all of the required fields in order to process the spreadsheet. \r\nAND the system will also verify that DOBs entered follow the accepted format, and that each of the countries included can be found in the app. \r\nAND the system will return an error message with the number of rows that could not be processed, along with detailed information about which column requires attention in each of the rows. \r\nAND the system will not process any of the rows until the entire spreadsheet can pass this initial check.\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=spreadsheet_upload\r\n\r\nTemplate: \r\nhttps://wiki.mlbam.com/display/EBIS/Spreadsheet+Upload+%28Registration%29-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1224417,
    "title": "As a BOC user I want to receive a \"daily digest\" email of Investigation results requested",
    "section_id": 148057,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155997997",
    "created_by": 103,
    "created_on": 1522344664,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user is on the Email Utility to receive a \"daily digest\" email of Investigation results requested\r\n",
    "custom_steps": "WHEN Club user requests Investigation Results for a player",
    "custom_expected": "THEN At the end of each day, the system should check to see if any new Investigation Results requests were entered that day.\r\nAND If no, then no email is generated.\r\nOR If yes, then an email should be generated to those users that are in the Utility under \"Investigation Results Requests\" as meant to receive the email. \r\nAND The email should have the subject \"mm/dd/yyyy Investigation Results Requests\"\r\nAND The email body should contain a \"NEW REQUESTS:\" header followed by a bulleted list of all of the requests entered into the system for the day, regardless of current status. The list should be formatted as Requesting Org - First Middle Last Extended Last. Ex: ARI - John David Jones Smith\r\nAND Sort of the bulleted list should be on ORG and then on Player name.",
    "custom_steps_separated": null
  },
  {
    "id": 1225068,
    "title": "As an LRD user I want to receive a \"daily digest\" email of L2 Drug Test Results requested",
    "section_id": 148057,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155997995",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 2,
    "custom_preconds": "GIVEN LRD user is on the Email Utility to receive a \"daily digest\" email of L2 Drug Test Results requested",
    "custom_steps": "WHEN Club user requests L2 Drug Test Results for a player",
    "custom_expected": "THEN At the end of each day, the system should check to see if any new L2 Drug Test Results requests were entered that day.\r\nAND If no, then no email is generated.\r\nOR If yes, then an email should be generated to those users that are in the Utility under \"L2 Drug Test Results\" as meant to receive the email. \r\nAND The email should have the subject \"mm/dd/yyyy L2 Drug Test Results Requests\"\r\nAND The email body should contain a \"NEW REQUESTS:\" header followed by a bulleted list of all of the requests entered into the system for the day, regardless of current status. The list should be formatted as Requesting Org - First Middle Last Extended Last. Ex: ARI - John David Jones Smith\r\nAND Sort of the bulleted list should be on ORG and then on Player name.",
    "custom_steps_separated": null
  },
  {
    "id": 1225558,
    "title": "As a BOC user I want to see Investigation Results populated on the L2 Investigation Results Request widget",
    "section_id": 148057,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155998750",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with L2 Investigation Results Request widget permissions \r\n",
    "custom_steps": "WHEN user click on \"L2 Inquiries\" tab under International",
    "custom_expected": "THEN Users with permission to see the L2 Investigation Results Request widget see the Age and Identity columns populated with the values from the player's Registration Investigation's \"Final Age Result\" and \"Final Identity Result\" fields. \r\nAND Each player should only have one Registration Investigation (Investigation with a type of \"Registration\") associated with them, but in the unlikely event there are two, look to the one with the latest create date. \r\nAND If the player does not have any Registration investigations, but has another type, use the Investigation with the latest create date.",
    "custom_steps_separated": null
  },
  {
    "id": 1225549,
    "title": "As a BOC user I want to be able to delete a grandfathered player profile",
    "section_id": 148058,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156294123",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC logs in with Grandfathered profile delete permissions\r\nAND User has navigated to the International Dashboard",
    "custom_steps": "WHEN user opens a Grandfathered profile in edit or view mode",
    "custom_expected": "THEN There is a \"delete\" button when viewing a grandfathered player profile in edit mode or view mode.\r\nAND Clicking \"Delete\" prompts the user to confirm they wish to delete the profile. See Messages #10\r\nAND Confirming on that message will prompt the user to be extra sure. See Messages # 11.\r\nAND If the user confirms both messages, the player is deleted from the system. They should no longer appear on any widgets or in any searches and reports.\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 1225061,
    "title": "As a user I want to be able to run the International Registration Admin Report",
    "section_id": 148059,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156527092",
    "created_by": 103,
    "created_on": 1523380070,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 3,
    "custom_preconds": "GIVEN Club or BOC user logs\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in reporting widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN \"International Registration Admin Report\" report will be in the Report listing widget. Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"International\". \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will continue to use the existing LDAP. \r\nAND This is a BOC only report.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Reg+Admin+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Reg+Admin+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=89347945\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Reg+Admin+-+Report+Prompts\r\n\r\nReport Security: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Reg+Admin+-+Security+-+Frequency",
    "custom_steps_separated": null
  },
  {
    "id": 1225611,
    "title": "As a Scouting user I want to view an International Amateur profile",
    "section_id": 148061,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156057810",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 5,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=bureau\r\nGIVEN a new LDAP has been created that allows users to Create/Edit Unregistered player profiles\r\nAND a scouting user has logged in in that has this new LDAP and does NOT have EBIS-INTL-PLAYER-EDITORS or EBIS-INTL-PLAYER-VIEWERS ",
    "custom_steps": "WHEN user attempts to do anything with international amateur profiles",
    "custom_expected": "THEN Opening an existing Unregistered profile should display per the provided wireframe and data discovery\r\nAND opening an existing Registration profile should display per the provided wireframe and data discovery\r\nAND these user should see \"Scout\" entered contact info\r\nBUT these users should NOT see BOC or Club entered contact info\r\nAND opening and existing Grandfathered profile should display the same as if the user were a club or regular BOC user\r\nBUT if the user has BOTH the new permission AND one of the above LDAPs, then loading existing profiles will be treated as though the user is a regular registration user\r\nAND the new LDAP mentioned should be added to test_ebis_user73@mlb.com - test_ebis_user77@mlb.com created in #157499039. (78 purposely left off)\r\n*Note that in the data discovery the 'unregistered user' is called an MLSB user/profile*",
    "custom_steps_separated": null
  },
  {
    "id": 1225628,
    "title": "As a scouting user I want the system to calculate a player's OFP and Group on an International Prospect or Signable Report",
    "section_id": 148062,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157271654",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/Scouting+Calculations\r\nGIVEN a scouting user is logged in with permission to create an International Prospect or International Signable Report\r\n",
    "custom_steps": "WHEN user enters grades on the report for a player",
    "custom_expected": "THEN system should calculate the Overall Future Potential (OFP) Basic and the Group number displayed on the International Workout report on the fly (as the user enters grades) per the provided calculations. \r\nAND the calculation should be different depending on if the report is for a position player or a pitcher\r\nAND calculations should work as detailed below:\r\n A) Pitchers:\r\n\r\nTotal of Fastball Future, Curveball Future, Slider Future, and Other Future is multiplied by 10 and then divided by the total of non-zero values entered.\r\n\r\nB) Position Players:\r\n\r\nTotal of Hitting Future, Power Future, Arm Strength Future and Fielding Future is multiplied by 2.\r\n\r\nIf OFP adjusted is not within 3 points of OFP Basic then comments are required explaining the reason for the difference\r\n\r\nGroup # is directly related to adjusted OFP and is subject to the following ranges:\r\n\r\nGroup 1 – 56 through 80\r\nGroup 2 – 50 through 55\r\nGroup 3 – 46 through 49\r\nGroup 4 – 41 through 45\r\nGroup 5 – less than 40",
    "custom_steps_separated": null
  },
  {
    "id": 1225706,
    "title": "New Scouting User IDs",
    "section_id": 148067,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499039",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1526932142,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN four new test users have been set up four intl scouting\r\nAND user is logged with permission to access user accounts page under utilities",
    "custom_steps": "WHEN user views any of the accounts listed below on the user accounts page",
    "custom_expected": "THEN test_ebis_user73@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the new intl-user LDAP. (Scout)\r\nAND test_ebis_user74@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the new intl-user LDAP. (Scout Admin)\r\nAND test_ebis_user77@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the new intl-user LDAP. (Scout Viewer)\r\nAND test_ebis_user75@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the International Reg Admin role and the new intl-user. (BOC Admin and Scout Admin)\r\nAND test_ebis_user76@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the International Reg Admin role, and the new intl-user. (BOC Admin and Scout)\r\nAND test_ebis_user78@mlb.com should have: Org of BOC, Pro Player Viewer role, as well as the EBIS-INTL-PLAYER-VIEWERS permission, and the new intl-user. (BOC Viewer and Scout Viewer)",
    "custom_steps_separated": null
  },
  {
    "id": 1225708,
    "title": "Scout Clipboard - Permissions",
    "section_id": 148072,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499291",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1526937737,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN the EBIS-WIDGET-SCOUT-CLIPBOARD-VIEWERS permission AND the new intl-user LDAP(EBIS-INTL-USER-NEW) have been added to test accounts (test_ebis_user73@mlb.com and test_ebis_user76@mlb.com)",
    "custom_steps": "WHEN user logs in with one of these accounts",
    "custom_expected": "THEN the Scout Clipboard widget should be visible for these users \r\nBUT users that do not have BOTH of these 2 permissions should not see the Scout Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1225707,
    "title": "Scout Admin Clipboard - Permissions",
    "section_id": 148073,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499265",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1526937756,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20422,
    "display_order": 1,
    "custom_preconds": "GIVEN the EBIS-WIDGET-SCOUTING-ADMIN-CLIPBOARD-VIEWERS permission AND the new intl-user LDAP(EBIS-INTL-USER-NEW) have been added to test accounts (test_ebis_user74@mlb.com and test_ebis_user75@mlb.com)",
    "custom_steps": "WHEN user logs in with one of these accounts",
    "custom_expected": "THEN the scout admin Clipboard widget should be visible for these users \r\nBUT users that do not have BOTH of these 2 permissions should not see the scout admin clipboard",
    "custom_steps_separated": null
  }
]