[
  {
    "id": 196249,
    "title": "As BOC, I want to see a player's service days with his current club",
    "section_id": 28397,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 99,
    "created_on": 1470080610,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "WHEN user runs the MJ Service Batch",
    "custom_expected": "THEN Player's current club MLS is the player's MLS with the Org that is he currently associated with shown in the XX.YYY format.\r\nAND If player was with the same ORG from previous seasons, then this value is the current season service added to the previous season service with that same Org.\r\nAND Updated value should show on the Player profile service tab",
    "custom_steps_separated": null
  },
  {
    "id": 196252,
    "title": "As BOC, I only want service calculations to start after Roster Submission time on Opening Day",
    "section_id": 28397,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121979587",
    "created_by": 99,
    "created_on": 1470081374,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 3,
    "custom_preconds": "GIVEN that user is running the MJ Service Batch",
    "custom_steps": "WHEN calculating service for Opening Day",
    "custom_expected": "THEN the system should only begin to check for Service accruing roster statuses after \"Opening Day Roster submission deadline\" time (set in System dates) \r\nAND if player had a service accruing roster status before the submission time but did not have a service roster status after the submission time, player does not get service for that day\r\nAND To get the time of the transaction, use the time of submission/approval (to be checked in ebis 1)",
    "custom_steps_separated": null
  },
  {
    "id": 196257,
    "title": "As BOC, I can see a day by day breakdown of player's MJ service",
    "section_id": 28397,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121675927",
    "created_by": 99,
    "created_on": 1470082220,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "WHEN user runs the MJ Services Batch",
    "custom_expected": "THEN For all players affected by the MJ service batch, on the Service tab of the player profile, add the section \"Breakdown\" as per wireframe: http://ll2j6l.axshare.com/#p=service\r\nAND The year dropdown is set to current year. We will only start keeping breakdown history from the year Ebis 2.5 goes live\r\nAND Do now show \"Type of Service\" filter dropdown as this will not be implemented before go-live\r\nAND Table is not editable\r\n\r\nAND Show table with following columns (other columns implemented later and should not be added to page)\r\n- Date - Show a row for every date starting from Opening day to Last day of season. Most recent on top\r\n- MJ Roster Status EOD - MJ Roster status for the player at the end of each of those days\r\n- Org EOD - Org of player at end of each date\r\n- MJ service - Check mark if player got service that day.  Blank otherwise\r\n- MJ Day - Start count of service day so 1st day of service would be 1, 2nd day is 2 etc.",
    "custom_steps_separated": null
  },
  {
    "id": 213239,
    "title": "As BOC, I want Major League service to be given to player automatically every night",
    "section_id": 28397,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120766247",
    "created_by": 99,
    "created_on": 1473865559,
    "updated_by": 99,
    "updated_on": 1473868915,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 6,
    "custom_preconds": "![](index.php?/attachments/get/3738)\r\n",
    "custom_steps": "WHEN a player qualifies for service for the upcoming day based on his current Major league roster status",
    "custom_expected": "THEN tick up his MJ service automatically after midnight",
    "custom_steps_separated": null
  },
  {
    "id": 196276,
    "title": "As BOC, I want to manually adjust service calculation by adding or removing service days",
    "section_id": 28398,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 99,
    "created_on": 1470083067,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN user is logged in as BOC and viewing the service tab on a player profile\r\n\r\n",
    "custom_expected": "THEN there is an Edit button to this page. \r\nAND When user hits edit, the \"Adjustments\" column and 'Comments column of the Major League Summary section become editable\r\nAND The Adjustments column only accepts number values - both positive and negative\r\nAND Adjustments can be entered for any row\r\nAND On hitting save, for the altered rows, the 'Days toward 172' and 'Total Season Service' are updated to account for adjustments which can be addition or subtraction. However, the total can never exceed 172\r\nAND The total MLS for the altered year and every subsequent year should get recalculated to show the adjusted Total MLS\r\nAND Appropriate fields in the Service Info Section should also get updated with the new MLS\r\n\r\nAND global AC are followed:\r\n- Floaty button functionality should work\r\n- Once page is in edit mode, the save and cancel button appear\r\n- Cancel reverts to view mode without saving changes\r\n- Comments should follow global guidelines similar to how it works on Attached files",
    "custom_steps_separated": null
  },
  {
    "id": 196277,
    "title": "As BOC, I want to manually add a year to MJ Summary",
    "section_id": 28398,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "127391153",
    "created_by": 99,
    "created_on": 1470083307,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 2,
    "custom_preconds": "GIVEN that BOC is viewing the stats tab on a player profile",
    "custom_steps": "WHEN the page is in EDIT mode",
    "custom_expected": "THEN the MJ Summary has an 'Add Row' option\r\nAND When a row is added, the Year, Club, Days w Club, Adjustments and Comments columns become editable. Other columns stay uneditable\r\nAND The year dropdown only let's you select a year starting from 2004 up until the year of the last or current season. Additionally only show years that do not already have a row in the table. If the player already has a row for every year since 2004 until now, then the dropdown is blank.\r\nAND User can select the Org and enter a number value for Days w Club and Adjustments. \r\nAND On Saving, treat the newly added row just like any other historical service record and adjust the service calculation accordingly. Also rearrange the newly added row chronologically\r\nAND Note that if a manual record was entered for the current year, and if the service batch finds that he has service for the current year, the manual record can be overwritten by the service batch.",
    "custom_steps_separated": null
  },
  {
    "id": 196278,
    "title": "As BOC, I want the MJ Service batch to automatically account for Adjustments",
    "section_id": 28398,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121972369",
    "created_by": 126,
    "created_on": 1470083335,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 3,
    "custom_preconds": "GIVEN logged in as BOC",
    "custom_steps": "WHEN the MJ Service batch is run",
    "custom_expected": "THEN batch should account for manual adjustments made to the player before displaying the updated Service calculations",
    "custom_steps_separated": null
  },
  {
    "id": 203604,
    "title": "As BOC, I want the current year MJ service summary to get updated daily",
    "section_id": 28398,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121967511",
    "created_by": 99,
    "created_on": 1471874004,
    "updated_by": 99,
    "updated_on": 1471895804,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "WHEN the MJ Service Batch is run",
    "custom_expected": "THEN Populate the Major League summary table with the most current information for current season rows when the service batch is run\r\nAND If player has switched Orgs, each Org gets it's own row for that year\r\nAND \"Days with Club\" is the total # of days player spent with the club irrespective of whether he got service or not. If a player was traded, the \"To\" club gets service credit for that day\r\nAND 'Days toward 172' is how many days with this club counted towards service upto a max of 172\r\nAND Total Season service is the total # of service days this season irrespective of Org. Only the row for his most recent Org is populated.\r\nAND Total MLS is his total current MLS for this current season. For rows with previous Orgs, populate with the MLS that the player left the Org with",
    "custom_steps_separated": null
  },
  {
    "id": 196280,
    "title": "A Club/BOC, I want to see Option and Outright info from ebis 1 in ebis 2",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121983991",
    "created_by": 99,
    "created_on": 1470083539,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN user is viewing a player profile",
    "custom_expected": "THEN Add the Transactions tab to the player profile according to the following wireframe: http://ll2j6l.axshare.com/#p=transactions\r\nAND the Outrights and Options collapsible sections (expanded by default) are presen t\r\nAND Info from ebis 1 should be populated in the corresponding fields in ebis 2\r\nAND Note that \"Outright Days - Current Season\" has been removed as a field\r\nAND The Prior Outright field will show either \"No\"or the date of the prior outright if there was one.",
    "custom_steps_separated": null
  },
  {
    "id": 196282,
    "title": "As BOC, I want to calculate Option days for a player",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 99,
    "created_on": 1470083659,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "WHEN user views the Batch tab under System Admin",
    "custom_expected": "THEN there is a new batch under Service called \"Option / Outright Days\"\r\nAND Similar to the MJ service batch, it has a parameter for player ID. \r\nAND It can be run in report mode, test mode and update mode\r\nAND Batch always recalculates from the beginning of the season\r\nAND Player population is the same as MJ Service batch\r\n\r\n\r\nAND If player's MJ Roster status is 'Optioned' at any point during the day, that day counts as an Option day\r\nAND Keep track of how many total Option days the player had in the current season. If player is currently on Option, count the # of days in his current assignment\r\nAND Populate the \"Option Day\" column on the 'Breakdown' section of a player's service page. This should count up similar to 'MJ Day' column\r\nAND Update the 'Option Days - Current Season' and 'Option Days - Current Assignment' fields on the transaction tab.\r\n\r\nAND the results table has the following columns:\r\nPlayer ID\r\nPlayer Name\r\nCurrent Org\r\nCurrent Club\r\nMJ Roster Status\r\nMN Roster Status\r\nOption Days\r\nOutright Days\r\n\r\nAND the following global AC are followed:\r\n- Batch can be aborted\r\n- Show progress bar when processing\r\n- Any errors are returned in results\r\n- Previous batch results can be viewed\r\n- Batch can be run in Test mode where the batch changes can be reversed\r\n- Batch can be run in Update mode where they are actually changed",
    "custom_steps_separated": null
  },
  {
    "id": 196285,
    "title": "As BOC, I want Option days to account for Post game assignments",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768733",
    "created_by": 99,
    "created_on": 1470083776,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "WHEN user runs the  \"Option / Outright Days\" batch\r\nAND player has an Optional Assignment with “Post Game Assignment” checkbox checked",
    "custom_expected": "THEN player does not get an Option day for the date of the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 196286,
    "title": "As BOC, I want option days to account for DFA roster status",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121985299",
    "created_by": 99,
    "created_on": 1470083972,
    "updated_by": 126,
    "updated_on": 1473875043,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 4,
    "custom_preconds": "GIVEN logged in as club or BOC",
    "custom_steps": "WHEN a player's roster status is DFA\r\nAND his previous status was Optioned",
    "custom_expected": "THEN all DFA days also count as Option days",
    "custom_steps_separated": null
  },
  {
    "id": 196287,
    "title": "As BOC, I do not want player to get an option day on the date he is recalled",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768941",
    "created_by": 99,
    "created_on": 1470084073,
    "updated_by": 99,
    "updated_on": 1471873718,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "WHEN user runs the \"Option / Outright Days\" batch\r\nAND player has a Recall transaction",
    "custom_expected": "THEN he does not get an Option day for the date of the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 196281,
    "title": "As BOC, I want to track Outright days for a player",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120769019",
    "created_by": 126,
    "created_on": 1470083623,
    "updated_by": 126,
    "updated_on": 1473878222,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 6,
    "custom_preconds": "GIVEN logged in as club or BOC",
    "custom_steps": "WHEN Major/Minor Outright has been approved for player",
    "custom_expected": "THEN we start counting outright days from the date of the transaction\r\nAND The only roster status that is valid for earning an outright day is a null/blank major league roster status\r\nAND Outright Days will stop reset to zero once a player re–joins a major league club, or the end of the season is reached. \r\nAND The day he gains a Major league roster status does not count toward an Outright day.\r\nAND if player has an Major/Minor Outright with “Post Game Assignment” checkbox checked, then he does not get an Outright day for the date of the transaction\r\nAND \"Outright Days - Current Assignment\" field is populated with the updated value\r\nAND the \"Outright Day\" column populates on the 'Breakdown' section of a player's service page. (This should count up similar to 'MJ Day' column)",
    "custom_steps_separated": null
  },
  {
    "id": 196245,
    "title": "As BOC, I want the Option / Outright / DL days to be counted automatically every night",
    "section_id": 28399,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "125658731",
    "created_by": 126,
    "created_on": 1470080180,
    "updated_by": 126,
    "updated_on": 1473876274,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 7,
    "custom_preconds": "GIVEN logged in as club or BOC",
    "custom_steps": "WHEN a player qualifies for Option/Outright/DL day for the upcoming day based on his current MJ roster status",
    "custom_expected": "THEN he accrues Option/Outright/DL days (based on current MJ roster status) after midnight",
    "custom_steps_separated": null
  },
  {
    "id": 203596,
    "title": "As BOC, I want to see basic service info on the player profile (info from ebis 1)",
    "section_id": 28418,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "121452061",
    "created_by": 99,
    "created_on": 1471874004,
    "updated_by": 99,
    "updated_on": 1471895785,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "WHEN user views the Service tab of a player's profile",
    "custom_expected": "THEN the Service Info subsection of the Service tab exists as shown in wireframe: http://ll2j6l.axshare.com/#p=service\r\nAND \"Super 2\" comes from \"Super Two year\" in ebis 1 (general info section).\r\nAND Rookie Milestone Crossed info comes from ebis 1 general info section. If field is left blank in ebis 2, it means milestone was not yet crossed so player is currently a rookie.\r\nAND in the \"Misc\" session, the \"Year Add C excluded from FA\" and \"DL Exclusion Year\" fields can be ignored and should not be added to the page yet\r\nAND Under the \"Minor League Service\" section, \"Current Season Service\" is a new field so does not need to be populated for this story\r\nAND \"Potential Minor Lg FA\", \"Minor Lg FA Yr\" and \"Highest Level of play\" have already been implemented but should be moved to their correct updated location.\r\nAND Service Info is expanded by default but can be collapsed\r\nAND All fields should be populated with equivalent data from ebis 1\r\nAND Service info in service tab must match the service info in the player header",
    "custom_steps_separated": null
  },
  {
    "id": 203600,
    "title": "As BOC, I want player to get service if he was on the Restricted list due to Violation of Drug testing",
    "section_id": 28418,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120768087",
    "created_by": 99,
    "created_on": 1471874004,
    "updated_by": 126,
    "updated_on": 1471980415,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 2,
    "custom_preconds": "GIVEN that user is running the MJ Service Batch",
    "custom_steps": "WHEN considering the service accruing status \"Restricted\" to give player service",
    "custom_expected": "THEN check the \"Reason for Placement\" on the Restricted list transaction that updated his Roster status.\r\nAND only give service to the player if the Reason for Placement is \"Violation of Major League Drug Testing Program\". \r\nAND if a different reason is selected, the player does not qualify for service unless he has another service accruing roster status on that day",
    "custom_steps_separated": null
  },
  {
    "id": 212111,
    "title": "As BOC, I want to see a day by day breakdown of player's Minor League service days",
    "section_id": 29453,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "125717081",
    "created_by": 99,
    "created_on": 1473691396,
    "updated_by": 99,
    "updated_on": 1473691674,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 1,
    "custom_preconds": "**Wireframe**\r\nhttp://ll2j6l.axshare.com/#p=service",
    "custom_steps": "**AC**\r\nWHEN the user views the breakdown widget in the Service tab of an MN player's profile:",
    "custom_expected": "THEN the user sees the following 4 columns. \r\n- MN Roster Status EOD\r\n- Club EOD (minor league club at end of day if any)\r\n- Mnr Service (LOP at which player got service credit)\r\n- Mnr Day (ticks up with each day of Mnr service)",
    "custom_steps_separated": null
  },
  {
    "id": 212112,
    "title": "As BOC, I want to calculate a player's Minor League service days",
    "section_id": 29453,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "120769711",
    "created_by": 99,
    "created_on": 1473691396,
    "updated_by": 99,
    "updated_on": 1473692024,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 2,
    "custom_preconds": "**Wireframe**\r\nhttp://ll2j6l.axshare.com/#p=service",
    "custom_steps": "WHEN user views a breakdown of an MN player's service\r\n\r\n",
    "custom_expected": "**AC**\r\nTHEN for each day of the season, including the first and last day, if the player had a roster accruing minor league status at any point during the day, he gets one day of MN service.\r\n\r\n**Roster Accruing statuses**\r\n7DL - 7 Day DL\r\n7RH - Rehab 7 Day DL\r\n60D - 60 Day DL\r\n60R - Rehab 60 Day DL\r\nACT - Active\r\nTI - Temporarily Inactive\r\n\r\nAND\r\n- Each minor league club has it's own start date and end date in the Club system dates screen. Use the player's MN club at EOD for each day to determine if that day is in season or not. Do not include post season. \r\n- If player was in multiple MN clubs on the same day, the credit goes to the last MN club that he finished with.\r\n- If player already got Major league service for that day, then player cannot get Minor league service for the same day.\r\n- Update the \"Current Season Service\" field under the Minor League Service section of the Service tab\r\n- Update the current year row in the Minor League Summary table in the Service tab",
    "custom_steps_separated": null
  },
  {
    "id": 212113,
    "title": "As BOC, I want to see a yearly summary of Minor Service on the player's profile from ebis 1",
    "section_id": 29453,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "125703041",
    "created_by": 99,
    "created_on": 1473691396,
    "updated_by": 99,
    "updated_on": 1473692030,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 3,
    "custom_preconds": "**Wireframe**\r\nhttp://ll2j6l.axshare.com/#p=service",
    "custom_steps": "WHEN user views the service tab of an MN player's profile\r\n\r\n",
    "custom_expected": "**AC**\r\n\r\nTHEN\r\n- On the player profile service tab, add the Minor League Summary section as a collapsible section to the page. It should be expanded by default.\r\n- Bring over all Minor lg Service history from ebis 1 and display in this section. \r\n- The Contract Year column, Service Year column and Foreign Year column are OUT OF SCOPE for go-live. All other columns in the table should be populated with data from ebis 1\r\n\r\nAND\r\n- When player has played for multiple Orgs in the same year, each Org has it's own row for that year. ",
    "custom_steps_separated": null
  },
  {
    "id": 212114,
    "title": "As BOC, I want the Minor League Service to be given to player automatically every night",
    "section_id": 29453,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "125716281",
    "created_by": 99,
    "created_on": 1473691396,
    "updated_by": 99,
    "updated_on": 1473692038,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 3127,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "WHEN an MN player qualifies for service for the upcoming day based on his current minor league roster status",
    "custom_expected": "THEN tick up his MN service automatically after midnight",
    "custom_steps_separated": null
  }
]