[
  {
    "id": 1051480,
    "title": "As a user I want to be able to run the No Trade report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139519211",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940731,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 1,
    "custom_preconds": "GIVEN \"No Trade Report\" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND he report will have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1051481,
    "title": "As a user I want to be able to run the Payroll Forecast Report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "137573943",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940731,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 2,
    "custom_preconds": "GIVEN \"Payroll Forecast\" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1051489,
    "title": "As a user I want to be able to run the Top Salaries report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139518649",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496941166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 3,
    "custom_preconds": "GIVEN \"Top Salaries\" is a report in the Report listing widget",
    "custom_steps": "WHEN user selects this report from the widget",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nANd entering the desired prompts and running the report should work and match the requirements\r\nAND the report will have an LDAP associated with it (see story for LDAP)",
    "custom_steps_separated": null
  },
  {
    "id": 1051491,
    "title": "As a user I want to be able to run the Assignment Bonus report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139520643",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496941166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 4,
    "custom_preconds": "GIVEN the user logs in",
    "custom_steps": "WHEN user is in Report listing widget\r\n",
    "custom_expected": "THEN \"Assignment Bonus\" report should be listed. \r\nAND Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.",
    "custom_steps_separated": null
  },
  {
    "id": 1051493,
    "title": "As a user I want to be able to run the Average Salary LRD Report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140095441",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496941166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 5,
    "custom_preconds": "GIVEN \"Average Salary LRD\" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report will have an LDAP associated with it(see story for LDAP)",
    "custom_steps_separated": null
  },
  {
    "id": 1051536,
    "title": "As a user I want to be able to run the Capitalized Payments by Year report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139520493",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941564,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 6,
    "custom_preconds": "GIVEN user logs in",
    "custom_steps": "WHEN user is in Report listing widget\r\n\r\n",
    "custom_expected": "THEN \"Capitalized Payments by Year\" report should be listed in the Report listing widget. \r\nAND Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will have an LDAP associated with it. Please provide the LDAP when the story is delivered and a user id to test the report and security with.",
    "custom_steps_separated": null
  },
  {
    "id": 1051537,
    "title": "Custom Prompt for Capitalized Payments Report",
    "section_id": 124947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146119223",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941564,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 7,
    "custom_preconds": "GIVEN a user is attempting to run the Capitalized Payments Report from Reports Listing Widget",
    "custom_steps": "WHEN user clicks on the hyperlink for the report",
    "custom_expected": "THEN a custom UI prompt should display\r\nAND this prompt should be styled similar to other EBIS custom UI report prompts\r\nAND parameters should match Prompts documentation in wiki (https://wiki.mlbam.com/pages/viewpage.action?spaceKey=EBIS&title=Capitalized+Payments+-+Prompts)",
    "custom_steps_separated": null
  },
  {
    "id": 1060589,
    "title": "As a User, I want to view an existing Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337369",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 1,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests\r\n\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in a player's Winter League History widget\r\n\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window\r\nAND Browser tab info = \"WNTRQ - Last, Roster First\"\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1060590,
    "title": "As a User, I want to edit an existing Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141337431",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 2,
    "custom_preconds": "GIVEN a player already has an existing Winter League Requests",
    "custom_steps": "WHEN user opens existing Winter League Requests\r\n",
    "custom_expected": "THEN an Edit(grey) button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \r\nAND Clicking  Edit will reload the form in edit mode, and a Save(grey) button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND Editable fields will match what is in the provided Data Discovery (Note the special behaviors)\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND Clicking Save will save the transaction and it's current values and reload the transaction in view mode. \r\nAND Required field and format checks will only be made if the transaction is in a post-Approval state.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \r\nAND After a successful save the system will display a successful save blue notification. See Messages #77.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nAND If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1060591,
    "title": "As a BOC User, I want to create a new Winter League Request Transaction",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141872501",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user logs in\r\n",
    "custom_steps": "WHEN user clicks on any of the Create New Icon > Minor League > Assignments > Winter League Request\r\nOR Create New Icon > Major League > Assignments > Winter League Request\r\n\r\n\r\n",
    "custom_expected": "THEN system will check to see if there is an existing Preliminary Request for the same player \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction.\r\nOR If no preliminary transaction already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND The status of preliminary will display in red on the form in view and edit mode\r\nAND Transaction should follow the wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1060592,
    "title": "As a BOC user, I want to submit a Winter League Request to Club",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085227",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user logs in to submit a Winter League request to club",
    "custom_steps": "WHEN BOC has the preliminary form in edit mode or view mode.\r\n\r\n\r\n",
    "custom_expected": "THEN Submit to Club button will be available on the form.The button is blue. \r\nAND Clicking Submit to Club will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. (Global error messaging, modal, pinned errors, red highlight for missing required fields)\r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Pending to Club\"  \r\nAND The status \"Pending to Club\" appears in green on the form in view and edit mode.\r\nAND System reloads the transaction in view mode, and displays a successful approve blue notification. Messages #76.\r\nAND No entry is added to the player's player history.  \r\nAND An Approval item should be generated for BOC Users\r\nAND An Action Item should be generated for Club Users \r\n\r\nNOTE: This is not a standard transaction and should not be subject to the standard rule checks (similar to DL Recertifications)\r\n ",
    "custom_steps_separated": null
  },
  {
    "id": 1060593,
    "title": "As a User, I want to view a player's Winter League Request History on their profile",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864301",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 5,
    "custom_preconds": "GIVEN user is in Professional Players profile",
    "custom_steps": "WHEN user is in Transaction Tab\r\n\r\n",
    "custom_expected": "THEN \"Winter League Request History\" will be displayed on the last collapsible section. \r\nAND it will be expanded by default.\r\nAND Inside the section will be a widget that matches the provided wireframe and data discovery. http://ll2j6l.axshare.com/waivers___transactions.html\r\nAND Pending requests should appear in green\r\nOR If no Winter League Requests exist for the player the section header still going to display but there won't be any table (including the table headers). ",
    "custom_steps_separated": null
  },
  {
    "id": 1060594,
    "title": "As a User, I want to Grant a Winter League Request Transactions",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864061",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 6,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Grant button will be available.\r\nAND User can click Grant button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Granted\r\nAND All other pending requests for the player will be automatically denied when the request is granted\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been granted.\"\r\nAND When request is granted, \"Agreement Reached\" and checkbox will appear on the request\r\nAND BOC Users receive a Notification when Request is Granted\r\nOr Club Users receive a Notification when Request is Granted",
    "custom_steps_separated": null
  },
  {
    "id": 1060595,
    "title": "As a User, I want to Deny a Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142155129",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 7,
    "custom_preconds": "GIVEN a Winter League Request is in pending state",
    "custom_steps": "WHEN user is viewing or Editing the request\r\n\r\n",
    "custom_expected": "THEN Deny(grey) button will be available in both View and Edit mode.\r\nAND User can click Deny button\r\nAND Transaction Status updates to Approved\r\nAND Decision updates to Denied\r\nAND No other request is modified as a result of denying this request\r\nAND If the request was in edit mode, the page will refresh in view mode\r\nOR If the request was in view mode, the page will refresh in view mode\r\nAND Will receive a blue notification message: \"The Winter League Request has been denied.\"\r\nAND BOC Users receive a Notification when Request is Denied\r\nAND Club Users receive a Notification when Request is Denied",
    "custom_steps_separated": null
  },
  {
    "id": 1060596,
    "title": "As a BOC User, I want to delete a Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142473377",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC user has edit permission for the Winter League Request form in Preliminary and Pending to Club states ",
    "custom_steps": "WHEN the form is in view or edit mode\r\n\r\n",
    "custom_expected": "THEN there should a \"Delete\" button on the form in grey\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this Winter League Request?\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted transactions should not appear on the front end or be searchable.\r\nAND Any Approval Items or Action Items related to the deleted Request should be deleted as well",
    "custom_steps_separated": null
  },
  {
    "id": 1060597,
    "title": "As a BOC user, I want to be able to reverse or reverse and suppress a Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142085113",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 9,
    "custom_preconds": "GIVEN BOC logs in\r\nAND Winter League Request is in Approved state",
    "custom_steps": "WHEN user is viewing the transaction in View or Edit mode\r\n\r\n",
    "custom_expected": "THEN \"Reverse\" button will be available in grey\r\nAND Successful reverse notification will be displayed. See Messages #79\r\nAND The transaction status is updated to \"Reversed\"\r\nAND If the Request was originally Granted, the decision on the Request is updated to be Denied.\r\nOR If the Request was originally Denied, the decision on the Request is updated to be Granted.\r\nAND BOC Admins will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the player's Winter League History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.",
    "custom_steps_separated": null
  },
  {
    "id": 1060598,
    "title": "As a User, I want to receive an email when a Winter League Request is submitted to club",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142525267",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 10,
    "custom_preconds": "GIVEN the Winter League Request in Preliminary state",
    "custom_steps": "WHEN user clicks on Submit to Club \r\n\r\n",
    "custom_expected": "THEN upon submitting to club, an email is sent to users defined in the Email Utility\r\n - Subject: Winter League Request\r\n - Body: A Winter League Request has been received on \" + requestDate + \" from club \" + fromTeam + \" of the \" + winterLeague + \" for player \" + playerName + \".\"\r\nAND Emails are generated whether the Request was created in ebis or the Winter League Portal",
    "custom_steps_separated": null
  },
  {
    "id": 1060599,
    "title": "As a User, I want to receive an error if the Winter League Team has 10 pending requests",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141970155",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player\r\nAND the Winter League Team on the request already had 10 pending requests",
    "custom_steps": "WHEN user clicks submit to Club ",
    "custom_expected": "THEN system should check for existing requests from Winter League Team in \"Pending to Club\" status\r\nAND if user finds 10 or more of these requests then system should display message:\"Invalid Winter League Request.  <club> currently have <number pending requests> pending Winter League Requests.\"\r\nAND Hint Text should say:\"The maximum is 10.\"  \r\nAND Clicking Back should return the user to the entry point\r\nAND clicking Override should submit the request",
    "custom_steps_separated": null
  },
  {
    "id": 1060600,
    "title": "As a User, I want to receive an error if Player already has an Approved Winter League Request",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142059295",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 12,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player\r\nAND an APPROVED (granted or denied) winter league request already exists for the player for the current period ",
    "custom_steps": "WHEN user attempts to submit Winter League Request\r\n\r\n",
    "custom_expected": "THEN if request is on or after 6/1, system should look from 6/1 of current year to 5/31 of next year\r\nBUT if request is before 6/1, system should look from 6/1 of last year to 5/31 of current year\r\nAND if system finds an Approved(granted or denied) Winter League Request for the player, for which an agreement was reached system should display message: \"Invalid Winter League Request.  An agreement has already been reached for the Winter League Request granted on <date> for <club>.\"\r\nBUT if system finds an Approved(granted or denied) Winter League Request for the player, for which an agreement was NOT reached system should display message: \"Invalid Winter League Request.  A Request was previously Granted on <date> for <club>.\" ",
    "custom_steps_separated": null
  },
  {
    "id": 1060601,
    "title": "Winter League Requests Permissions - BOC - Minor Transactions",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887591",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in as BOC admin or BOC basic user",
    "custom_steps": "WHEN user attempts to do anything with Winter League Requests\r\n",
    "custom_expected": "THEN BOC Admin users should be able to View, Create, Edit, Grant, Deny, Submit, Reverse, Delete and Search Winter League Requests\r\nBUT BOC Basic Users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 1060602,
    "title": "Winter League Requests Permissions - Club - Minor Transactions",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141887645",
    "created_by": 103,
    "created_on": 1497883535,
    "updated_by": 103,
    "updated_on": 1497883547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 14,
    "custom_preconds": "GIVEN a user is logged in as club basic or club admin user",
    "custom_steps": "WHEN user attempts to do anything with a Winter League Request\r\n",
    "custom_expected": "THEN Club Admin users should be able to  Grant, Deny, and  Update Winter League Requests\r\nBUT Club Basic users should only be able to View and Search Winter League Requests ",
    "custom_steps_separated": null
  },
  {
    "id": 1051482,
    "title": "As a User, I want to search for Winter League Request Transactions",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141864033",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940731,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 15,
    "custom_preconds": "GIVEN the user is in Advance Search page",
    "custom_steps": "WHEN the user selects \"Winter League Request\" under \"Search Type\"\r\n\r\n",
    "custom_expected": "THEN \"Decision\" will be the filters under the Transaction search type\r\nAND Filter will be a Select2\r\nAND Possible Values will be \"Granted\" and \"Denied\"\r\nAND Conducting an advanced search will return the standard result columns for a transaction search\r\nAND \"Decision\" will be included in the result columns",
    "custom_steps_separated": null
  },
  {
    "id": 1051483,
    "title": "As a User, I want to receive an error if the player has an Offseason Assignment",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142073633",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940731,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 16,
    "custom_preconds": "GIVEN a user is attempting to submit a Winter League Request for a player \r\nAND the player selected as an Offseason Assignment",
    "custom_steps": "WHEN user submits Winter League Request",
    "custom_expected": "THEN if  the request is on or after 6/1, system should look for offseason assignments from 6/1 of current year to 5/31 of next year\r\nBUT if request is before 6/1, system should look for offseason assignments from 6/1 of last year to 5/31 of current year\r\nAND if an approved offseason assignment is found system should display message: \"Invalid Winter League Request.  Player was assigned via an Offseason Assignment on <date> to play for <club>.\"",
    "custom_steps_separated": null
  },
  {
    "id": 1051485,
    "title": "As a user I want to be able to run the Winter League Requests report",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143826503",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940745,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 17,
    "custom_preconds": "GIVEN \"Winter League Requests \" is a report in the Report listing widget",
    "custom_steps": " WHEN user selects this report from the widget ",
    "custom_expected": "THEN system should launch the prompts according to the requirements\r\nAND entering the desired prompts and running the report should work and match the requirements\r\nAND the report should have an LDAP associated with it",
    "custom_steps_separated": null
  },
  {
    "id": 1051516,
    "title": "As a User, I want new Winter League Requests entered into the WLP to be sent to ebis",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142333481",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 18,
    "custom_preconds": "GIVEN a RESTful interface for the Winter League Portal exists in EBIS",
    "custom_steps": "WHEN a new Request is created in the WLP",
    "custom_expected": " THEN the following fields should be sent to ebis:\r\n -- Player First Name\r\n -- Player Last Name\r\n -- ebisID (player ID)\r\n -- Requesting Team (ebis club ID)\r\n -- Status: Requested\r\n -- Request Date\r\nAND a new Winter League Request should be created and submitted to Club in ebis, with all relevant submission updates being performed as though it was submitted within ebis, including the appropriate notifications and action items\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1051517,
    "title": "As a User, I want the cancellation of Requests in the WLP sent back to EBIS",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142335165",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 19,
    "custom_preconds": "GIVEN a RESTful interface exists in EBIS for cancelling a Winter League Request in the Winter League Portal",
    "custom_steps": "WHEN a Winter League Request is cancelled in in the WLP",
    "custom_expected": "THEN fields passed in should match the fields passed in for a new request\r\nAND the fields passed in should be:\r\n-- ebisID (player ID)\r\n-- Requesting Team (ebis club ID)\r\n-- Request Date\r\nAND system should find pending to club requests that match the passed in data\r\nAND these requests in EBIS should be deleted\r\nAND system should return a generic JSON object to WLP with a boolean indicating success/failure as well as a list of error messages",
    "custom_steps_separated": null
  },
  {
    "id": 1051518,
    "title": "As a User, I want Agreements Reached sent to ebis",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142343909",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 20,
    "custom_preconds": "GIVEN a RESTful interface exists in EBIS for \"Agreements Reached\" on a Granted Winter League Request in the Winter League Portal",
    "custom_steps": "WHEN an agreement is reached on a granted Winter League Request in in the WLP",
    "custom_expected": "THEN fields passed in should match the fields passed in for a new request \r\nAND fields passed in should be:\r\n -- ebisID (player ID)\r\n -- Requesting Team (ebis club ID)\r\n -- Request Date\r\n -- Agreement Reached Flag\r\n AND agreement Reached checkbox should be checked on the Winter League Request in EBIS\r\nAND system should return a generic JSON object to WLP with a boolean indicating success/failure as well as a list of error messages",
    "custom_steps_separated": null
  },
  {
    "id": 1051519,
    "title": "As a User, I want the granting of Requests sent back to the WLP",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142333473",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 21,
    "custom_preconds": "GIVEN RESTful service between EBIS and WLP for granting requests",
    "custom_steps": "WHEN a Request is granted in EBIS\r\n ",
    "custom_expected": "THEN the following fields should be sent to the WLP\r\n -- ebisID (player_id)\r\n -- Requesting Team (club_id)\r\n -- Request Date (request_date)\r\n -- Status: G  (status)\r\n -- Username granting/denying (username)\r\n AND the fields should be sent as a JSON object with field names noted in parens above",
    "custom_steps_separated": null
  },
  {
    "id": 1051520,
    "title": "As a User, I want the denying of Requests sent back to the WLP",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142334119",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 22,
    "custom_preconds": "GIVEN RESTful service between EBIS and WLP for denying requests",
    "custom_steps": "WHEN a Request is denied in EBIS ",
    "custom_expected": "THEN the following fields should be sent to the WLP:\r\n -- ebisID (player_id)\r\n -- Requesting Team (club_id)\r\n -- Request Date (request_date)\r\n -- Status: D  (status)\r\n -- Username granting/denying (username)\r\nAND the fields should be sent as a JSON object with field names noted in parens above",
    "custom_steps_separated": null
  },
  {
    "id": 1051521,
    "title": "Winter League ETL",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144487497",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 23,
    "custom_preconds": "GIVEN ETL for Winter League request data has been run into EBIS 2.5",
    "custom_steps": "WHEN user views any field related to WLRs that have been brought over from EBIS1",
    "custom_expected": "THEN all data values in EBIS 2.5 should match the values in EBIS1",
    "custom_steps_separated": null
  },
  {
    "id": 1051522,
    "title": "Winter League Request Bridging",
    "section_id": 124948,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146112941",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941536,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 24,
    "custom_preconds": null,
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1051490,
    "title": "As a user, I want a custom reports popup for running the DL Summary Report from the reports widget",
    "section_id": 124950,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144375895",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in with permissions to print DL Summary Report\r\n",
    "custom_steps": "WHEN user clicks \"Disabled List Summary Report\" link from the reports listing widget",
    "custom_expected": "THEN a custom EBIS UI prompt modal should display (similar to modal for other reports)\r\nAND prompt filters should match what's listed in the data discovery (https://wiki.mlbam.com/display/EBIS/EBIS4-TXT-5645+Report+Prompts)\r\nAND running the report with the desired prompts should print the report matching the Details and Layout Listed in the wiki (https://wiki.mlbam.com/display/EBIS/EBIS4-TXT-5642+Report+Details , https://wiki.mlbam.com/display/EBIS/EBIS4-TXT-5641+Report+Layout) ",
    "custom_steps_separated": null
  },
  {
    "id": 1051492,
    "title": "As a user I want to be able to run the DL Recert Report from Recertification screen",
    "section_id": 124950,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141179131",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 4,
    "custom_preconds": "GIVEN the user is in Recertification utility\r\n\r\n",
    "custom_steps": "WHEN user is on the \"DL Recertification\" tab for BOC and Club users\r\n\r\n",
    "custom_expected": "THEN there is a \"Run Report\" button. \r\nAND Clicking this will launch the report prompt for the DL Recertification Maintenance report.\r\nAND The prompt should default to the current year and allow the user to adjust the parameters and run the report, just like if they accessed this from the Report screen.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1051525,
    "title": "As a user I want to be able to sort the Recertification utility",
    "section_id": 124950,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143084111",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941647,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 5,
    "custom_preconds": "GIVEN the user is in Recertification utility",
    "custom_steps": "WHEN user clicks on the header of any column in the Recertification screen\r\n",
    "custom_expected": "THEN system will sort by the column. \r\nAND For the Recert due column, the sort should be on the first date displayed. \r\nAND Column headers should now be blue\r\nAND The column being sorted on should have global styling added(grey background and the red up/down arrow next to the column header)",
    "custom_steps_separated": null
  },
  {
    "id": 1051496,
    "title": "As a User, I want to Navigate to and view the filter section of the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143579745",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 1,
    "custom_preconds": "GIVEN \"Arb Eligibles\" appears as a tab under the Major Contracts dashboard",
    "custom_steps": "WHEN user clicks on the Major Contracts link in the left nav",
    "custom_expected": "THEN system should open the dashboard\r\nAND the tabs should appear in alpha order\r\nAND the layout of the Utility should match the provided wireframe\r\nAND the fields should match the provided data discovery\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1051497,
    "title": "As a User, I want to view Past Year Results on Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143803041",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility ",
    "custom_steps": "WHEN user navigates to the Arb Eligibles Utility ",
    "custom_expected": "THEN user should be able to select a past year from the Year filter\r\n AND clicking View button should load the utility with players from the year selected\r\n AND population displayed should also meet the criteria set by the other filters\r\n AND the layout of the result columns should match the provided wireframe\r\n AND the columns should match the provided data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1051498,
    "title": "As a User, I want to view the Arb Status filter on Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143975369",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility ",
    "custom_steps": "WHEN user views Arb Eligibles Utility ",
    "custom_expected": "THEN system should allow user to filter utility population based on players' status\r\n AND possible values should match the provided Data Discovery\r\n AND mapping should follow the attached Salary Arb Status Chart",
    "custom_steps_separated": null
  },
  {
    "id": 1051499,
    "title": "As a User, I want to view the Signed/Unsigned filter on Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143975427",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 4,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility ",
    "custom_steps": "WHEN user views Arb Eligibles Utility ",
    "custom_expected": "THEN system should allow user to filter utility population based on players' status\r\n AND possible values should match the provided Data Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1051500,
    "title": "As a User, I want to view the Elig Count filter on Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143975417",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility \r\n",
    "custom_steps": "WHEN user views Arb Eligibles Utility ",
    "custom_expected": "THEN system should allow user to filter utility population based on players' Eligible Count\r\n AND possible values should match the provided Data Discovery\r\nAND logic for determining Elig Count should be pulled from ebis1",
    "custom_steps_separated": null
  },
  {
    "id": 1051501,
    "title": "As a User, I want to Update the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143579769",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 6,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility",
    "custom_steps": "WHEN user clicks on 'Edit' button on the Utility\r\n",
    "custom_expected": "THEN system will reload the utility in Edit Mode\r\nAND All of the filters will become disabled when the form is in edit mode\r\nAND The columns that are editable will match the provided wire and data discovery (not all columns are editable)",
    "custom_steps_separated": null
  },
  {
    "id": 1051502,
    "title": "As a User, I want to save changes to the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144045773",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 7,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility in edit mode",
    "custom_steps": "WHEN enters new value and clicks on 'Save' button \r\n\r\n",
    "custom_expected": "THEN system will save all of the entered values, and reload the utility in View mode\r\nAND A successful blue notification should also display.",
    "custom_steps_separated": null
  },
  {
    "id": 1051503,
    "title": "As a User, I want to View the Hearing Info modal on the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143579889",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 8,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility in edit mode",
    "custom_steps": "WHEN user clicks on 'INFO' button on a Player's row\r\n\r\n",
    "custom_expected": "THEN system will open the Hearing Info modal\r\nAND The layout of the modal will match the provided wireframe\r\nAND The fields will match the provided data discovery\r\nAND If the Arb Utility is in view mode when the modal is opened, the modal will be in view mode\r\nAND If the Arb Utility is in edit mode when the modal is opened, the modal will be in edit mode\r\nAND Clicking the Ok button or the 'X' will close the modal",
    "custom_steps_separated": null
  },
  {
    "id": 1051504,
    "title": "As a User, I want to Update the Hearing Info modal on the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144046205",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 9,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility in edit mode",
    "custom_steps": "WHEN user clicks on 'INFO' button on a Player's row\r\n\r\n",
    "custom_expected": "THEN system will open the player's Hearing Info modal in edit mode\r\nAND The editable fields will match the provided data discovery and wire\r\nAND Clicking the Ok button or the 'X' will close the modal and retain the changes made to the modal\r\nAND Clicking 'Cancel' will close the modal and discard the changes made to the modal\r\nAND The Info button will appear blue for players who have data entered into their modal",
    "custom_steps_separated": null
  },
  {
    "id": 1051505,
    "title": "As a User, I want to Save updates made to the Hearing Info modal on the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144048901",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 10,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility in edit mode",
    "custom_steps": "WHEN user clicks on 'INFO' button on a Player's row to open the Hearing info Modal in Edit mode\r\n\r\n",
    "custom_expected": "THEN there will be an Ok button and an 'X' icon\r\nAND When either one is the clicked, the modal will close, retaining any changes made\r\nAND When the modal is closed, the Utility will still be in edit mode\r\nAND There will be a Save button on the Utility\r\nAND Clicking Save will save all changes, including those made to the Modal, and reload the utility in View mode\r\nAND There will be a Cancel button on the Utility\r\nAND Clicking Cancel will call all changes, including those made to the Modal, and reload the utility in View mode",
    "custom_steps_separated": null
  },
  {
    "id": 1051506,
    "title": "As a User, I want to switch between different player's Hearing Info modals on the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144051675",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 11,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility edit mode\r\nAND the system allows users to quickly enter Hearing Details and Filing Numbers for each player without having to open and close each player's modal",
    "custom_steps": "WHEN user clicks on 'INFO' button on a Player's row to open the Hearing info Modal(both edit and view mode)\r\n\r\n\r\n",
    "custom_expected": "THEN there will be a Previous button and a Next button\r\nAND Clicking the Previous button will refresh the Modal with the hearing info of the previous player appearing in the utility\r\nOR Clicking the Next button will refresh the Modal with the hearing info of the next player appearing in the utility\r\nAND If any data had been entered, it will be retained when the player is switched",
    "custom_steps_separated": null
  },
  {
    "id": 1051507,
    "title": "Rule to Prevent Saving the Utility with Blank Rows",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144119933",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 12,
    "custom_preconds": "GIVEN a user is logged in with permissions for editing the Arbitration Eligible Utility\r\nAND user is viewing the utility in edit mode\r\nAND user has added a new row to the utility\r\nBUT user has NOT entered a player name in the new row",
    "custom_steps": "WHEN user clicks Save\r\n",
    "custom_expected": "THEN system should run required field rule check on \"Player Name\"\r\nAND system should throw a blocker message preventing user from saving utility\r\nAND clicking Back should return the user to the utility in edit mode ",
    "custom_steps_separated": null
  },
  {
    "id": 1051508,
    "title": "As a BOC User, I want to delete a player from the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143580103",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 13,
    "custom_preconds": "GIVEN the BOC user is in Arb Eligibles Utility in Edit mode\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on 'Delete' button next to a player (Delete icon is available on each player's row.)\r\n",
    "custom_expected": "THEN system will remove the player from the arb list\r\nAND If the user saves their updates, the Utility will reload in view mode and the player will not appear in the list\r\nAND If the user cancels their updates, the Utility will reload in view mode and the player will return to the list\r\nNOTE: This can be done at any time, even after the results are marked final",
    "custom_steps_separated": null
  },
  {
    "id": 1051509,
    "title": "As a User, I want to finalize the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143667121",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 14,
    "custom_preconds": "GIVEN the BOC user is in Arb Eligibles Utility in Edit or View mode \r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on Finalize button on the Utility in both Edit and View Mode",
    "custom_expected": "THEN system locks the Utility and prevent Club users from making updates \r\nAND Stops the population from updating automatically (no players added or removed)",
    "custom_steps_separated": null
  },
  {
    "id": 1051510,
    "title": "Arb Eligibles Utility Permissions - BOC MJ Contracts",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144053131",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496940964,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 15,
    "custom_preconds": "GIVEN Arb Eligibles Utility permission varies for different BOC users",
    "custom_steps": "WHEN user is in Arb Eligibles Utility\r\n",
    "custom_expected": "THEN BOC Admin will have the following permission \r\n - View, Update, Finalize\r\nAND BOC Basic will have the following permission\r\n - View",
    "custom_steps_separated": null
  },
  {
    "id": 1051484,
    "title": "As a User, I want to Initialize Arb Eligible Tables for the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143666381",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940985,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 16,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility \r\nAND user is viewing the Arb Eligible Utility ",
    "custom_steps": "WHEN user chooses a year that has not been initialized",
    "custom_expected": "THEN all filters (not Year) should be disabled \r\nAND an Initialize button should be available\r\n AND clicking Initialize should load the arb eligibles tables\r\nAND this should include setting Arb Status and Elig Counts, based on calculations provided by Dev\r\n AND after Initialize is clicked, all filters should become active",
    "custom_steps_separated": null
  },
  {
    "id": 1051486,
    "title": "As a User, I want the Arb Eligibles tables to get updated when transactions that affect arb eligibility occur",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143980707",
    "created_by": 103,
    "created_on": 1496940731,
    "updated_by": 103,
    "updated_on": 1496940985,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 17,
    "custom_preconds": "GIVEN a transaction exists that impacts the Arb Eligibility ",
    "custom_steps": "WHEN a transaction occurs that affects arb eligibility",
    "custom_expected": "THEN the arb eligible table should be updated\r\n AND this should include but should not be limited to adding players, removing players, setting Elig Counts, and updating Arb Status",
    "custom_steps_separated": null
  },
  {
    "id": 1051529,
    "title": "Arbitration ETL",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144120377",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 18,
    "custom_preconds": "GIVEN an ETL for Arbitration data has been run into EBIS 2.5 from EBIS 1",
    "custom_steps": "WHEN user views any field related to Arbitration that has been brought over from EBIS1",
    "custom_expected": "THEN values in all fields brought over to EBIS 2.5 should match values populated in EBIS 1",
    "custom_steps_separated": null
  },
  {
    "id": 1051530,
    "title": "As a user I want hitting cancel to trigger a modal asking me to confirm that I want to cancel changes",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146009513",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 19,
    "custom_preconds": "GIVEN user is in Arb Eligible Utility in edit mode\r\nand user makes some changes",
    "custom_steps": "WHEN user clicks on Cancel\r\n\r\n",
    "custom_expected": "THEN Clicking cancel while in edit mode will trigger the \"Are you sure modal\"\r\nAND Clicking yes cancels changes and toggles the form back to view mode\r\nAND Clicking no dismisses the modal and the form remains in edit mode",
    "custom_steps_separated": null
  },
  {
    "id": 1051531,
    "title": "As a user I want Finalizing the arb utility to trigger a modal asking me to confirm that I want to Finalize",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146112643",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 20,
    "custom_preconds": "GIVEN user is in arb utility\r\n\r\n",
    "custom_steps": "WHEN user clicks on Finalize",
    "custom_expected": "THEN system will trigger the \"Are you sure modal\"\r\nAND Clicking yes cancels changes and toggles the form back to view mode\r\nAND Clicking no dismisses the modal and the user is returned to the form",
    "custom_steps_separated": null
  },
  {
    "id": 1051532,
    "title": "As a User, I want to export the Arb Eligibles Utility to excel",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144052933",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 21,
    "custom_preconds": "GIVEN a user is logged in with permissions for the Arb Eligibles Utility\r\n",
    "custom_steps": "WHEN user is in Arb Eligibles Utility\r\n\r\n\r\n",
    "custom_expected": "THEN there will be an Export button on the form\r\nAND Clicking the Export button will run the Arb Eligibles Utility Export Report",
    "custom_steps_separated": null
  },
  {
    "id": 1051533,
    "title": "Arbitration Bridging",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146112909",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 22,
    "custom_preconds": null,
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1051534,
    "title": "As a user I want to always see the table headers when scrolling through Arbitration eligible players",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145140737",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 23,
    "custom_preconds": "GIVEN user is view Arbitration eligible players list in arb utility ",
    "custom_steps": "WHEN user scrolls through Arbitration eligible players table\r\n\r\n",
    "custom_expected": "THEN user should see the table headers when scrolling through\r\nAND the table should have a fixed height and show 8-10 rows of data at a time",
    "custom_steps_separated": null
  },
  {
    "id": 1051535,
    "title": "As a user I want to see arrows on the previous and next buttons on the info modal",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145953315",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941382,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 24,
    "custom_preconds": "GIVEN the user is in Arb Eligibles Utility",
    "custom_steps": "WHEN user opens the Hearing Info modal in edit or view mode\r\n\r\n",
    "custom_expected": "THEN user should see arrows on the previous and next buttons on the info modal\r\n\r\nWireframe:\r\nhttp://30ac5x.axshare.com/#p=hearing_modal\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1051523,
    "title": "As a BOC User, I want to add a player to the Arb Eligibles Utility",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "143580095",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941584,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 25,
    "custom_preconds": "GIVEN the BOC user is in Arb Eligibles Utility in Edit mode\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on 'Add Player' button on the page",
    "custom_expected": "THEN system will add a new row to the bottom utility\r\nAND the table will auto scroll to the newly added row\r\nAND the Player column of the new row will be an autocomplete search that mimics the global quick search functionality (both in display and population)\r\nAND Selecting a player will populate the following columns:\r\n -- Org\r\n -- EOS MLS\r\n -- Pos\r\n -- Elig Count\r\n -- Arb Status (if applicable, if not leave blank)\r\n -- PY Salary\r\n -- PY+1 (if applicable, if not leave blank)\r\nNOTE: This can be done at any time, even after the results are marked final",
    "custom_steps_separated": null
  },
  {
    "id": 1051524,
    "title": "Arb Eligibles Utility Permissions - Club MJ Contracts",
    "section_id": 124951,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144053277",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941613,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 26,
    "custom_preconds": "GIVEN Arb Eligibles Utility permission varies for different Club users",
    "custom_steps": "WHEN user is in Arb Eligibles Utility\r\n\r\n",
    "custom_expected": "THEN Club Admin will have the following permission\r\n - View, Update\r\nAND Club Basic will have the following permission\r\n - View",
    "custom_steps_separated": null
  },
  {
    "id": 1051515,
    "title": "As a user I want merging 2 International Player profiles to send the information to LARI",
    "section_id": 124954,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253907",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941522,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 3,
    "custom_preconds": "GIVEN an International Player Profile has already been sent to LARI",
    "custom_steps": "WHEN the International Player Profile associated with a player ID a that has already been sent to LARI is merged with another International Player Profile ",
    "custom_expected": "THEN the information should be communicated to LARI. \r\nAND fields and methods of communication should follow documentation found here: https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1051526,
    "title": "Fix UI of Advanced Search for smaller screens",
    "section_id": 124960,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144237799",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941353,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 1,
    "custom_preconds": "GIVEN user logs in on screen sizes below 768px",
    "custom_steps": "WHEN the user goes to Advanced Search\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN Remove the \">\" to the right of Search For\r\nAND Move the Search for dropdown beneath the text Search for\r\nAND Move the Saved Searches dropdown beneath the Search for dropdown\r\nAND Make the Search button span the full width of the button container\r\n\r\nWireframe:\r\nhttp://7xflwf.axshare.com/#p=mobile_2",
    "custom_steps_separated": null
  },
  {
    "id": 1051528,
    "title": "As a User, I want to Export the DL Summary Report to Excel",
    "section_id": 124960,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "145222903",
    "created_by": 103,
    "created_on": 1496941353,
    "updated_by": 103,
    "updated_on": 1496941353,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 3,
    "custom_preconds": "GIVEN  EBIS1 \"Run Excel Report\" version of the \"Disabled List Summary Report\" has been replicated in EBIS2",
    "custom_steps": "WHEN user navigates to reports widget\r\n\r\n",
    "custom_expected": "THEN the popup to run the \"Disabled List Summary Report\" report should have a \"Run Excel\" button which generates this document\r\nAND  columns and layout of the printed excel report will match ebis1",
    "custom_steps_separated": null
  },
  {
    "id": 1051511,
    "title": "Update Draft & Scouting tab title to be consistent on all profiles",
    "section_id": 124960,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "144289983",
    "created_by": 103,
    "created_on": 1496940964,
    "updated_by": 103,
    "updated_on": 1496941598,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18741,
    "display_order": 4,
    "custom_preconds": "GIVEN user is on Professional/ Domestic Amateur Player Profile ",
    "custom_steps": "WHEN user is in Draft & Scouting tab of the player profile \r\n\r\n",
    "custom_expected": "THEN Professional profile tab should read Draft & Scouting\r\nAND Domestic Amateur profile tab should read Draft & Scouting",
    "custom_steps_separated": null
  }
]