[
  {
    "id": 1291816,
    "title": "As a user I want to save a Place on 15-Day IL transaction for a player",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291798",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578692723,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "Given user have creating a place on 15-day IL transaction for a player",
    "custom_steps": "When clicking a save button will save the transaction",
    "custom_expected": "THEN The system will  will reload the transaction in view mode\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND After a successful save the system will display a successful save blue notification.  \r\nAND Transaction will be in Post-Approval state only if Required field and format checks are made",
    "custom_steps_separated": null
  },
  {
    "id": 1291817,
    "title": "As a user I want the Earliest Reinstatement Date calculated correctly on a 15-Day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291799",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578693470,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "Given user is creating a 15-Day IL Transaction for a player",
    "custom_steps": "WHEN user enter the placement date field on a Place on 15 -Day IL transaction",
    "custom_expected": "THEN the system will calculate and display the proper Earliest Reinstatement Date. \r\nAND Earliest Reinstatement for a 15-Day IL placement will always be on the 16th Day after the Placement Date (including the Placement Date).",
    "custom_steps_separated": null
  },
  {
    "id": 1291818,
    "title": "As a user I want to submit a place on 15-day IL to the BOC for approval",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291800",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "Given user has created 15 day-IL transaction",
    "custom_steps": "WHEN user open 15-day transaction in the status of  \"preliminary\"",
    "custom_expected": "THEN Submit to BOC button is available to Club users when the preliminary or rejected form is in edit mode or view mode. The button is blue. \r\nAND Submit button is available for BOC users when the preliminary or rejected form is in edit mode or view mode. The button is grey.\r\nAND Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"\r\nAND System reloads the transaction in view mode, and displays a successful submit blue notification. \r\nAND Once the transaction has been successfully submitted, system creates an entry in Player's Player History: Code = IL15J, Description = Place on 15-day IL\r\nAND From Org/Club and To Org/Club fields [required]\r\nAND Entry appears in green font\r\nAND Once the transaction has successfully been submitted, the system sets the player's pending major league roster status to \"15-Day IL\"\r\n\r\nSee Business Rules: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nMessages: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_steps_separated": null
  },
  {
    "id": 1291819,
    "title": "As a user I want to be able to delete a place on 15-Day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291801",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578931250,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "Given user has IL transaction for a player And the transaction is in a Preliminary or in a Rejected state",
    "custom_steps": "WHEN user click Delete AND clicks Yes, after the system generates generate a warning Are you sure you want to delete this? \r\nThis is a permanent action that cannot be undone.\r\n\r\n\r\nSee Button Guidelines: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2281404",
    "custom_expected": "THEN If user confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted transactions should not appear on the front end or be searchable.",
    "custom_steps_separated": null
  },
  {
    "id": 1291820,
    "title": "As a BOC user I want to be able to reject a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291802",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578931663,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "Given user is logged in as a BOC and there is a IL Transaction with the status of Submitted to BOC",
    "custom_steps": "When Clicking Reject\r\n\r\n\r\nSee Rejection Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Button Guidelines: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2281404\r\n\r\nSee Messages: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "THEN BOC Approvers see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in the Submitted to BOC state. \r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. See Messages #78.\r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Reverse player's pending Major League Roster status.\r\nAND Remove pending player history entry.\r\nAND Remove any action items that were generated regarding the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291821,
    "title": "As a BOC Approver I want to receive an Approval item when a Place on 15-Day IL is submitted",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291803",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578932320,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "Given user is logged in as a BOC and there is a IL Transaction with the status of Submitted to BOC",
    "custom_steps": "WHEN on the Approval widget\r\n\r\n\r\nSee Submission Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Clipboard Rules (#1): \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309008",
    "custom_expected": "THEN The IL Transaction will appear as an Approval item\r\nAND If Flags exist for the transaction, they display in the Flags column of the Approvals widget. \r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1291822,
    "title": "As a BOC user I want to approve a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291804",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578933067,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 7,
    "custom_preconds": "Given a user is logged in as BOC and there is a IL Transaction with a status Submitted to BOC",
    "custom_steps": "When Click Approve",
    "custom_expected": "THEN Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved. \r\nAND Player's Player History Update: Code = IL15J Description = Place on 15-day IL, From Org/Club and to Org/Club fields to be in black font.\r\n\r\n\r\nSee Approval Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Messages: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_steps_separated": null
  },
  {
    "id": 1291823,
    "title": "As a user I want to be able to Cancel creation of or changes to a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291805",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578933302,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 8,
    "custom_preconds": "Given user has a IL Transaction submitted to BOC\r\n\r\ncba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "Select a player from player history who has a IL Transaction Submitted to BOC \r\nClick on edit mode and click Cancel",
    "custom_expected": "* Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\n* If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\n* If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\n* If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1291824,
    "title": "As a Club user I want to receive a notification when my place on 15-Day IL transaction is approved, rejected or reversed",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291806",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578933504,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 9,
    "custom_preconds": "Given user is logged in as a Club user and is on notification clipboard\r\n\r\ncba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "When a IL Transaction is move to Approve, Reject, or Reverse\r\n\r\nSee Submission Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Clipboard Rules (#2, #3, #4): \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309008",
    "custom_expected": "* Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Approved. \r\n* Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Rejected. \r\n* Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\n* \"Description\" will be a hyperlink.\r\n* Clicking on the description hyperlink of any of these notifications will open the place on the transaction in view mode in the same window/tab. \r\n* Player's name will be a hyperlink.\r\n* Clicking on the player's name hyperlink of any of these notifications will open the player's profile in view mode in the same window/tab on the Player History tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1291825,
    "title": "As a BOC user I want to be able to reverse a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291807",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578933746,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 10,
    "custom_preconds": "Given user is logged in as BOC Approver\r\n\r\ncba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "When there is a IL Transaction whose status is Approved\r\n\r\nSee Reverse Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Messages: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "* BOC Approvers see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \r\n* Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\n* Successful reverse notification will be displayed. See Messages #79\r\n* The transaction status is updated to \"Reversed\"\r\n* Display reversed transaction in player history with Voided: in front of the transaction description. Example: Voided: Major/Minor Outright\r\n* Users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\n* Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\n* Clicking \"Suppress\" will suppress the transaction.\r\n* When a transaction is suppressed it will be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\n* Clicking \"Reverse\" or \"Reverse and Suppress\", will check if the current transaction is the most recent approved transaction. \r\n* If the transaction is not the most recent approved transaction for the player, then the user will receive an error message. \r\nMessage \"Only the player's latest approved transaction can be reversed.\"\r\n* User will ONLY have the back option. Clicking Back will close the modal and return the user to the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291826,
    "title": "As a user I want to edit an existing place on 15-day IL transaction for a player",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291808",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578947928,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 11,
    "custom_preconds": "Given there is a IL Transactionî for a player and it is an a preliminary or rejected state\r\n\r\ncba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "When the IL Transaction in edit mode\r\n\r\nBusiness Value: \r\nAllows users to make changes to an existing Place on 15-Day IL transaction. \r\n\r\nSee Data Discovery: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308147",
    "custom_expected": "* Clicking Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode). \r\n* In Preliminary and Rejected, the Club and BOC users will be able to edit all portions displayed on the form.\r\n* Edit only gives clubs access to attach new files in any state other than Preliminary or Rejected. Club cannot edit existing attachments or any other part of transaction.\r\n* BOC is able to edit all fields in all states except for Approved and Reversed transactions. \r\n* In Approved and Reversed (including suppressed) transactions, edit only gives BOC access to attach new files, edit existing attachments, update \"Comments\" and \"BOC Notes\" fields, as well as edit any other part of the transaction not specifically stated as not editable post-approval in the data discovery.\r\n* Clicking Save will always reload the form in View",
    "custom_steps_separated": null
  },
  {
    "id": 1291827,
    "title": "As a BOC user I want to see flags if certain rule checks fail",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291809",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 12,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "Business Value: \nBOC users want to be warned if certain rule checks have failed. They should see these flags on the Approvals clipboard as well as on the form itself. \n\nSee Flags #23.03: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309213\n\nAcceptance Criteria:\n* BOC Approvers see Flags on a submitted transaction only if there is one or more flags set for the form. \n* Clicking on the flags icon opens a popover with the flags that are currently set for the form. (global functionality and styling)\n* Flags display on the Approvals item if it is present.\n* 23.03 - If the Exam Date entered on the transaction is more than 15 days ago, then the flag \"Exam Date entered is more than 15 days ago.\" appears.\n* Flags are dismissed on Approve and Reject.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291828,
    "title": "As a Club user I want to receive an Action Item if a Place on 15-Day IL transaction is still missing an attachment with a label = \"Standard Form of Diagnosis\" 3 days after the entered Roster Affected Date",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291815",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 13,
    "custom_preconds": "See Clipboard Rules (#7): \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Clipboard\r\n\r\nGIVEN a submitted or approved Place on 15 Day IL transaction exists\r\nAND Roster Affected Date on the transaction is 3 or more days in the past\r\nAND transaction form is still missing an attachment with a label \"Standard Form of Diagnosis\"\r\nAND \"Nightly Notifications\" Is a batch option under \"General\" on the batch screen",
    "custom_steps": "WHEN user runs the \"Nightly Notification\" batch (or when it runs nightly)",
    "custom_expected": "THEN the system will check to see if any submitted or approved place on 15-day MJ IL transactions are missing an attachment with the label \"Standard Form of Diagnosis\" that has a Roster Affected Date that is three or more days ago\r\nAND if yes, an action item should be generated for the Player's Club MJ Transactions Admin according to the Clipboard Requirements\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink should open the place on 15-day IL transaction in edit mode in the same window/tab\r\nAND player's name should be a hyperlink\r\nAND clicking on the player's name hyperlink should open the player's profile in view mode in the same window/tab on the Player History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1291829,
    "title": "As a user I want to be able to add a new Authorized Signatory from a Place on 15-Day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291811",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578950239,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 14,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "Wireframe: \r\nhttp://b6mbog.axshare.com/#p=add_new_signatory_or_negotiator\r\n\r\nAcceptance Criteria: \r\n* The Authorized Signatory field on the transaction will only contain a list of the Authorized Signatories with MJ Transactions checked off in the Auth Signatories widget, that belong to the Org for which this transaction is being done. (Org displayed on the transaction) \r\n* A \"New\" link appears above the Authorized Signatory field in edit mode if the user has edit capabilities for the authorized signatory widget. If they do not have permissions, the New link does not appear.\r\n* Clicking \"New\" will launch a modal that allows the user to enter a new Authorized Signatory for the player's Org. \r\n* The checkbox associated with the form the user is adding a new signatory from will be auto checked.\r\n* The Save button will be disabled until all required fields have been populated.\r\n* Clicking \"Save\" will add the authorized signatory to the system and close the modal, with the \"Authorized Signatory\" field pre-populated with the newly added Authorized Signatory. \r\n* The Authorized SIgnatory will be added to the authorized signatory widget and will appear for the Org for all users that have permission to view that Org's Authorized Signatories.\r\n* Clicking Cancel will cancel the addition of the authorized signatory, and return the user to the form.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291830,
    "title": "As a user, I want the Last Game date to populate based on the player's Last Game Stats",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291812",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 15,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "See Data Discovery: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2304294\n\nAcceptance Criteria: \n* System will populate the Last Game Date field with the latest date that appears on the stats table for that player. \n* If more than one date appears on the stats table, the most recent date will be used. \n* All stats that appear on the the stats table will be used to populate the date. \n* If no stats appear for the player, the field will remain blank.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291831,
    "title": "As a user, I want my action item to be removed when I attach a SFD to a Place on 15 Day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291813",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 16,
    "custom_preconds": "GIVEN a club user has received an action item that SFD upload is required on a Place on 15 Day IL transaction",
    "custom_steps": "WHEN user uploads a file is to the Place on 15 Day with a \"Standard Form Diagnosis label\"",
    "custom_expected": "THEN on save or approve, the system will check if there are any action items associated with that transaction\r\nAND if an action item is found, the item will be removed from the Club's Action Item's Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1291832,
    "title": "As a user I want to be able to print a Notice of Disposition for a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291814",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578950852,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 17,
    "custom_preconds": "Given user has a IL Transaction\r\n\r\ncba change, Injured list, mj - place on 15 day IL, printing",
    "custom_steps": "Click on Print it should open a menu where the user can choose to print a \"Notice of Disposition\"",
    "custom_expected": "* Users that have permission to Print from the form will see a \"Print\" button on the transaction in view or edit mode. \r\n*Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in English if the language on the player's profile is set to anything other than Spanish. \r\n* Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in Spanish if the language on the player's profile is set to Spanish. \r\n* The English pdf will follow the English Notice of Disposition format.\r\n* The Spanish pdf will follow the Spanish Notice of Disposition format",
    "custom_steps_separated": null
  },
  {
    "id": 1291833,
    "title": "As a user I want to be able to print a Standard Form of Diagnosis for a place on 15-day IL transaction",
    "section_id": 156855,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291815",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578951357,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 18,
    "custom_preconds": "Given user has a IL Transaction\r\n   \r\ncba change, Injured list, mj - place on 15 day IL, printing",
    "custom_steps": "Clicking on Print should open a menu where the user can choose to print a Standard Form of Diagnosis as long as the Injury is NOT set to Concussion",
    "custom_expected": "* Selecting \"Standard Form of Diagnosis\" will generate a PDF of the Standard Form of Diagnosis.\r\n* The PDF will follow the Standard Form of Diagnosis format.\r\n* Users that have permission to Print from the form will see a \"Print\" button on the transaction in view or edit mode.",
    "custom_steps_separated": null
  },
  {
    "id": 1291834,
    "title": "As a user I want to be able to create a new Place on 15-Day IL transaction for a player from their Player History",
    "section_id": 156856,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291739",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN user clicks \"Create New\" button on the Player History widget for all players. \r\n\r\ncba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "WHEN Selecting \"Place on 15-Day IL\" from the Create New will check to see if there is an existing Preliminary, Submitted or Rejected Place on 15-Day IL transaction for the same player created within 15 days of the current date.",
    "custom_expected": "THEN If a preliminary or rejected place on 15-day IL transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If a submitted transaction already exists, the system will load the existing transaction in View Mode instead of opening a new transaction.\r\nOR If no preliminary, submitted or rejected transaction created within the last 15 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND Transaction should follow the wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1291835,
    "title": "As a user I want to receive an error if the player I'm attempting to place on the 15-Day IL is at the MN level",
    "section_id": 156856,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291740",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578952061,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "Given user is placing a player to 15-Day IL at MN Level",
    "custom_steps": "WHEN user Select a player that has either a pending roster status in minor league level \r\nOr pending roster status is at the minor league level",
    "custom_expected": "THEN the user will receive an error  when processing pending roster status in minor league level\r\nAND Error should pop up This transaction is for Major League players only\r\nAND Clicking Back will close the modal and return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1291836,
    "title": "As a Club user I want to be prevented from initiating a transaction for a player that does not belong to my Club",
    "section_id": 156856,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291741",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a Club admin user is in a Professional Players profile that doesn't belong to this club",
    "custom_steps": "WHEN user initiates a transaction by Selecting \"Place on 15-Day IL\" on the Create New menu for that player",
    "custom_expected": "THEN a blocking message displays. \r\n**Message**\r\n**Body:** \"You do not have permission to create a transaction for a player that belongs to another Organization.\"\r\n**Hint Text:**\"If you believe you have received this message in error, please contact the BOC.\"  \r\n**Button(s):** Back\r\nAND Clicking Back will return the user to the entry point.",
    "custom_steps_separated": null
  },
  {
    "id": 1291878,
    "title": "As a Club user I want to be prevented from initiating a transaction for a player that does not belong to my Club",
    "section_id": 156856,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291761",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, on create rule\r\n\r\nGIVEN a Club admin user is in a Professional Players profile that doesn't belong to the club",
    "custom_steps": "WHEN user initiates a transaction by Selecting \"Place on 15-Day IL\" on the Create New menu for that player",
    "custom_expected": "THEN a blocking message displays. \r\nMessage\r\n**Body:** \"You do not have permission to create a transaction for a player that belongs to another Organization.\"\r\n**Hint Text:** \"If you believe you have received this message in error, please contact the BOC.\"\r\n**Button(s):** Back- Clicking Back will return the user to the entry point.",
    "custom_steps_separated": null
  },
  {
    "id": 1291879,
    "title": "As a user I want to receive an error if the player I'm attempting to transfer to the MJ 15-Day IL is at the MN level",
    "section_id": 156856,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291762",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, on create rule\r\n\r\nGIVEN a player's Pending Roster Status is at the minor league level",
    "custom_steps": "WHEN user creates \"Transfer to 15-Day IL\" from the Major League Create New menu for that player\r\nAND clicks Submit or Approve",
    "custom_expected": "THEN\r\n-The user will receive an error\r\n-If the player does not have a pending roster status, then the current roster status is used.\r\n\r\n**Message**\r\n**Title:** \"Error\"\r\n**Body:** \"This transaction is for Major League players only.\"\r\n**Button(s):** Back-Clicking Back will close the modal and return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1291837,
    "title": "As a user I want to receive an error if the placement date on my IL transaction precedes the last game date.",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291785",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "Given user has place a player on 15 Day IL\r\nAND the user put the placement date before the last game date",
    "custom_steps": "WHEN user Click \"Submit\" or \"Approve\"",
    "custom_expected": "THEN the system will throw the following error \"The player cannot be placed on the IL before his Last Game Appearance of \"\r\nAND the error message will be replaced with the date entered on the form for the player's Last Game Appearance. \r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291838,
    "title": "As a user I want to receive an error if the Last Game Date entered on a IL transaction is in the future",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291786",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578954723,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "Given user has entered a IL transaction for future date\r\n\r\ncba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "On player history widget create a \"IL transaction\" select a date after the  Last Game Date and Click \"Submit\" or \"Approve\"",
    "custom_expected": "* Last Game Date must not be a future date.\"\r\n* Clicking Back will close the modal and return the user to the transaction.\r\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291839,
    "title": "As a user I want to receive an error if the Exam Date entered on a IL transaction is in the future",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291787",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578954910,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "Given user is about to create a IL Transaction\r\n\r\ncba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "On player history widget create a IL transaction under exam date select the last game date and click Submit or Approve\r\n\r\nSee Business Rule #1.08: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308669\r\nSee Error Message #15: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "*Exam Date must not be a future date.\"\r\n*Click Back will close the modal and return the user to the transaction.\r\n*Click Ignore and Continue (only available for the BOC) will ignore the     error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291840,
    "title": "As a user I want to receive an error if the Injury Date entered on a IL transaction is in the future",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291788",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1578954961,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "Given user is about to create a \"IL Transaction\" \r\n\r\ncba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "On player history widget create a transaction \r\nSelect the future date for injury date and click Submit or Approve\r\n\r\nSee Business Rule #1.09: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308669\r\n\r\nSee Error Message #11: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "*\"Injury Date must not be a future date.\"\r\n* Clicking Back will close the modal and return the user to the transaction.\r\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291841,
    "title": "As a user I want to receive an error if the I'm attempting to place a player on the IL out of season",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291789",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579125706,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "Given user is creating a IL Transaction for a player  \r\n\r\ncba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "On player history widget create a transaction for a player that is out of season\r\nClick Submit or Approve\r\n\r\nSee Business Rule #1.05: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308669\r\n\r\nSee Error Message #5: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_expected": "*\"The player must be placed between the open and closing date of the season, from {0} to {1}.\"\r\n* {0} should be replaced with the start of Spring Training system date.\r\n* {1} should be replaced with the player's Club's Last Day of Season system date.\r\n* Clicking Back will close the modal and return the user to the transaction.\r\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291842,
    "title": "As a user I want to receive an error if the placement date entered on a IL transaction is after the Roster Affected Date",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291790",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579012742,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "Given BOC and club user logged in with the permission to create 15 IL tx\r\nAND user is creating a \"IL Transaction\" for a player\r\nAND Entered the placement date after roster affected date",
    "custom_steps": "WHEN user Click Submit or Approve",
    "custom_expected": "THEN System should display error message of  \"Placement Date must be on or before Roster Affected date.\"\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.\r\n\r\nSee Business Rule #1.06: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308669\r\n\r\nSee Error Message #6: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291843,
    "title": "As a user I want to receive a warning if the exam date entered on my 15-Day IL is more than 15 days ago",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291791",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579013803,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 7,
    "custom_preconds": "Given user is creating a \"IL Transaction\" for a player \r\nAND user create a transaction for a player select the date for Exam Date to 15 days prior to current date",
    "custom_steps": "WHEN user Click \"Submit\" or \"Approve",
    "custom_expected": "THEN the system will display the error \"Exam Date entered is more than 10 days ago. Please enter the most recent exam date for the player.\"\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue will ignore the error and continue with the transaction.\r\n\r\nSee Business Rule #1.15: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308669\r\n\r\nSee Error Message #7: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291844,
    "title": "As a user I want to receive an error if the date of injury on a place on 15-day IL is prior to a subsequent assignment to the minor league",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291792",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 8,
    "custom_preconds": "GIVEN user login logged in as BOC or club \r\nAND create a 15 - day IL for a player that has approved Major/Minor Outright, Optional Assignment, or accepted Return of Rule 5 Selection transaction with a transaction date after the Date of Injury and before the Placement Date.",
    "custom_steps": "WHEN Clicking \"Submit\" or \"Approve\"",
    "custom_expected": "THEN the system will displaying an error message\r\n**Message**\r\n**Body:** \"Date of injury is prior to subsequent assignment(s) from the Major Leagues.\"\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.\r\n\r\nSee Business Rule #2.05: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message #23: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291845,
    "title": "As a user I want to receive an error if the player I am creating a place on 15-day IL for has a pending or approved transaction after the entered assignment date",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291793",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 9,
    "custom_preconds": "Given user is creating a \"IL Transaction\" for a player who has pending or approved transaction \r\nAND Select a player that has a pending \"IL transaction\" if the Placement date is before the latest approved or pending (Pending to Club, Submitted to BOC) transaction date for the player. if it is, an error will display",
    "custom_steps": "WHEN user Click \"Submit\" or \"Approve\"",
    "custom_expected": "THEN the system displays the error message of \"A transaction cannot occur before the date of <Roster Name Last Name>'s latest approved or pending transaction, on <TX Date>\".\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.\r\n\r\n\r\nSee Business Rule #2.07: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message #19: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291846,
    "title": "As a user I want to receive an error if the player I'm creating a place on 15-Day IL transaction for does not have a valid MJ roster status",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291794",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 10,
    "custom_preconds": "Given user is creating a IL Transaction for a player who does not have Valid MJ Roster\r\nAND user opens 15 Day IL transaction",
    "custom_steps": "WHEN user clicking \"Submit\" or \"Approve\"",
    "custom_expected": "THEN the system will display the error message of \"Player must be Active, or Active Pending Contract to be placed on the IL.\"\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\n\r\nSee Business Rule #2.04: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message #12: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291847,
    "title": "As a user I want to receive an error if attempting to place a player on the 15-Day IL too early",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291795",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579014610,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 11,
    "custom_preconds": "Given user is creating a IL Transaction for a player \r\nAND Select a player from player history create a IL Transaction and set the date 3 days prior to Club season",
    "custom_steps": "WHEN user Click \"Submit\" or \"Approve\"",
    "custom_expected": "THEN the system will display the error message of \"Player cannot be placed on 15 Day IL more than {0} days before the start of their Club's season.\"\r\nand the system should be replaced with the system value - currently \"3\".\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.\r\n\r\nSee Business Rule #2.06: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message #60: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_steps_separated": null
  },
  {
    "id": 1291848,
    "title": "As a user, I want to receive an error if the player I am attempting to place on the 15 Day IL has stats from a game played on the Placement Date or from a game played after the Placement date if there is a doubleheader exception",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291796",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 12,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "See Business Rule #2.15: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\n\nSee Error Messages #63: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\n\n\nSee Wireframe: \n(Global form error & warning hanILing) \nhttp://7xflwf.axshare.com/#p=errors___warnings\nhttp://7xflwf.axshare.com/#p=warnings\n\nAcceptance Criteria: \n* Clicking \"Submit\" or \"Approve\" (all places where onSubmit rules are fired) will check if the player has any stats from a game played on or after the Placement Date. If stats for a game played on the Placement date and the doubleheader checkbox is not checked, then show an error.  \n* If the doubleheader checkbox is checked, then the player may have stats from a game that occurred on the same day as the Placement date but not after. If stats from a game that occurred after the Placement date are found, then show an error. \n* The system will check for all stats found on the stats table. \n**Message**\n**Body:**\"Stats have been found for player on {0}.\"\n* {0} to be replaced with the game date that the system found stats for as \"mm/dd/yyyy\" \n* Clicking Back will close the modal and return the user to the transaction.\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291849,
    "title": "As a user I want to receive an error if I have back or futuredated my placement date more than 3 days",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291797",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 13,
    "custom_preconds": "Given user is logged in as BOC or Club and Viewing the MJ Roster Widget\r\n\r\n\r\ncba change, Injured list, mj - place on 15 day IL, on submit rule",
    "custom_steps": "When user select a player\r\nCreate a ñ15-Day ILî transaction and backdate or future date transaction more than 3 days from current date\r\nClick Submit as a (Club) or Click Approve(BOC)\r\n\r\nSee Business Rule #2.08: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2308147\r\n\r\nSee Error Message #18: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "* Placement Date must be within 3 days of submission.\"\r\n* Clicking Back will close the modal and return the user to the transaction.\r\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291880,
    "title": "As a user I want to receive an error if the player I'm creating a transfer to 15-Day IL transaction for does not have a valid MJ roster status",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291753",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 14,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, on submit rule\r\n\r\nGIVEN a player's pending (or current if pending is not populated) major league roster status is not 7-Day Concussion IL or Rehab 7-Day Concussion IL.",
    "custom_steps": "WHEN the user is creating a transfer to 15-Day IL transaction for that player\r\nAND \"Submit\" or \"Approve\"",
    "custom_expected": "THEN \r\nAn error will be shown.\r\n\r\n**Message**\r\n**Body:** \"This player is not on the 7 Day Concussion IL. His status is listed as {0}.\"\r\n-Clicking Back will close the modal and return the user to the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291881,
    "title": "As a user I want to receive an error if the player I am creating a transfer to 15-day IL for has a pending or approved transaction after the entered assignment date",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291754",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579015414,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 15,
    "custom_preconds": "Given user is creating a IL transaction and player has a pending or approved transaction after the entered assignment date\r\n\r\ncba change, Injured list, mj IL - transfer to 15 day IL, on submit rule",
    "custom_steps": "When clicking Submit or Approve\r\n\r\n\r\nSee Business Rule #3.05: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2352684\r\n\r\nSee Error Message #19: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676",
    "custom_expected": "* A transaction cannot occur before the date of the player's latest approved or pending transaction, on <TX Date>.\r\n* Clicking Back will close the modal and return the user to the transaction.\r\n* Clicking Ignore and Continue (only available for the BOC) will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291882,
    "title": "As a user I want to receive an error if I am transferring a player to the 15-Day IL before day 15 of his placement",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291755",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 16,
    "custom_preconds": "See Business Rule #3.07.1\r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #89: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nGIVEN a user is attempting to submit a Transfer to 15 Day IL transaction\r\nAND the Transfer Date  on the transaction is fewer than 15 Days after original IL Placement Date",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN system should fire an error message stating:\r\n\"Player should not be transferred to the 15-Day IL until day 15 of his placement\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nAND Clicking Ignore and Continue (only available for the BOC) should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1291883,
    "title": "As a user I want to receive an error if I have backdated my placement date more than 3 days",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291756",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579016547,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 17,
    "custom_preconds": "See Business Rule #3.06: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #29: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\n'GIVEN a user is attempting to submit a Transfer to 15 Day IL transaction for a player\r\nAND Transfer Date on the transaction is backdated more than 3 days",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should fire an error message stating:\r\n\"Transfers to the 15 day IL cannot be backdated more than 3 days.\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue (only available for the BOC) should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1291884,
    "title": "As a user I want to receive an error if the player I'm attempting to transfer to the 15-Day IL is at the MN level",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291757",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579016638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 18,
    "custom_preconds": "See Business Rule #3.03: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #15: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nGIVEN a user is attempting to submit a Transfer to 15 Day IL transaction for a player\r\nAND the player has a pending level of play is not a minor league level",
    "custom_steps": "WHEN user creates tx",
    "custom_expected": "THEN the user will receive an error\r\nAND if the player does not have a pending roster status, then the current roster status should be used\r\nAND the message should be as follows:\r\n\"Title: \"Error\"\r\nBody: \"This transaction is for Major League players only.\"\r\nButton(s): Back\"\r\nAND clicking Back will close the modal and return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1291885,
    "title": "Error if attempting to submit a Transfer to 15-day IL transaction without the \"Received CDF\" checkbox checked",
    "section_id": 156857,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291758",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 19,
    "custom_preconds": "See Business Rule #3.07.2:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #73:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a club or BOC user is attempting to submit or approve a Transfer to 15 Day IL transaction for a player\r\nAND \"Received CDF\" checkbox on the form is NOT checked",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check if the \"Received CDF\" checkbox is checked\r\nAND if box is not checked, then system should show an error\r\nAND message should be as follows:\r\nBody: \"You must provide a completed Concussion Diagnostic Form in order for the player to be placed on the IL for a concussion.\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue (only available for the BOC) should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1291850,
    "title": "Place on 15-Day IL Permissions - BOC - Major Transactions",
    "section_id": 156858,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291759",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "Given user is logged in as BOC",
    "custom_steps": "WHEN viewing a IL Transaction \r\n\r\nRoles and Permissions: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2304252",
    "custom_expected": "THEN BOC admin user:\r\n* Can view and Print all major league transactions [Club and BOC] in all states for Major League Players.\r\n* Can view all flags for all transactions and transaction attachments in all states.\r\n* Can create, delete, edit, e-sign and submit all Major league transactions for Major League players. \r\n* Can Approve, Reject, Reverse and Suppress all Major League transactions and see associated Flags.\r\nAND BOC basic User:\r\n* Can view and Print all major league transactions in all states for Major League Players but cannot make any changes or e-sign.\r\n* Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1291851,
    "title": "Place on 15-Day IL Permissions - Club - Major Transactions",
    "section_id": 156858,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291760",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "Roles and Permissions: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2304252\n\nAcceptance Criteria: \nADMIN: \n* Club users with this role can view and print all major league transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs too.\n \n      However, there are exceptions:\n      1. No Transactions that are in Suppressed state\n      2. They cannot see \"BOC Notes\" field\n\n* Club users with this role Can view all APPROVED (no other states) major league transactions including other club's Major League transactions or BOC only transactions with the following exceptions:\n \n      1.  Cannot see BOC Notes field for any transaction\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\n \n* Can create, delete, submit, edit, attach files, and e-sign all Majnor League transactions for Major League players on their Org's roster or if they are the\"From Org\" or \"To Org\".\n\n\nBASIC:\n* Club users with this role can view and print all major league transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs too.\n\n          However, there are exceptions:\n                  1. No Transactions that are in Suppressed state\n                  2. They cannot edit or change these transactions (Basic only)\n                  3. They cannot see \"BOC Notes\" field\n \n* Club users with this role Can view all APPROVED (no other states) major league transactions including other club's Major League transactions or BOC only transactions with the following exceptions:\n \n    1.  Cannot see BOC Notes field for any transaction\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291890,
    "title": "Transfer to 15-Day IL Permissions - Club - Major Transactions",
    "section_id": 156858,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291743",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in as a club admin or viewer",
    "custom_steps": "WHEN user attempts to perform any action on a Transfer to 15 Day IL transaction",
    "custom_expected": "THEN if the user is a CLUB ADMIN the user should be able to view and print all Transfer to 15 Day IL(MJ) transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs too.\r\nBUT user should NOT be able to see \"BOC Notes\" field\r\nAND user should NOT be able to view transactions that are in Suppressed state\r\nAND club users with this role should be able to view all APPROVED (no other states) Transfer to 15 Day IL(MJ) transactions including other club's Transfer to 15 Day IL(MJ) transactions\r\nBUT user should NOT be able to see BOC Notes field for any Transfer to 15 Day IL(MJ) transactions\r\nAND user should NOT be able to see the Comments field for any Transfer to 15 Day IL(MJ) transactions unless the logged in Org is the From Org or To Org. (Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org)\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should be able to create, delete, submit, edit, attach files, and e-sign all Transfer to 15 Day IL(MJ) transactions for Major League players on their Org's roster or if they are the\"From Org\" or \"To Org\".\r\n\r\nBUT if user is logged in as CLUB VIEWER\r\nTHEN user should be able to view and print all Transfer to 15 Day IL(MJ) transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs too\r\nBUT user should NOT be able to see Transactions that are in Suppressed state\r\nAND user should NOT be able to edit or change these transactions (Viewer only)\r\nAND user should NOT be able to see \"BOC Notes\" field\r\nAND club users with this role should be able to view all APPROVED (no other states) Transfer to 15 Day IL(MJ) transactions including other club's Major League transactions or BOC only transactions \r\nBUT user should NOT be able to see BOC Notes field for any transaction\r\nAND user should NOT see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1291891,
    "title": "Transfer to 15-Day IL Permissions - BOC - Major Transactions",
    "section_id": 156858,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291744",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN user is logged in as a BOC admin or viewer",
    "custom_steps": "WHEN user attempts to perform any action on a Transfer to 15 Day IL(MJ) transaction",
    "custom_expected": "THEN if user is a BOC ADMIN they should be able to view and Print all Transfer to 15 Day IL(MJ) transactions in all states for Major League Players\r\nAND user should be able to view all flags for all Transfer to 15 Day IL(MJ) transactions attachments in all states\r\nAND user should be able to create, delete, edit, e-sign and submit all Transfer to 15 Day IL(MJ) transactions for Major League players\r\nAND user should be able to Approve, Reject, Reverse and Suppress all Transfer to 15 Day IL(MJ) transactions and see associated Flags\r\n\r\nBUT if user is a BOC VIEWER\r\nTHEN user should be able to view and Print all Transfer to 15 Day IL(MJ) transactions in all states for Major League Players \r\nBUT user should not be able to make any changes or e-sign\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states",
    "custom_steps_separated": null
  },
  {
    "id": 1291852,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a place on 15-Day IL transaction with a placement date after the current date",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291749",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579017070,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "Given user is logged in as BOC \r\nAND Select a player from player history that has pending IL Transaction change the placement date with current date",
    "custom_steps": "WHEN user Click \"Approve\"",
    "custom_expected": "THEN the system will display the following error message, \"This transaction cannot be approved unless the transaction date is on or before the current date.\"\r\nAND Clicking Back will close the modal and return the user to the transaction.\r\n\r\n\r\nSee Business Rule #2.16: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message #75: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_steps_separated": null
  },
  {
    "id": 1291853,
    "title": "As a BOC user I want approving a place on 15-day IL transaction to create an entry in the daily transaction bulletin",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291750",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL",
    "custom_steps": "Acceptance Criteria:\n* When a Place on 15-day IL transaction is approved it should appear on the current Pending Daily Transaction Bulletin as \"Place on 15-day IL - Earliest Reinstatement Date [ insert earliest reinstatement date]\"\n* When a Place on 15-day IL transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed. If it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Place on 15-day - Earliest Reinstatement Date [ insert earliest reinstatement date] - Reversed\" \n* When a Place on 15-day IL transaction is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed. from the daily bulletin",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291854,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a place on 15-Day IL transaction without entering comments to explain a change to injury details",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291751",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL, on approve",
    "custom_steps": "See Business Rule #2.17: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\n\nSee Error Message #22: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\n\nSee Wireframe: \n(Global form error & warning hanILing) \nhttp://7xflwf.axshare.com/#p=errors___warnings\nhttp://7xflwf.axshare.com/#p=warnings\n\nAcceptance Criteria:\n* Clicking \"Approve\" will check if there have been edits made to any of the Injury Details after the transaction was submitted EXCEPT for checking SFD. This rule is also checked on \"Save\" if the transaction is in a post-approved state. If yes, and nothing has been entered in the \"Comments\", then show an error. \n**Message**\n**Body:** \"You must enter comments if updating Injury Details.\"\n* Clicking Back will close the modal and return the user to the transaction.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291855,
    "title": "As a BOC user, I want to receive a warning if I attempt to approve a Place on 15 day IL transaction without the Last Game Date complete",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291752",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579017596,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "Given user is logged in as a BOC and has 15-Day IL Transaction\r\n\r\ncba change, Injured list, mj - place on 15 day IL, on approve",
    "custom_steps": "Click Approve \r\n\r\nSee Business Rule #2.17.1: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\r\n\r\nSee Error Message # 86: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\r\n\r\n\r\nSee Wireframe: \r\n(Global form error & warning hanILing) \r\nhttp://7xflwf.axshare.com/#p=errors___warnings\r\nhttp://7xflwf.axshare.com/#p=warnings",
    "custom_expected": "* Will check if the Last Game Date has been populated. If not, then a warning will be shown.\r\nMessage: \"Last Game Date has not been populated for the Player.\" \r\n* Clicking Back will close the modal and return the user to the transaction. \r\n* Clicking Ignore and Continue will ignore the error and continue with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291886,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a transfer to 15-Day IL transaction with a placement date after the current date",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291747",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "See Business Rule #3.13: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #75: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to Approve a Transfer to 15-day IL transaction with an assignment date after the current date",
    "custom_steps": "WHEN user clicks or \"Approve\"",
    "custom_expected": "THEN system should fire an error message stating:\r\n\"This transaction cannot be approved unless the transaction date is on or before the current date.\"\r\nAND only a Back button should be available\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1291887,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a transfer to 15-Day IL transaction without entering comments to explain a change to injury details",
    "section_id": 156859,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291748",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, on approve",
    "custom_steps": "See Business Rule #3.14: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2352684\n\nSee Error Message #22: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\n\nAcceptance Criteria:\n* Clicking \"Approve\" will check if there have been edits made to any of the Injury Details after the transaction was submitted other than checking off the \"Received SFD\" or \"Received CDF\" checkboxes. This rule is also checked on \"Save\" if the transaction is in a post-approved state. If yes, and nothing has been entered in the \"Comments\", then show an error. \n**Message**\n**Body:** \"You must enter comments if updating Injury Details.\"\n* Clicking Back will close the modal and return the user to the transaction.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291856,
    "title": "As a user I want to receive an error if saving a place on 15-Day IL transaction with missing required fields or other on save rule violations",
    "section_id": 156860,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291783",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL, on save rule",
    "custom_steps": "See Business Rules: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\n\nSee Error Messages: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\n\nAcceptance Criteria:\n* For transactions that are in a submitted or higher state, clicking \"Save\" will check the rules detailed in the business rules document linked above. \n* If any of the rules have been violated, the user will receive an error.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291857,
    "title": "As a BOC user I want to receive a notification if a Club user saves a submitted or higher transaction with an SFD attached",
    "section_id": 156860,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291784",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "cba change, Injured list, mj - place on 15 day IL, on save rule",
    "custom_steps": "See Business Rules: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2351723\n\nSee Clipboard #6: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309008\n\nAcceptance Criteria:\n* For transactions that are in a submitted or higher state, clicking \"Save\" will check if a file attachment has been added that has an upload label of \"Standard Form of Diagnosis\". \n* If yes and the saving user is a Club, then a notification should be sent to the BOC. \n* This notification should only be sent once per transaction. (Only on the initial save after attach - not every save thereafter).",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291858,
    "title": "As a user I want to receive an error if the player I'm attempting to place on the 15-Day IL has a submitted waiver request",
    "section_id": 156861,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291779",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a MJ-Place on 15 Day IL tx for a player\r\nAND selected player has a submitted waiver request (Request Bulletin not yet sent)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Player with a submitted waiver request may not be assigned. The waiver request should be deleted before re-submitting the assignment.\"\r\nAND Clicking Back should close the modal and return user to the tx\r\nAND clicking Ignore and Continue should ignore the error and continue with tx (BOC Only)",
    "custom_steps_separated": null
  },
  {
    "id": 1291859,
    "title": "As a user I want to receive a warning if the player I'm attempting to place on the 15-Day IL has previously secured waivers",
    "section_id": 156861,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291780",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a MJ-Place on 15 Day IL tx for a player\r\nAND player has any secured waivers (waivers in effect on profile)\r\nAND Injury Date on the IL placement tx is either:\r\n-Before the Waiver Request Date\r\nOR\r\n-Between the Waiver Request Date and the Claim Period Expiration Date",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Previously secured {0} waivers for this player will be cancelled as a result of this placement.\"\r\nAND {0} should be replaced with the waiver type\r\nAND Clicking Back should close the modal and return user to the tx\r\nAND clicking Ignore and Continue should ignore the error and continue with tx",
    "custom_steps_separated": null
  },
  {
    "id": 1291860,
    "title": "As a user I want to receive a warning if the player I'm attempting to place on the 15-Day IL has any pending waiver requests",
    "section_id": 156861,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291781",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is logged in as a Club or BOC user\r\nAND user is attempting to Submit a MJ-Place on 15 Day IL tx for a player\r\nAND selected player has a current pending waiver request",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should throw error \"Player has pending {0} waiver request(s) that will be cancelled as a result of this placement.\"\r\nAND {0} should be replaced with the waiver type\r\nAND Clicking Back should close the modal and return user to the tx\r\nAND clicking Ignore and Continue should ignore the error and continue with tx",
    "custom_steps_separated": null
  },
  {
    "id": 1291861,
    "title": "User wants to receive error when placing player who has Claimed waivers on 15 Day IL before Withdrawal Expiration",
    "section_id": 156861,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291782",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN there is a claimed TRD waiver Request for a player\r\nAND no WCA has been submitted for the player\r\nAND user is attempting to submit/approve a Place on 15 Day IL tx for this player \r\nAND injury date is either before waiver request date OR between waiver request date and Withdrawal Period Expiration date",
    "custom_steps": "WHEN user clicks submit/approve",
    "custom_expected": "THEN system should throw warning ñPlayer has claimed TRD waiver request that will be cancelled as a result of this placement.î \r\nAND if user overrides the warning the player's waivers will be cancelled on approve of the IL placement",
    "custom_steps_separated": null
  },
  {
    "id": 1291892,
    "title": "As a user I want to receive a error/warning if the player has a 15 Day IL status and the request date is before the earliest reinstatement date",
    "section_id": 156861,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291742",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "GIVEN an MJ player has one of the following Current or Pending MJ League statuses:\r\n\t7 Day Concussion IL\r\n\tRehab 7 Day Concussion IL\r\n\t15 Day IL\r\n\tRehab 15 Day IL\r\n\t60 Day IL\r\n        Rehab 60 Day IL\r\nOR an Optioned player has a Minor League IL status of: \r\n\t7 Day IL\r\n\tRehab 7 Day IL\r\n\t60 Day IL\r\n\tRehab 60 Day IL \r\nAND a user is attempting to request waivers for the player \r\nAND request date for the waivers is before earliest reinstatement date from the  player's most recent IL placement or transfer",
    "custom_steps": "WHEN user clicks \"Submit\" on the waiver request",
    "custom_expected": "THEN clicking submit should generate a blocker message ñIneligible Waiver Request. [Last Name], [First Name] is on the IL, and has not yet served his minimum period of inactivity. He may have waivers requested on him starting [IL Reinstatement Date].î, which should be overrideable for BOC",
    "custom_steps_separated": null
  },
  {
    "id": 1291862,
    "title": "As a user I want to be able to create a new Transfer to 15-Day IL transaction for a player",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291763",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579106799,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is on a Player History\r\nAND   player MJ league status is 7 Day Concussion IL\r\n\r\ncba change, Injured list, mj IL - transfer to 15 day IL",
    "custom_steps": "WHEN selecting Create New, \"Transactions\", \"Major\", \"Injured list\", Place on 15-day IL\"\r\n\r\nSee Data Discovery: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2304538\r\n\r\nCreate New Map: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2304165\r\n\r\nSee Wireframe: \r\nhttp://vpqzii.axshare.com/#p=player_history\r\nhttp://w6h8fs.axshare.com/#p=transfer_player_to_15-day_IL",
    "custom_expected": "* If a preliminary or rejected transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\n* If a submitted transaction already exists, the system will load the existing transaction in View Mode instead of opening a new transaction.\r\n* If no preliminary, submitted or rejected transaction created within the last 15 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\n* Transaction should follow the wireframe and data discovery.\r\n*Selecting \"Transfer to 15-Day IL\" from the Create New will check to see if there is an existing Preliminary, Submitted or Rejected Transfer to 15-Day IL transaction for the same player created within 15 days of the current date.",
    "custom_steps_separated": null
  },
  {
    "id": 1291863,
    "title": "As a user I want the Earliest Reinstatement Date calculated correctly on a transfer to 15-Day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291764",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579107653,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL\r\n\r\nGIVEN the user is creating a transfer to 15-Day IL transaction",
    "custom_steps": "WHEN enters or changes the Placement Date on a Transfer to 15-Day IL transaction form",
    "custom_expected": "THEN\r\n-The system will calculate and display the proper Earliest Reinstatement Date. \r\n-Earliest Reinstatement for a 15-Day IL placement will be on the 16th Day after the initial placement on the IL (NOT the date on the transfer, but the date the player was initially placed on the IL).",
    "custom_steps_separated": null
  },
  {
    "id": 1291864,
    "title": "As a user I want to edit an existing transfer to 15-day IL transaction for a player",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291765",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a transfer to 15-Day IL transaction exists for a player",
    "custom_steps": "WHEN club or BOC user with edit permissions navigates to the form in view mode",
    "custom_expected": "THEN an Edit button should be available\r\nAND clicking  Edit should reload the form in edit mode, and a Save button should appear in place of the Edit button (no edit button displayed in edit mode)\r\nAND in Preliminary and Rejected, the Club and BOC users should be able to edit all portions displayed on the form\r\nAND edit should only gives clubs access to attach new files(and check SFD checkbox if file is uploaded) and edit auth sig in any state other than Preliminary or Rejected. Club should not be able to edit existing attachments or any other part of transaction\r\nBUT BOC should be able to edit all fields in all states except for Approved and Reversed transactions\r\nAND in Approved and Reversed (including suppressed) transactions, edit should only give BOC access to attach new files, edit existing attachments, update \"Comments\" and \"BOC Notes\" fields, as well as edit any other part of the transaction not specifically stated as not editable post-approval in the data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1291865,
    "title": "As a user I want to save a transfer to 15-day IL transaction for a player",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291766",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN a transfer to 15 Day IL transaction exists for a player",
    "custom_steps": "WHEN a club or BOC user with edit permissions has navigated to the form in edit mode",
    "custom_expected": "THEN a Save button should be available\r\nAND clicking Save should save the transaction and it's current values and reload the transaction in view mode \r\nAND required field and format checks should only be made if the transaction is in a submitted or higher state\r\nAND transaction status should be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status should not change\r\nAND after a successful save the system should display a successful save blue notification. See Messages #77\r\nAND whenever the form is in edit mode, the user should see a \"Cancel\" button on the form in grey",
    "custom_steps_separated": null
  },
  {
    "id": 1291866,
    "title": "As a user I want to cancel creation of or changes to transfer to 15-day IL transaction for a player",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291767",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "GIVEN a club or BOC user is logged in\r\nAND user is attempting to create a new Transfer to 15-Day IL transaction\r\nOR user is attempting to edit an existing transaction\r\nAND user has the form open in edit mode\r\nAND \"Cancel\" button is available on the form",
    "custom_steps": "WHEN user clicks \"Cancel\"",
    "custom_expected": "THEN system should prompt the user to confirm that they wish to cancel the changes they have made\r\nAND if they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction\r\nBUT f they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected\r\nAND if they do not confirm the cancellation then the user should be returned to the form and no action should be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1291867,
    "title": "As a user I want to submit a Transfer to the 15-Day IL to the BOC for approval",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291768",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579120049,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "GIVEN a club or BOC user is logged in\r\nAND user is attempting to submit a Transfer to 15-Day IL tx for a player",
    "custom_steps": "WHEN user has navigated to the form in view or edit mode",
    "custom_expected": "THEN Submit to BOC button should be available to Club users when the preliminary or rejected form is in edit mode or view mode. The button should be blue\r\nAND Submit button should be available for BOC users when the preliminary or rejected form is in edit mode or view mode. The button should be grey\r\nAND clicking Submit should run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message\r\nAND clicking Submit should run the On Submit rules check (each covered in other stories - this story assumes they all pass)\r\nAND after the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \r\nAND system should reload the transaction in view mode, and display a successful submit blue notification. Messages #76\r\nAND if the player's pending MJ roster status is Rehab 7 Day Concussion IL then their pending MJ Roster Status should be set to to Rehab 15 Day IL\r\nAND if the player's pending MJ roster status is 7 Day Concussion IL then the player's pending MJ roster status should be set to to 15 Day IL\r\nAND once the transaction has been successfully submitted, system creates an entry in green font in Player's Player History: Code = TRIL15J, Description = Transfer to 15-Day IL, From Org/Club and To Org/Club fields\r\nAND when a transaction reaches a status of \"Submitted to BOC\" an approval item should be generated and display on the BOC - Major Transactions - Admin's Approvals widget\r\nAND if a file is attached to the transaction, that should be displayed and available for download from the Attachments column of the Approvals widget\r\nAND if Comments are populated on the transaction, they should display in the Comments column of the Approvals widget\r\nAND player name should be a hyperlink in the Approvals widget\r\nAND clicking on the player name should open the Player Profile (defaults to Player History tab) in the same window/tab\r\nAND  \"Type\" should be a hyperlink\r\nAND clicking on the type hyperlink of a submitted transaction should open the submitted transaction in view mode in the same window/tab",
    "custom_steps_separated": null
  },
  {
    "id": 1291868,
    "title": "As a BOC user I want to approve or reject a transfer to 15-day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291769",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579120581,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 7,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL\r\n\r\nGIVEN that BOC wants to Approve or Reject a Transfer",
    "custom_steps": "WHEN BOC is viewing a transaction(in view or edit mode) in Preliminary, Submitted to BOC or Rejected state.",
    "custom_expected": "THEN\r\n   APPROVE:\r\n* BOC Approvers will see an \"Approve\" button in blue when Transaction is in Preliminary, Submitted to BOC and Rejected states.\r\n* Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages.\r\n* Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\n* If the item was in edit mode, it is reloaded in view mode.\r\n* A successful blue notification is displayed that states the transaction was approved. See Messages #80.\r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard.\r\n* Update Player's Player History: Code = TRIL15J Description = Transfer to 15-Day IL, From Org/Club and To Org/Club fields to be in black font.\r\n* If the playerÍs current MJ roster status is Rehab 7 Day Concussion IL, then set the player's MJ Roster Status to Rehab 15 Day IL.\r\n* If the player's current MJ roster status is 7 Day Concussion IL, then set the player's MJ roster status to 15 Day IL\r\nOR\r\n   REJECT:\r\n* BOC Approvers will see a \"Reject\" button in grey when they are viewing a transaction in the Submitted to BOC state only.\r\n* Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories).\r\n* Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\n* Successful reject notification is displayed. See Messages #78.\r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard.\r\n* Reverse player's pending Major League Roster status.\r\n* Remove pending player history entry.\r\n* Remove any action items that were generated regarding the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291869,
    "title": "As a BOC user I want to be able to reverse, suppress or reverse and suppress a Transfer to 15-Day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291770",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 8,
    "custom_preconds": "See Reverse Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nGIVEN user is logged in as BOC and is viewing a Transfer to 15-day IL transaction which is in Approved status",
    "custom_steps": "When BOC user clicks reverse, suppress,  or reverse & suppress",
    "custom_expected": "THEN BOC Approvers should see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state\r\nAND clicking \"Reverse\" should run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run\r\nAND a successful reverse notification should be displayed. See Messages #79\r\nAND the transaction status should be updated to \"Reversed\"\r\nAND any action items that were generated as a result of this transaction being submitted or approved should be removed.\r\nAND system should display reversed transaction in player history with \"Voided\" appended\r\nAND users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode\r\nAND clicking \"Reverse and Suppress\" should first reverse, and then suppress the transaction\r\nAND clicking \"Suppress\" should suppress the transaction\r\nAND when a transaction is suppressed it should be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI\r\nAND clicking \"Reverse\" or \"Reverse and Suppress\", should check if the current transaction is the most recent approved transaction \r\nAND if the transaction is not the most recent approved transaction for the player, then the user should receive an error message stating:\r\n\"Only the player's latest approved transaction can be reversed.\" \r\nAND user should ONLY have the back option\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1291870,
    "title": "As a Club user I want to receive a notification when my Transfer to 15-Day IL transaction is approved, rejected or reversed",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291771",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 207,
    "updated_on": 1579114189,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 9,
    "custom_preconds": "Given user is logged in as Club user and have an 15-day transaction submitted to BOC\r\n\r\ncba change, Injured list, mj IL - transfer to 15 day IL",
    "custom_steps": "When the 15-day IL transactionî has been Approved, Rejected, or Reversed \r\n\r\nSee Submission Updates: \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2352684\r\n\r\nSee Clipboard Rules (#2, #3, #4): \r\nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309008",
    "custom_expected": "* Club that the player belongs to will receive a notification when the transaction is updated to Approved. \r\n* Club that the player belongs to will receive a notification when the transaction is updated to Rejected. \r\n* Club that the player belongs to will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\n* \"Description\" will be a hyperlink.\r\n* Player's name will be a hyperlink.",
    "custom_steps_separated": null
  },
  {
    "id": 1291871,
    "title": "As a BOC user I want to receive a notification if a Club user saves a submitted or higher transaction with an SFD attached",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291772",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 10,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, on save rule\r\n\r\nGIVEN a Club user created transactions that are in submitted or higher state with SFD attached",
    "custom_steps": "WHEN clicking 'SAVE'",
    "custom_expected": "THEN system will check if a file attachment has been added that has an upload label of \"Standard Form of Diagnosis\". \r\nAND If yes and the saving user is a Club, then a notification should be sent to the BOC. \r\nAND This notification should only be sent once per transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1291872,
    "title": "As a user I want to be able to delete a Transfer to 15-Day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291773",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 11,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL\r\n\r\nGIVEN a Transfer to 15-Day IL transaction is still in Preliminary or in Rejected states\r\nAND user has Edit permission",
    "custom_steps": "WHEN user opens the transaction",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted transactions should not appear on the front end or be searchable.",
    "custom_steps_separated": null
  },
  {
    "id": 1291873,
    "title": "As a user I want to be able to add a new Authorized Signatory from a Transfer to 15-Day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291774",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 12,
    "custom_preconds": "GIVEN the user has edit capabilities for the authorized signatory widget  \r\nAND user creating a Transfer to 15-Day IL transaction",
    "custom_steps": "WHEN user clicks on 'New' link above the Authorized Signatory field",
    "custom_expected": "THEN system will launch a modal that allows the user to enter a new Authorized Signatory for the player's Org. \r\nAND the checkbox associated with the form the user is adding a new signatory from will be auto checked and Disabled\r\nAND the Save button will be Disabled until all required fields have been populated.\r\nAND clicking \"Save\" will add the authorized signatory to the system and close the modal, with the \"Authorized Signatory\" field pre-populated with the newly added Authorized Signatory. \r\nAND the Authorized SIgnatory will be added to the authorized signatory widget and will appear for the Org for all users that have permission to view that Org's Authorized Signatories.\r\nAND clicking Cancel will cancel the addition of the authorized signatory, and return the user to the form.",
    "custom_steps_separated": null
  },
  {
    "id": 1291874,
    "title": "As a Club user I want to receive an Action Item if a transfer to 15-Day IL transaction is still missing an attachment with a label = \"Standard Form of Diagnosis\" 3 days after the entered transfer date",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291775",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 13,
    "custom_preconds": "See Clipboard Rules (#7): \r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Clipboard\r\n\r\nGIVEN a Submitted or Approved Transfer to 15 Day IL transaction exists\r\nAND Transfer Date on the transaction is 3 or more days in the past\r\nAND form is still missing an attachment with label \"Standard Form of Diagnosis\"",
    "custom_steps": "WHEN user runs the Nightly Notification batch (or when it auto-runs nightly)",
    "custom_expected": "THEN system should check to see if any submitted or approved transfer to 15-day IL transactions are missing an attachment with the label \"Standard Form of Diagnosis\" that has a Transfer Date that is three or more days ago if the form has an SFD Received checkbox\r\nAND if yes, an action item should be generated for the Club according to the Clipboard Requirements\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink should open the transaction in edit mode in the same window/tab \r\nAND player's name should be a hyperlink\r\nAND clicking on the player's name hyperlink should open the player's profile in view mode in the same window/tab on the Player History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1291875,
    "title": "As a user, I want my action item to be removed when I attach an SFD to a Transfer to 15 Day  IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291776",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 14,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL",
    "custom_steps": "Acceptance Criteria: \n* When a file is uploaded to a Transfer to 15 Day with a Standard Form Diagnosis label, on save or approve, the system will check if there are any action items associated with that transaction. \n* If an action item is found, the item will be removed from the Club's Action Item's Clipboard.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1291876,
    "title": "As a user I want to be able to print a Notice of Disposition for a transfer to 15-day IL transaction",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291777",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 15,
    "custom_preconds": "cba change, Injured list, mj IL - transfer to 15 day IL, printing\r\n\r\nGIVEN user opens a Transfer to 15-day IL transaction\r\nAnd have permission to Print",
    "custom_steps": "WHEN the user clicks on Print (Print button will appear only if user have permission to print.)\r\nAND selects 'Notice of Disposition'",
    "custom_expected": "THEN system will generate a pdf of the Notice of Disposition in English if the language on the player's profile is set to anything other than Spanish. \r\nAND the English pdf will follow the English Notice of Disposition format.\r\nOR selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in Spanish IF the language on the player's profile is set to Spanish. \r\nAND the Spanish pdf will follow the Spanish Notice of Disposition format.",
    "custom_steps_separated": null
  },
  {
    "id": 1291877,
    "title": "As a BOC user I want approving a Transfer to 15-Day IL transaction to create an entry in the daily transaction bulletin",
    "section_id": 156862,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291778",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 16,
    "custom_preconds": "GIVEN a BOC user is attempting to approve a Transfer to 15 Day IL (MJ) transaction for a player",
    "custom_steps": "WHEN the transaction is updated to approved",
    "custom_expected": "THEN it should appear on the current Pending Daily Transaction Bulletin as \"Transfer to 15-day IL - Earliest Reinstatement Date [ insert earliest reinstatement date]\"\r\nAND when a Transfer to 15-day IL transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed\r\nBUT if it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Transfer to 15-day - Earliest Reinstatement Date [ insert earliest reinstatement date] - Reversed\" \r\nAND when a Transfer to 15-day IL transaction is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed. from the daily bulletin",
    "custom_steps_separated": null
  },
  {
    "id": 1291888,
    "title": "As a user I want to receive an error if saving a transfer to 15-Day IL transaction with missing required fields or other on save rule violations",
    "section_id": 156863,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291745",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "See 'On Save (Submitted and higher transactions only)' Business Rules:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Messages:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\n\r\nGIVEN user created a Transfer to 15-Day IL transaction with missing required fields or other on save rule violations\r\nAND transaction is in submitted or higher state",
    "custom_steps": "WHEN user clicks on 'SAVE'",
    "custom_expected": "THEN system will check the rules detailed in the business rules document linked above\r\nAND if any of the rule(s) are violated, the user will receive an error",
    "custom_steps_separated": null
  },
  {
    "id": 1291889,
    "title": "Error if attempting to save a place on Transfer to 15-Day IL transaction without entering comments to explain a change to injury details",
    "section_id": 156863,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1291746",
    "created_by": 103,
    "created_on": 1578688763,
    "updated_by": 103,
    "updated_on": 1578688763,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "See Business Rule #3.38:\r\nhttps://wiki.mlbam.com/display/EBIS/3.+Transfer+to+15-Day+DL\r\nSee Error Message #22:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN BOC approver is attempting to save a Transfer to 15 Day IL transaction for a player\r\nAND transaction is in a submitted or higher state\r\nAND user had updated any field in the Injury Details section of the transaction EXCEPT THE SFD OR CDF CHECKBOX",
    "custom_steps": "WHEN user clicks \"Save\"",
    "custom_expected": "THEN system should check if there have been edits made to any of the Injury Details after the transaction was submitted or approved\r\nAND if yes, and nothing has been entered in the \"Comments\", then system should show an error\r\nAND message should be as follows:\r\nBody: \"You must enter comments if updating Injury Details.\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nBUT if the \"Received SFD\" or \"Received CDF\" (whichever is displayed) is the only thing that's been edited the no error should fire",
    "custom_steps_separated": null
  },
  {
    "id": 1292059,
    "title": "Submit a Reinstate from IL tx",
    "section_id": 156878,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877449",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is attempting to submit a \"Reinstate from IL\" transaction\r\nAND transaction is in preliminary or rejected state",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Submit to BOC\" button",
    "custom_expected": "THEN system should run required field and format check\r\nAND any errors should cause the system to generate an error message\r\nAND once all rules pass the system should update transaction status to \"Submitted to BOC\"\r\nAND system should reload transaction in view mode\r\nAND system should display successful submit blue notification #76\r\nAND players Pending MJ Roster Status should be set to Active\r\nAND an entry should be created in green font in player's Player History: Code = REINS, Description = Reinstate From {Injured List}, From Org/Club and To Org/Club fields\r\n{Injured List} should reference the player's latest IL placement (ex: 7-Day Concussion IL etc)\r\nAND approval item should be generated and display on BOC - Major Transactions = Admin's Approvals Widget\r\nAND any populated comments should display in Comments column of Approvals Widget\r\nAND clicking Player Name hyperlink should open the Player Profile to the Player History tab in the same window/tab\r\nAND clicking on Type hyperlink will open submitted transaction in view mode in the same window/tab",
    "custom_steps_separated": null
  },
  {
    "id": 1292060,
    "title": "Reverse and suppress a Reinstate from IL tx - not most recent approved tx",
    "section_id": 156878,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877451",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a \"Reinstatement from IL\" transaction exists for a player \r\nAND user is logged in with permission to reverse and suppress the transaction\r\nAND grey \"Reverse\" button is displayed on the form\r\nBUT selected transaction is not the most recent approved transaction",
    "custom_steps": "WHEN user clicks \"Reverse\" or \"Reverse and suppress\" button",
    "custom_expected": "THEN system should display error message \"Only the player's latest approved transaction can be reversed.\"\r\nAND clicking \"Back\" button should close modal and return user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1292061,
    "title": "User wants to print Notice of Disposition for Reinstate from IL tx",
    "section_id": 156878,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877684",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN Users have permission to Print from the form will see a \"Print\" button on the transaction",
    "custom_steps": "WHEN the user clicks print on the tx in view or edit mode",
    "custom_expected": "THEN a menu will open where the user can choose to print a Notice of Disposition. \r\nAND Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in English if the language on the player's profile is set to anything other than Spanish. \r\nAND Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in Spanish if the language on the player's profile is set to Spanish. \r\nAND The English pdf will follow the English Notice of Disposition format.\r\nAND The Spanish pdf will follow the Spanish Notice of Disposition format.",
    "custom_steps_separated": null
  },
  {
    "id": 1292062,
    "title": "User wants to print Notice of Disposition for Reinstate from IL  tx",
    "section_id": 156878,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877688",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN a User that has permission to Print from the form will see a \"Print\" button",
    "custom_steps": "WHEN the user clicks print on the tx in view or edit mode",
    "custom_expected": "THEN it will  open a menu where the user can choose to print a Notice of Disposition. \r\nAND selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in English if the language on the player's profile is set to anything other than Spanish. \r\nAND selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in Spanish if the language on the player's profile is set to Spanish. \r\nAND the English pdf will follow the English Notice of Disposition format.\r\nAND the Spanish pdf will follow the Spanish Notice of Disposition format.",
    "custom_steps_separated": null
  },
  {
    "id": 1292063,
    "title": "Club user receives error if they are reinstating a player that was on the IL for a concussion",
    "section_id": 156879,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877448",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is attempting to initiate a \"Reinstate from IL\" transaction for a player\r\nAND selected player has been placed on the IL for a concussion since his latest reinstate from IL transaction",
    "custom_steps": "WHEN club user selects \"Reinstate from IL\" from the Major League Create New menu",
    "custom_expected": "THEN system should display error message \"Please contact the Office of the Commissioner. Only a BOC user can create a {Reinstate from IL} for a player that has been placed on the Injured List due to a concussion.\"\r\nAND clicking \"Back\" button will close the modal and return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1292064,
    "title": "As a user I want to receive an error if the player I'm attempting to Reinstate from the MJ IL is at the MN level",
    "section_id": 156879,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994779",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 207,
    "updated_on": 1579021286,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "See Business Rule #10.01:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #15:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a user is attempting to create a new Reinstate from IL transaction for a MJ league player",
    "custom_steps": "WHEN user selects \"Reinstate From IL\" from the Major League Create New menu ",
    "custom_expected": "THEN system should check that the player's Pending Roster Status is not at the minor league level\r\nAND if the player's pending roster status is at the minor league level, then the user should receive an error\r\nAND if the player does not have a pending roster status, then the current roster status should be used\r\nAND this rule should also be checked on Submit and Approve\r\nAND message should be as follows:\r\nTitle: \"Error\"\r\nBody: \"This transaction is for Major League players only.\"\r\nButton(s): Back\r\nClicking Back will close the modal and return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1292065,
    "title": "As a Club user I want to be prevented from initiating a transaction for a player that does not belong to my Club",
    "section_id": 156879,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994781",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "See Business Rule #10.02:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Messages #21:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a club user is attempting to create a Reinstate from IL transaction for an MJ league player\r\nAND the player selected does NOT belong to the org of the logged in user",
    "custom_steps": "WHEN user selects \"Reinstate From the DL\" on the Create New ",
    "custom_expected": "THEN system should check to see if the player's Current Org is set to the Org of the initiating user\r\nAND if the Org of the initiating user is BOC, then they should be allowed to create the transaction\r\nBUT if the Org of the initiating user is not BOC or the Current Org of the player, then system should display a blocking message\r\nAND message should be as follows:\r\nBody: \"You do not have permission to create a transaction for a player that belongs to another Organization.\"\r\nHint Text:\"If you believe you have received this message in error, please contact the BOC.\"\r\nButton(s): Back\r\nAND clicking Back will return the user to the entry point",
    "custom_steps_separated": null
  },
  {
    "id": 1292066,
    "title": "Receive error if player does not have a valid MJ roster status",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877453",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 207,
    "updated_on": 1579026435,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN user wants to Submit or Approve a \"Reinstate from IL\" transaction \r\nAND selected player's pending (or current if pending is not populated) major league roster status is not \"7-Day Concussion\", \"10-Day IL\", \"15 day IL\" or \"60-Day IL\"",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN user sees error message \"The player must currently be on the Injured List and not currently on Rehab in order to be Reinstated.\"\r\nAND clicking Back will close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1292067,
    "title": "Receive error if player has a pending or approved tx after the entered assignment date",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877603",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN user wants to Submit or Approve a \"Reinstate from IL\" transaction \r\nAND Placement Date on the transaction is before the latest approved or pending (Pending to Club, Submitted to BOC) transaction date for the player",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN user sees error message \"A transaction cannot occur before the date of the player's latest approved or pending transaction, on <TX Date>.\"\r\nAND clicking Back will close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue will ignore the error and continue with the transaction (BOC ONLY)",
    "custom_steps_separated": null
  },
  {
    "id": 1292068,
    "title": "Receive error if entered reinstatement date is before the Earliest Reinstatement Date",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877604",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is attempting to initiate a \"Reinstate from IL\" transaction for a player\r\nAND reinstatement date entered on the form is before the Earliest Reinstatement Date displayed on the transaction",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN system should display error message \"The player cannot be reinstated before the earliest reinstatement date.\"\r\nAND clicking \"Back\" button will close the modal and return the user to the transaction\r\nAND clicking \"Ignore and Continue\" will ignore the error and continue with the transaction (BOC Only)",
    "custom_steps_separated": null
  },
  {
    "id": 1292069,
    "title": "Receive error if user is submitting a tx without \"Received Medical Director Approval\" checkbox being checked",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877452",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN a player is on 7-day Concussion IL\r\nAND user wants to Submit or Approve a \"Reinstate from IL\" transaction \r\nAND \"Received Medical Director Approval\" checkbox is displayed on the Reinstatement on\r\nAND \"Received Medical Director Approval\" checkbox is not checked",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN user sees error message \"A player must have received Approval from a Medical Director to be reinstated from placement on the IL due to concussion.\"\r\nAND clicking Back will close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue will ignore the error and continue with the transaction (BOC ONLY)",
    "custom_steps_separated": null
  },
  {
    "id": 1292070,
    "title": "As a user I want to receive an error if the player I'm attempting to reinstate from the MJ IL is at the MN level",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994761",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "See Business Rule #10.05:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #15:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a user is attempting to submit a Reinstate from IL transaction for a player at the MJ League level\r\nAND selected player's pending (or current if pending not available) roster status is NOT at the MJ league level",
    "custom_steps": "WHEN user clicks Submit or Approve",
    "custom_expected": "THEN system should check that the player's Pending Roster Status is not at the minor league level\r\nAND if the player's pending roster status is at the minor league level, then the user should receive an error\r\nAND if the player does not have a pending roster status, then the current roster status is used\r\nAND message should be as follows:\r\nTitle: \"Error\"\r\nBody: \"This transaction is for Major League players only.\"\r\nButton(s): Back\r\nClicking Back will close the modal and return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1292071,
    "title": "As a user I want to receive an error if I'm attempting to submit a Reinstate from IL transaction without the \"Received Return to Play Form\" checkbox checked",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "116093687",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 207,
    "updated_on": 1579025105,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "See Business Rule #10.08:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #33:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a user is attempting to submit a Reinstate from IL transaction for a player at the MJ League level\r\nAND player was on the IL for a concussion at some point during his current IL stint (including any transfers)\r\nAND \"Received Return to Play Form\" checkbox on the transaction is not checked",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should check if the \"Received Return to Play Form\" checkbox is checked ONLY if it appears on the form\r\nAND if it is not checked, but is displayed, then system should show an error\r\nAND message should be as follows:\r\nBody: \"A player must have received Approval to Return to Play to be reinstated from placement on the DL due to concussion.\"\r\nClicking Back should close the modal and return the user to the transaction\r\nClicking Ignore and Continue (only available for the BOC) should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1292072,
    "title": "Warning if the MJ League Club's active or under control limit will be exceeded",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "116094089",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 7,
    "custom_preconds": "See Business Rule #10.09:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #34:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a user is attempting to submit or approve a Reinstate from IL transaction for a player at the MJ league level\r\nAND the transaction would exceed the active or under control limit for the roster of the player's club",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired) ",
    "custom_expected": "THEN system should check if the completion of this transaction will put the relevant Major League Club over their under control or active roster limits\r\nAND if yes, then a warning should be shown\r\nAND message should be as follows:\r\nBody: \"The club [Major League club name] will exceed the Active List or Under Control limit.\r\nActive Limit: [Limit #] Actual: [Actual#]\r\nUnder Control Limit: [Limit #] Actual: [Actual#]\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1292073,
    "title": "As a user I want to receive an error if I have back or futuredated my transaction more than 10 days",
    "section_id": 156880,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994759",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 207,
    "updated_on": 1579285565,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 8,
    "custom_preconds": "See Business Rule #10.12:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #18:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN user is attempting to submit or approve a Reinstate from IL transaction for a player at the MJ league level\r\nAND Reinstatement Date on the transaction is backdated or futuredated more than 10 days",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should check if the placement date is 10 or more days prior to or after the current date. \r\nAND if yes, system should display error\r\nAND message should be as follows:\r\nBody: \"Reinstatement Date must be within 3 days of submission.\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue (only available for the BOC) should ignore the error and continue with the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1292078,
    "title": "Run required field and formatting check on save(submitted or higher transaction only)",
    "section_id": 156881,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1054036",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "See Business Rules 10.39:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Data Discovery for required fields:\r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+MJ+DL\r\n\r\nGIVEN a club or BOC user is viewing a Reinstate from IL transaction in a submitted or higher state\r\nAND transaction is in edit mode\r\nAND one or more required fields is missing",
    "custom_steps": "WHEN user clicks Save",
    "custom_expected": "THEN required field and formatting check should be run according to attached DD\r\nAND user should receive a blocker for any missing required fields",
    "custom_steps_separated": null
  },
  {
    "id": 1292079,
    "title": "Error if BOC approver attempts to approve a Reinstate from IL transaction with a Reinstatement Date after the current date",
    "section_id": 156882,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115994737",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "See Business Rule #10.18:\r\nhttps://wiki.mlbam.com/display/EBIS/10.+Reinstate+from+DL\r\nSee Error Message #75:\r\nhttps://wiki.mlbam.com/display/EBIS/DL+-+Messages\r\nGIVEN a BOC approver user is attempting to approve a Reinstate from IL transaction for a player at the MJ league level\r\nAND Reinstatement Date on the transaction is later than current date",
    "custom_steps": "WHEN user clicks \"Approve\"",
    "custom_expected": "THEN system should check if the current date is after the placement date entered on the transaction\r\nAND if yes, then a warning should be shown\r\nAND message should be as follows:\r\nBody: \"This transaction cannot be approved unless the transaction date is on or before the current date.\"\r\nAND clicking Back should close the modal and return the user to the transaction\r\nBUT f the placement date is on or before the current date, then no error should be shown",
    "custom_steps_separated": null
  },
  {
    "id": 1292074,
    "title": "BOC admin",
    "section_id": 156883,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1227269",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as a BOC - Admin user",
    "custom_steps": "WHEN the user attempts to view, edit, or create a \"Reinstate from IL\" transaction for a player",
    "custom_expected": "THEN user should be able to view and Print all major league transactions [Club and BOC] in all states for Major League Players\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states\r\nAND user should be able to create, delete, edit, e-sign and submit all Major league transactions for Major League players\r\nAND user should be able to Approve, Reject, Reverse and Suppress all Major League transactions and see associated Flags",
    "custom_steps_separated": null
  },
  {
    "id": 1292075,
    "title": "BOC basic",
    "section_id": 156883,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1227270",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in as a BOC - Basic user",
    "custom_steps": "WHEN the user attempts to view, edit, or create a \"Reinstate from IL\" transaction for a player",
    "custom_expected": "THEN user should be able to view and Print all major league transactions [Club and BOC] in all states for Major League Players\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states.\r\nBUT user should not be able to make any changes or e-sign.",
    "custom_steps_separated": null
  },
  {
    "id": 1292076,
    "title": "Club admin - User's Club is \"From Org\" or \"To Org\"",
    "section_id": 156883,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1227271",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user has Club-Admin Permissions\r\nAND user is listed as \"From Org\" or \"To Org\" on \"Reinstate from IL\" transaction",
    "custom_steps": "WHEN user logs in as Club-Admin user",
    "custom_expected": "THEN user should be able to view and print all major league transactions in all states when the logged in Org matches the \"From Org\" for that transaction \r\nAND user should be able to create, delete, submit, edit, attach files, and e-sign all Major League transactions for Major League players on their Org's roster\r\nBUT user should not be able to view transactions in \"Suppressed\" state\r\nAND user should not be able to view \"BOC Notes\" field",
    "custom_steps_separated": null
  },
  {
    "id": 1292077,
    "title": "Club basic - All transactions including other clubs and BOC only",
    "section_id": 156883,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1227272",
    "created_by": 103,
    "created_on": 1578949638,
    "updated_by": 103,
    "updated_on": 1578949638,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN a user has Club basic permissions",
    "custom_steps": "WHEN user logs in as Club-Basic user",
    "custom_expected": "THEN user should be able to view all APPROVED (no other states) major league transactions including other club's Major League transactions or BOC only\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org\r\nAND user should not be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1292230,
    "title": "User wants to create a new Rehab Assignment tx for a player from their player history",
    "section_id": 156917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877474",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user is logged in and viewing a player's Player History\r\nAND no preliminary, submitted, or rejected \"Place on Rehabilitation Assignment\" tx exists for the player within the last 10 days",
    "custom_steps": "WHEN user clicks \"Create New\" button on Player History Widget",
    "custom_expected": "THEN \"Transactions\" should appear as an option in top-level dropdown\r\nAND \"Major\" and \"Minor\" radio buttons should be active\r\nAND selecting \"Major\" should limit third and fourth levels to only MJ items\r\nAND \"Injured List\" should be an option under Major Transactions\r\nAND \"Rehabilitation Assignment\" should be an option in the fourth level dropdown\r\nAND clicking \"Rehabilitation Assignment\" IL\" should load a new Preliminary transaction in edit mode\r\nAND tx should match wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1292231,
    "title": "User wants to create a new Rehab Assignment tx for a player with a concussion",
    "section_id": 156917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "136579485",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN Club or BOC user is logged in and viewing a player's Player History\r\nAND no preliminary, submitted, or rejected \"Place on Rehabilitation Assignment\" tx exists for the player within the last 10 days\r\nAND player was on IL for a concussion (no reinstatements found since a IL transaction was found for the player with an Injury = Concussion)",
    "custom_steps": "WHEN user clicks \"Create New\" button on Player History Widget",
    "custom_expected": "THEN \"Transactions\" should appear as an option in top-level dropdown\r\nAND \"Major\" and \"Minor\" radio buttons should be active\r\nAND selecting \"Major\" should limit third and fourth levels to only MJ items\r\nAND \"Injured List\" should be an option under Major Transactions\r\nAND \"Rehabilitation Assignment\" should be an option in the fourth level dropdown\r\nAND clicking \"Rehabilitation Assignment\" IL\" should load a new Preliminary transaction in edit mode\r\nAND \"Received Medical Director Approval\"and \"Received Return to Play\" checkboxes should be displayed\r\nAND tx should match wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1292232,
    "title": "User wants Last Rehab Date calculated correctly on Rehab Assignment",
    "section_id": 156917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877476",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is attempting to create a \"Place on Rehab Assignment\" tx for a player",
    "custom_steps": "WHEN \"Place on Rehab Assignment\" tx is loaded, saved, or goes through any state change",
    "custom_expected": "THEN system should correctly calculate Last Rehab Date for the tx\r\nAND Last Rehab Date should be calculated as Assignment Date + Number of Days for Rehab. (Ex: Assignment Date 4/14/16 and # of days = 30, then the Last Rehab Date is 5/13/2016)",
    "custom_steps_separated": null
  },
  {
    "id": 1292233,
    "title": "BOC user wants to add an Extension to Approved Rehab Assignment",
    "section_id": 156917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877477",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN a user is logged in as a BOC user\r\nAND user is viewing an existing \"Place on Rehabilitation Assignment\" tx for a player\r\nAND tx is in \"Approved\" state\r\nAND \"Add Extension\" button is visible",
    "custom_steps": "WHEN user clicks \"Add Extension\"",
    "custom_expected": "THEN Extension section should be added to the form\r\nAND Extension section should match data discovery and wireframe\r\nAND user should be able to complete Extension section and click \"Save\" on the tx\r\nAND clicking \"Save\" should run all on Save rule checks and required field and formatting checks\r\nAND successful save blue notification should display",
    "custom_steps_separated": null
  },
  {
    "id": 1292234,
    "title": "BOC user wants saving Approved Rehab Assignment with an Extension to append \"Extended\" to player's player history entry",
    "section_id": 156917,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877480",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "GIVEN user is logged in as a BOC user\r\nAND user has an Approved \"Place on Rehabilitation Assignment\" tx open in edit mode\r\nAND user has added a new Extension to the tx\r\nAND this Extension is the first Extension being added to the tx",
    "custom_steps": "WHEN user clicks \"Save\"",
    "custom_expected": "THEN system should check if an Extension has been added\r\nAND system should add \"-EXTENDED\" to the Rehabilitation Assignment in the player's Player History",
    "custom_steps_separated": null
  },
  {
    "id": 1292235,
    "title": "Club user receives error if player being placed on rehab was at any point on IL for concussion",
    "section_id": 156918,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877490",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is attempting to initiate a \"Place on Rehabilitation Assignment\" transaction for a player\r\nAND selected player has been placed on the IL for a concussion since his latest reinstate from IL transaction",
    "custom_steps": "WHEN club user selects \"Rehabilitation Assignment\" from the Major League Create New menu",
    "custom_expected": "THEN system should display error message \"Please contact the Office of the Commissioner. Only a BOC user can create a {Rehabilitation Assignment} for a player that has been placed on the Injured List due to a concussion.\"\r\nAND clicking \"Back\" button will close the modal and return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1292236,
    "title": "User receives error if submitting continuation of rehab with a number of days that exceeds the set limits - Pitcher",
    "section_id": 156919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877494",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user has a \"Place on Rehabilitation Assignment\" tx open for a Pitcher at MJ level\r\nAND \"Reason for Rehab\" on the tx is set to \"Continuation of Rehab\"\r\nAND selected player has a previous rehab assignment\r\nBUT selected player does NOT have a subsequent \"Reinstate from IL\" tx\r\nAND value entered on new \"Place on Rehab Assignment\" tx for Number of Days for Rehab + number of days player spent on rehab during his previous assignment is greater than 30",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should display error \"A pitcher is only allowed a total of 30 days of consecutive rehab assignments. Current total: {0}.\"({0} reflects the number of days entered on this form as well as the previously completed rehab days)\r\nAND clicking Back will close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue will ignore the error and continue with the transaction (BOC Only)",
    "custom_steps_separated": null
  },
  {
    "id": 1292237,
    "title": "User receives error if submitting Rehab Assignment for player with number of days that exceeds set limits - Pitcher",
    "section_id": 156919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877496",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is attempting to \"Submit\" or \"Approve\" a \"Place on Rehab Assignment\" tx for a Pitcher at MJ level\r\nAND value entered for Number of Days on the TX is greater than 30",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should display error \"A pitcher is only allowed 30 days of rehab. Current value: {0}.\" ({0}  reflects the number of days entered on this form)\r\nAND clicking Back will close the modal and return the user to the transaction\r\nAND clicking Ignore and Continue will ignore the error and continue with the transaction (BOC only)",
    "custom_steps_separated": null
  },
  {
    "id": 1292238,
    "title": "User receives error if submitting Rehab Assignment too close to player's injury date - Pitcher",
    "section_id": 156919,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877664",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a user is attempting to \"Submit\" or \"Approve\" a \"Place on Rehab Assignment\" tx for a Pitcher at MN level\r\nAND player's pending (on submit) or current (on Approve) MN Roster status is 7-Day IL or 60-Day IL\r\nAND assignment date entered on tx is fewer than 5 days after the player's last Injury Date",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should display error \"A pitcher may only be placed on rehab {5} days after Injury Date. Current value: {1}.\" ({1} reflects the number of days that have currently passed since the player's last Injury Date up to the entered Assignment Date)\r\nAND clicking Back will close the modal and return the user to the transaction.\r\nAND Clicking Ignore and Continue will ignore the error and continue with the transaction (BOC only)",
    "custom_steps_separated": null
  },
  {
    "id": 1292239,
    "title": "User wants to create new Transfer of Rehab Assignment tx",
    "section_id": 156920,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877481",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user is logged in and viewing a player's Player History\r\nAND no preliminary, submitted, or rejected Transfer of Rehab Assignment tx exists for the player within the last 10 days",
    "custom_steps": "WHEN user clicks \"Create New\" button on Player History Widget",
    "custom_expected": "THEN \"Transactions\" should appear as an option in top-level dropdown\r\nAND \"Major\" and \"Minor\" radio buttons should be active\r\nAND selecting \"Major\" should limit third and fourth levels to only MJ items\r\nAND \"Injured List\" should be an option under Major Transactions\r\nAND \"Transfer of Rehab Assignment\" should be an option in the fourth level dropdown\r\nAND selecting \"Transfer of Rehab Assignment\" will cause the system to load a new preliminary transaction in edit mode\r\nAND all fields should match wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1292240,
    "title": "BOC User wants to add an extension to an existing rehab assignment tx after approving a transfer of Rehab tx",
    "section_id": 156920,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877485",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN an approved Rehabilitation Assignment tx exists for a professional player\r\nAND BOC user has approved a subsequent Transfer of Rehab tx for the same player",
    "custom_steps": "WHEN user attempts to add an extension to the original Rehab Assignment tx",
    "custom_expected": "THEN user should be able to add the extension and successfully save the tx",
    "custom_steps_separated": null
  },
  {
    "id": 1292241,
    "title": "User wants to create a new Return from Rehab tx from player history",
    "section_id": 156921,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877513",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN Club or BOC user is logged in and viewing a player's Player History\r\nAND no preliminary, submitted, or rejected Return from Rehab tx exists for the player within the last 10 days",
    "custom_steps": "WHEN user clicks \"Create New\" button on Player History Widget",
    "custom_expected": "THEN \"Transactions\" should appear as an option in top-level dropdown\r\nAND \"Major\" and \"Minor\" radio buttons should be active\r\nAND selecting \"Major\" should limit third and fourth levels to only MJ items\r\nAND \"Injured List\" should be an option under Major Transactions\r\nAND \"Return from Rehab\" should be an option in the fourth level dropdown\r\nAND selecting \"Return from Rehab\" will cause the system to load a new preliminary transaction in edit mode\r\nAND all fields should match wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1292242,
    "title": "User wants to receive error if entered return date is after Last Rehab Date",
    "section_id": 156922,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877522",
    "created_by": 103,
    "created_on": 1579105724,
    "updated_by": 103,
    "updated_on": 1579105724,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is attempting to submit a \"Return from Rehab\" tx\r\nAND Return date on the tx is after Last Rehab Date displayed on player's latest Rehab Assignment (including any extensions)",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system should display error \"The return date, {0}, cannot be greater than the last rehab date, {1}.\"\r\nAND \"{0}\" should be replaced with the entered return date\r\nAND \"{1}\" should be replaced with the last rehab date from the player's latest rehab assignment (including any extensions)\r\nAND clicking Back will close the modal and return the user to the transaction.\r\nAND clicking Ignore and Continue will ignore the error and continue with the transaction (BOC only)",
    "custom_steps_separated": null
  },
  {
    "id": 1292864,
    "title": "Club user wants to view Recertification tab",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877508",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in as a Club user",
    "custom_steps": "WHEN club user navigates to the Transactions Dashboard",
    "custom_expected": "THEN \"Recertifications\" should be a tab on the Transactions Dashboard\r\nAND Clicking on the Recertifications tab should load the Recertification screen\r\nAND Org header filter should NOT be available\r\nAND The \"Org\" column should NOT display\r\nAND Clubs should only be able to see their own players\r\nAND The columns and layout should match the wire (with the exceptions noted above)\r\nAND The view should be for the current calendar year (not changeable)\r\nAND Primary sort should be by Player Last, Roster First\r\nAND Secondary sort should be by Placement Date\r\nAND Player column should display the player's Last, Roster First and be a clickable hyperlink to the player's player history\r\nAND Attention required (icon) and player columns should be frozen\r\nAND A player should have one row per IL placement (7-Day Concussion IL, 15 Day IL or MJ 60 Day IL) during the season currently being viewed\r\nAND The IL-Type should display the type of IL placement associated with the row (EX: 15-Day)\r\nAND The Placement column should be the Placement Date of the transaction that put the player on the associated IL\r\nAND The \"Recertification Due\" column should be populated with Recertifications that have or should have occurred, in a comma separated list (see wire)",
    "custom_steps_separated": null
  },
  {
    "id": 1292865,
    "title": "BOC user wants to view Recertification tab",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877509",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in as a BOC user",
    "custom_steps": "WHEN BOC user navigates to the Transactions Dashboard",
    "custom_expected": "THEN \"Recertifications\" should be a tab on the Transactions Dashboard for MJ Transactions Admins\r\nAND clicking on the Recertifications tab should load the Recertification screen\r\nAND \"Org\" Header filter should be available\r\nAND \"All\" should be an option as well as all 30 of the Clubs\r\nAND by default the form should display ARI\r\nAND the \"Org\" column should display\r\nAND columns and layout should match the wire\r\nAND view should be for the current calendar year (not changeable)\r\nAND primary sort should be by Player Last, Roster First\r\nAND secondary sort should be by Placement Date\r\nAND player column should display the player's Last, Roster First and be a clickable hyperlink to the player's player history\r\nAND a player should have one row per IL placement (7-Day Concussion IL, 15 Day IL or MJ 60 Day IL) during the season currently being viewed\r\nAND the IL-Type should display the type of IL placement associated with the row (EX: 15-Day)\r\nAND the Placement column will be the Placement Date of the transaction that put the player on the associated IL\r\nAND the \"Recertification Due\" column should be populated with Recertifications that have or should have occurred, in a comma separated list (see wire)",
    "custom_steps_separated": null
  },
  {
    "id": 1292868,
    "title": "As a user I want to see what Recertifications are due for a player on my Recertifications tab - 15 Day IL",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1054029",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624301,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 5,
    "custom_preconds": "Injured list, mj - place on 15 day IL, recertification widget, ux-approval-na",
    "custom_steps": "Wireframe: \r\nhttp://w6h8fs.axshare.com/#p=recertification\r\n\r\nAcceptance Criteria: \r\n* The \"Recertification Due\" column will be populated with Recertifications that have or should have occurred, in a comma separated list (see wire). \r\n\r\n* For a 15-Day IL placement, the first Recertification Due Date will be 15 days after the placement date. The following will be 15 days after the first recertification due date and so forth. \r\n* Each 15 Day row will always show any Recertification Due dates that have passed, and the one that is next due that is in the future",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1292869,
    "title": "User wants reinstating a player from the IL to update their information on the Recertifications tab",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877512",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 6,
    "custom_preconds": "GIVEN a user is logged in\r\nAND a player has been reinstated from the IL",
    "custom_steps": "WHEN user views the \"Recertifications\" tab",
    "custom_expected": "THEN \"Reinstatement Date\" column should only be populated once the player has been Reinstated from the IL\r\nAND \"Reinstatement Date\" column should have the Reinstatement Date entered on their Reinstatement for this IL placement\r\nAND the \"Recertification Due\" column should be populated with Recertifications that have or should have occurred, in a comma separated list\r\nAND if the Reinstatement Date is on or before any of the Recertification Due dates listed - these dates should be removed from the form",
    "custom_steps_separated": null
  },
  {
    "id": 1292870,
    "title": "As a user I want to receive an email when a player requires a IL Recertification",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1054030",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 7,
    "custom_preconds": "cba change, Injured list, email, mj - place on 10 day IL, mj - recertify a player",
    "custom_steps": "Acceptance Criteria: \r\n*Note nothing is changing for this story from previously - just ensuring that this functionality still works with the change from a 15-Day IL to a 10-Day IL*\r\n\r\n* The system should check nightly to see if any new players require a IL recertification. \r\n* If not, no action is taken. \r\n* If yes, then the system checks to see if \"Send Emails\" is set to Yes. \r\n* If yes, then the system checks to see if \"Send Notification\" is checked for Clubs for the \"IL E-recerts\" under the Transactions section of the Email Utility. \r\n* If yes, then an email notification is generated for the player's Org.\r\n* The system also checks to see if \"Send Notification\" is checked for the BOC for the \"IL E-recerts\" under the Transactions section of the Email Utility. \r\n* If yes, then an email notification is generated for the BOC.\r\n* The email should show the dates for all recerts that are still due for the player, separated by commas\r\n* The email should follow the below example.\r\n\r\nExample: \r\nFrom: e-bulletinsdev@mlb.com [mailto:e-bulletinsdev@mlb.com] \r\nSent: Monday, September 26, 2016 12:52 PM\r\nTo: youremail@yourdomain.com\r\nSubject: IL E-Recert\r\n\r\nMatthew Holliday IL Recertification due 08/27/2016",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1292871,
    "title": "As a user I want to be able to run the IL Recert Report from Recertification screen",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1081783",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 8,
    "custom_preconds": "GIVEN the user is in Recertification utility",
    "custom_steps": "WHEN user is on the \"IL Recertification\" tab for BOC and Club users",
    "custom_expected": "THEN there is a \"Run Report\" button. \r\nAND Clicking this will launch the report prompt for the IL Recertification Maintenance report.\r\nAND The prompt should default to the current year and allow the user to adjust the parameters and run the report, just like if they accessed this from the Report screen.",
    "custom_steps_separated": null
  },
  {
    "id": 1292872,
    "title": "As a user I want to be able to run the IL Recert Maintenance Report from Reporting Widget",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1227652",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 9,
    "custom_preconds": "GIVEN a user is logged in with permission to run the Recert Maintenance Report\r\nANDthe user has navigated to the reporting widget",
    "custom_steps": "WHEN user Selects Recertification Maintenance Report",
    "custom_expected": "THEN crystal prompts should display in a new tab\r\nAND user should be able to enter a year and select an org or All orgs\r\nAND report should print based on prompts selected and match the layout documentation(https://wiki.mlbam.com/display/EBIS/Recert+Maintenance+-+Report+Layout)",
    "custom_steps_separated": null
  },
  {
    "id": 1292873,
    "title": "As a user I want to be able to sort the Recertification utility",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1081784",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 10,
    "custom_preconds": "GIVEN the user is in Recertification utility",
    "custom_steps": "WHEN user clicks on the header of any column in the Recertification screen",
    "custom_expected": "THEN system will sort by the column. \r\nAND For the Recert due column, the sort should be on the first date displayed. \r\nAND Column headers should now be blue\r\nAND The column being sorted on should have global styling added(grey background and the red up/down arrow next to the column header)",
    "custom_steps_separated": null
  },
  {
    "id": 1292874,
    "title": "As a user I want to receive a Notification for a player that is up for recertification or reinstatement",
    "section_id": 157021,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1054031",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 11,
    "custom_preconds": "cba change, Injured list, mj - place on 10 day IL, mj - recertify a player, nightly notification",
    "custom_steps": "Acceptance Criteria: \n* Using the same logic as #130338071, nightly the system will check if any Major League players currently on the 7 day Concussion IL or 10 Day  IL have a recertification due on the current date\n* If a player is found to meet either or both of the above criteria, a notification is sent to the BOC- Major- Trans- Admin and Club  Major-Trans-Admin group that the player belongs to even if the user did not receive and email. \n* Date column is the Date the notification was generated \n* Type: Transaction\n* Org: Org that the player belongs too \n* Notification Description: The Player is up for recertification or reinstatement by [date]",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1292875,
    "title": "BOC user wants to create new Recertification tx from Player History - No Preliminary tx exists",
    "section_id": 157022,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877519",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user is logged in and viewing a player's Player History\r\nAND no preliminary recertification tx exists for the player within the last 10 days",
    "custom_steps": "WHEN user clicks \"Create New\" button on Player History Widget",
    "custom_expected": "THEN \"Transactions\" should appear as an option in top-level dropdown\r\nAND \"Major\" and \"Minor\" radio buttons should be active\r\nAND selecting \"Major\" should limit third and fourth levels to only MJ items\r\nAND \"Injured List\" should be an option under Major Transactions\r\nAND \"Injured List Recertification\" should be an option in the fourth level dropdown\r\nAND selecting \"Injured List Recertification\" will cause the system to load a new preliminary transaction in edit mode\r\nAND all fields should match wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1292876,
    "title": "Club user wants to submit a Recertification tx",
    "section_id": 157022,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877520",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user has navigated to the IL recertification date hyperlink on the IL Recertification widget for a player who requires recert\r\nAND club user has opened a past due recert for the player by clicking the link\r\nAND user is attempting to submit a \"IL Recertification\" transaction\r\nAND transaction is in preliminary state in view or edit mode\r\nAND blue \"Submit\" button is available on the form",
    "custom_steps": "WHEN user clicks \"Submit\"",
    "custom_expected": "THEN system should run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message\r\nAND system should run On Submit rules check\r\nAND after the rules have passed, the system should update the status of the transaction to \"Approved\"\r\nAND system should reload the transaction in view mode, and display a successful approve blue notification. Messages #76\r\nAND no entry should be added to the player's player history\r\nAND no notification for \"Approved\" should be generated since this transaction is auto-approved\r\nAND no approvals item should be generated for this transaction either since this transaction is auto-approved",
    "custom_steps_separated": null
  },
  {
    "id": 1292877,
    "title": "BOC User wants to approve a Recertification tx",
    "section_id": 157022,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C877521",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is attempting to Approve a \"Recert\" transaction\r\nAND transaction is in preliminary state in view or edit mode\r\nAND blue Approve button is available on the form",
    "custom_steps": "WHEN user clicks \"Approve\"",
    "custom_expected": "THEN system should run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message\r\nAND system should run On Submit rules check\r\nAND after the rules have passed, the system should update the status of the transaction to \"Approved\"\r\nAND system should reload the transaction in view mode, and display a successful approve blue notification. Messages #76\r\nAND no entry should be added to the player's player history\r\nAND no notification for \"Approved\" should be generated since this transaction is auto-approved\r\nAND no approvals item should be generated for this transaction either since this transaction is auto-approved",
    "custom_steps_separated": null
  },
  {
    "id": 1292878,
    "title": "As a BOC user I want to be prevented from initiating a recertification for a player that has not been on the appropriate IL",
    "section_id": 157022,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "C1054032",
    "created_by": 103,
    "created_on": 1579624168,
    "updated_by": 103,
    "updated_on": 1579624168,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 21897,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is in a Player's History page",
    "custom_steps": "WHEN user Selects \"Recertification\" on the Create New menu for a player from their Player History",
    "custom_expected": "THEN\r\n-System will check to see if the player submitted/approved transactions (IL07J, IL10J, TR10J, RECRT) from the current year which match (or post-date) the latest placement, transfer, or release tx. \r\n-If no transaction exists, the player is not eligible. If a transaction exists, the recertification date must be before the last game of the season.\r\n**Message**\r\n**Body:** \"No re-certifications are required for this player.\"\r\n**Button(s):** Back - Clicking Back will return the user to the entry point.",
    "custom_steps_separated": null
  }
]