[
  {
    "id": 1228807,
    "title": "As a scouting admin I want to create a new Scout profile",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203465",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368489,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 1,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget \r\n",
    "custom_steps": "WHEN user click on Create New button on the widget ",
    "custom_expected": "THEN Clicking the Create New button will open a new Scout profile per the provided data discovery and wireframe.\r\nAND A Save button is available in addition to a Cancel button.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the new profile is discarded and the user is returned to their point of entry.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228804,
    "title": "As a scouting admin I want to view the Scout Directory",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169116",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368548,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 2,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to view the Scout Directory\r\nAND user navigate to the Scouting dashboard ",
    "custom_steps": "WHEN user click on Scouts tab in the scouting dashboard ",
    "custom_expected": "THAN The Scout Directory should be available for users that have permission to see it on the \"Scouts\" tab. \r\nAND The directory matches the provided wireframe and data discovery. \r\nAND EBIS-WIDGET-SCOUT-DIRECTORY-VIEWERS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND By default only Active profiles are displayed, but the user can use the header filter to display all or only Inactive profiles as well.\r\nAND The widget should be sorted alphabetically by scout name. \r\nAND Default filter and export widget behavior should work.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_directory\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Directory+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228805,
    "title": "As a scouting admin I want to view a Scout profile",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169115",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368548,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 3,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to view the Scout profile\r\nAND user navigate to the the Scout Directory",
    "custom_steps": "WHEN user click on a scout name in the Scout Directory ",
    "custom_expected": "THEN  The scout's profile opens if the logged in user has permission to see the Scout profile. By default this should land on the \"Info\"  tab of the profile. \r\nAND The Info tab of the profile matches the provided wireframe and data discovery. \r\nAND EBIS-SCOUT-EDITORS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND EBIS-SCOUT-VIEWERS should be added to  test_ebis_user78@mlb.com. \r\nAND This story does NOT include the \"Players\" tab of the profile. \r\nAND There is a \"Close\" button on the profile in view mode.\r\nAND Clicking \"Close\" will close the profile and return the user to the point of entry.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_info\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228806,
    "title": "As a scouting admin I want to view the Players tab of a Scout's profile",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169622",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368548,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 4,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to edit (EBIS-SCOUT-EDITORS) the Scout profile\r\nAND user navigate to the the Scout Directory\r\nAND user click on a scout name in the Scout Directory",
    "custom_steps": "WHEN user click on the \"Players\" tab on the profile ",
    "custom_expected": "THAN  The Players tab follows the provided wireframe and data discovery.\r\nAND Any player that appears in an APPROVED scouting report entered by the scout whose profile is being viewed appears in the widget. (will need to use the email address entered on the scout profile to make this mapping)\r\nAND If the player has a more than one report added by the same scout, we would show the latest report entered\r\nAND  This tab does  NOT appear if the user is only a viewer. \r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_players\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Players+Tab+-Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228808,
    "title": "As a scouting admin I want to save a new Scout profile",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203472",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368548,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 5,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget\r\nAND user is creating a new scout profile",
    "custom_steps": "WHEN user clicks \"Save\" ",
    "custom_expected": "The system will run a required field and format check. If this passes, a blue successful save notification is displayed. \r\nAND The profile is assigned a status of \"Approved\".\r\nAND The scout's profile should appear in the Scout Directory.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_info\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1228809,
    "title": "As a scouting admin I want to edit an existing Scout profile",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203475",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368548,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 6,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget\r\nAND user loads the existing Scout profile \r\n",
    "custom_steps": "WHEN user click on an Edit button on the scout profile ",
    "custom_expected": "THAN Clicking the edit button will reload the profile in edit mode per the provided data discovery and wireframe.\r\nAND A Save button is available in addition to a Cancel button.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the profile is reloaded in view mode and no changes are maintained.\r\nAND Clicking \"Save\" should run a required field and format check and store any changes made, including to the \"Active\" flag.\r\nAND A blue successful save notification should be displayed and the profile reloaded in View mode with the changes maintained.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1228810,
    "title": "As a scouting admin I want to view the Scouting Report Submission Widget",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158204908",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368976,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 7,
    "custom_preconds": "GIVEN a Scouting admin is logged in with the permission to the Scout Director widget \r\nOR the scouting Report Submission widget \r\nAND user navigate to Scouting dashboard ",
    "custom_steps": "WHEN user click on Scouts tan on the Scouting dashboard ",
    "custom_expected": "THEN The Scouting Report Submission widget should be the first widget to display on the tab for users that have permission to see it. \r\nAND The widget matches the provided wireframe and data discovery. \r\nAND EBIS-WIDGET-SCOUTING-SUBMISSION-DETAIL-VIEWERS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND A line should appear in the widget for each ACTIVE scout profile found in the system.\r\nAND The year header filter should default to the current year, with the previous 5 years available as well. \r\nAND The widget should be sorted alphabetically by scout name. \r\nAND Default filter and export widget behavior should work. \r\nAND Region and Scout Name should come from the scout's profile. Scout Name should be a hyperlink to the scout's profile. \r\nAND Reports Submitted should be the number of APPROVED reports for the selected year entered by the corresponding scout.\r\nAND Players Reported On should be the number of players included in ALL APPROVED reports for the selected year entered by the corresponding scout. \r\nAND Prospect should be the number of approved prospect reports for the selected year entered by the corresponding scout (will always be 0 for now..).\r\nAND Int'l Workout should be the number of approved International Workout reports for the selected year entered by the corresponding scout.\r\nAND Daily Reports should be the number of approved Daily reports for the selected year entered by the corresponding scout. \r\nAND Grp 1 & 2 Reports should be the number of approved reports that identify the player as a group 1 or 2 prospect that have been entered by the scout for the selected year. \r\nAND Grp 3, 4, 5 Reports should be the number of approved reports that identify the player as a group 3, 4 or 5 prospect that have been entered by the scout for the selected year.\r\n\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scouting_report_submissions\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scouting+Report+Submission+Widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1229483,
    "title": "As a user I want to see the scout name display on the scouting admin clipboard, International Scouting reports and Advanced Search",
    "section_id": 148743,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159522860",
    "created_by": 103,
    "created_on": 1533587664,
    "updated_by": 103,
    "updated_on": 1533587826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 8,
    "custom_preconds": "GIVEN scout profiles have been built\r\nAND user is logged in with scouting permissions (Clipboards, Reports, adv search etc)\r\n",
    "custom_steps": "WHEN user navigates to any of the following places:\r\n* The scout admin clipboard - Scout column \r\n* International Scouting reports- Entered by field \r\n* Daily Report- Scout Name field\r\n* Advanced Search Filters: \r\n      * Report Scout Name Filter should have list  of Scout profiles in the system\r\n* Advanced Search Results : \r\n       * Scout name column on search for daily reports \r\n       * Report Scout Name column on search for International Player reports",
    "custom_expected": "THEN scout name of the scout that entered the particular item should display instead of logged in username",
    "custom_steps_separated": null
  },
  {
    "id": 1228811,
    "title": "As a BOC user I want to view the Registration Reviews widget",
    "section_id": 148744,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158205057",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with permission to view the Registration Reviews widget\r\nAND user navigate to the International dashboard",
    "custom_steps": "WHEN user click on the International dashboard ",
    "custom_expected": "THEN  BOC users see a Registration Reviews widget directly under the Registration Admin widget on the L1 Reg tab of the International dashboard. \r\nAND The widget follows the provided data discovery and wireframe.\r\nAND The widget's default population is all REGISTERED profiles (no unregistered profiles display) with an Eligible to Sign date between the selected date range. \r\nAND The widget should ONLY display registration profiles that WERE NOT registered by the logged in user. \r\nAND The Review header filter should default to Review 1, which means that the widget should ONLY display profiles that do not yet have a completed First Review.\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_reviews\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Registration+Reviews+widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228812,
    "title": "As a BOC user I want to update multiple players' First Review using the Registration Reviews widget",
    "section_id": 148744,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158205064",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user is logged in with permission to view the Registration Reviews widget \r\nAND user navigate to the Registration Reviews widget",
    "custom_steps": "WHEN viewing the Registration Reviews widget with the header filter set to \"Review 1\"",
    "custom_expected": "THEN there should be an action button on the widget that reads \"Update Review 1\". \r\nAND This button should enable when one or more profiles is selected. \r\nAND Clicking this button should open a menu that allows the user to select what Registration Status to set the selected profile(s) to (should match the values available from the profile). \r\nAND If the user selects \"Verified\" outside of the verification window for first reviews, display the appropriate error.\r\nOR Otherwise, when the user selects the registration status, update all of the selected profiles' First Review to the selected value. \r\nAND Display a blue successful save notification that details how many Reviews were updated.\r\nAND Each profile should have their Review 1 information set appropriately. \r\nAND The widget should reload so that those profiles no longer display with the Review 1 header filter set IF the review 1 was set to Verified or Pre-Verified.\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_reviews\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Registration+Reviews+widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228813,
    "title": "As a BOC user I want to update multiple players' Second Review using the Registration Reviews widget",
    "section_id": 148744,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158205071",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user is logged in with permission to view the Registration Reviews widget \r\nAND user navigate to the Registration Reviews widget",
    "custom_steps": "WHEN viewing the Registration Reviews widget with the header filter set to \"Review 2\"",
    "custom_expected": "THEN the population of players should be all of those players that have already had Review 1 populated with a status of Verified or Pre-Verified, and have an \"open\" Review 2 field on their player profile (has not yet been set to Verified). \r\nAND When viewing the Registration Reviews widget with the header filter set to \"Review 2\",  there should be an action button on the widget that reads \"Update Review 2\". \r\nAND This button should enable when one or more profiles is selected. \r\nAND Clicking this button should open a menu that allows the user to select what Registration Status to set the selected profile(s) to (should match the values available from the profile). \r\nAND When the user selects the registration status, update all of the selected profiles' Second Review to the selected value. \r\nAND Display a blue successful save notification that details how many Reviews were updated.\r\nAND Each profile should have their Review 2 information set appropriately. \r\nAND The widget should reload so that those profiles no longer display with the Review 2 header filter set IF the review 2 was set to Verified.\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_reviews\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Registration+Reviews+widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228814,
    "title": "As a BOC user I want to update multiple players' Third Review using the Registration Reviews widget",
    "section_id": 148744,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158205075",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with permission to view the Registration Reviews widget \r\nAND user navigate to the Registration Reviews widget",
    "custom_steps": "WHEN viewing the Registration Reviews widget with the header filter set to \"Review 3\"",
    "custom_expected": "THEN the population of players should be all of those players that have already had Review 1 populated with a status of Verified or Pre-Verified, and have already had Review 2 populated with a status of Verified and have an \"open\" Review 3 field on their player profile that is NOT set to Verified. \r\nAND When viewing the Registration Reviews widget with the header filter set to \"Review 3\",  there should be an action button on the widget that reads \"Update Review 3\". \r\nAND This button should enable when one or more profiles is selected. \r\nAND Clicking this button should open a menu that allows the user to select what Registration Status to set the selected profile(s) to (should match the values available from the profile). \r\nAND When the user selects the registration status, update all of the selected profiles' Third Review to the selected value. \r\nAND Display a blue successful save notification that details how many Reviews were updated.\r\nAND Each profile should have their Review 3 information set appropriately. \r\nAND The widget should reload so that those profiles no longer display with the Review 3 header filter set IF the review 3 was set to Verified (these profiles will no longer appear in the widget at all).\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_reviews\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Registration+Reviews+widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1228815,
    "title": "Registration Reviews widget - Permissions",
    "section_id": 148744,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158205658",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368789,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is logged in with permissions for Registration Widget ",
    "custom_steps": "WHEN user attempts to do anything with Registration Widget",
    "custom_expected": "THEN Users without the permission should not see the widget on the L1 Reg tab. \r\nAND Only users with international amateur profile editors permissions should see the \"Update\" button on the widget at all. \r\nAND Add the new LDAP to test users 52 and 75.",
    "custom_steps_separated": null
  },
  {
    "id": 1228816,
    "title": "As a user I want the existing File Attachments utility updated to be able to bulk download Transactions attachments",
    "section_id": 148745,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158429705",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368888,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 1,
    "custom_preconds": "GIVEN a club or BOC user is logged in with MJ Transactions admin or Viewer permissions\r\nOR MN transactions admin  or Viewer permissions\r\n",
    "custom_steps": "WHEN user loads the file Attachments utility",
    "custom_expected": "THEN there is now a \"Type\" dropdown in addition to the other fields available. \r\nAND user should see \"Transactions\" as an option in this dropdown. \r\nAND When selecting \"Transactions\", the screen looks as it does in the wireframe.\r\nAND If a Club user is using this utility, they can ONLY use this for their own Organization. BOC should be able to select All or select Organizations. \r\nAND The Attachment Label dropdown should now have an \"All\" option, as well as have the option to select one or more of the available attachment labels if they unselect \"All\". \r\nAND When all of the required parameters have been entered, the Download and Generate Emails are both enabled.\r\nAND Clicking \"Download\" will download a zip file of all of the relevant attached files. \r\nAND Clicking \"Generate Email\" will generate one or more emails as required. \r\nAND Email feature should continue to work as originally designed:\r\nhttps://www.pivotaltracker.com/story/show/137747835\r\nhttps://www.pivotaltracker.com/story/show/137747647",
    "custom_steps_separated": null
  },
  {
    "id": 1228817,
    "title": "As a user I want the existing File Attachments utility updated to be able to bulk download Minor Contracts attachments",
    "section_id": 148745,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158429704",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368888,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 2,
    "custom_preconds": "GIVEN a club or BOC user is logged in with MN Contracts admin or Viewer permissions \r\n",
    "custom_steps": "WHEN user is viewing the File Attachments utility ",
    "custom_expected": "THEN they see \"Minor Contracts\" as an option in this dropdown. \r\nAND When selecting \"Minor Contracts\", the screen looks as it does in the wireframe.\r\nAND If a Club user is using this utility, they can ONLY use this for their own Organization. BOC should be able to select All or select Organizations. \r\nAND There should be a \"Minor Contract Type\" dropdown when Type is set to Minor Contracts. The options available in this multi-select dropdown should be First Year International, First Year Domestic and Non-First Year. The user should also have the ability to select all. \r\nAND There should be a \"Date Type\" dropdown when Type is set to Minor Contracts. The options available in this dropdown should be Signing Date, Approval Date and Terms Submitted Date. \r\nAND There should be a \"Starting Year\" dropdown that is optional. The options available here should be current year + 1 and back 10 years. \r\nAND The Attachment Label dropdown should have an \"All\" option, as well as have the option to select one or more of the available attachment labels if they unselect \"All\". \r\nAND When all of the required parameters have been entered, the Download and Generate Emails are both enabled.\r\nAND Clicking \"Download\" will download a zip file of all of the relevant attached files. \r\n  - Only MN Contracts that have reached an Approved or higher status should be included (Terminated, Expired should be included in addition to Approved, but not Rejected/Withdrawn or any status lower than Approved)\r\nAND Clicking \"Generate Email\" will generate one or more emails as required. \r\nAND Email feature should continue to work as originally designed:\r\nhttps://www.pivotaltracker.com/story/show/137747835\r\nhttps://www.pivotaltracker.com/story/show/137747647\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=file_attachments_-_minor_contracts",
    "custom_steps_separated": null
  },
  {
    "id": 1228818,
    "title": "As a user I want the existing File Attachments utility updated to be able to bulk download Major Contracts attachments",
    "section_id": 148745,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158429702",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368888,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 3,
    "custom_preconds": "GIVEN a club or BOC user is logged in with MJ Contracts admin or Viewer permissions",
    "custom_steps": "WHEN user is viewing the File Attachments utility",
    "custom_expected": "THEN they see \"Major Contracts\" as an option in this dropdown. \r\nAND When selecting \"Major Contracts\", the screen looks as it does in the wireframe.\r\nAND If a Club user is using this utility, they can ONLY use this for their own Organization. BOC should be able to select All or select Organizations. \r\nAND There should be a \"Date Type\" dropdown when Type is set to Minor Contracts. The options available in this dropdown should be Signing Date, Approval Date and Terms ConfirmedDate. \r\nAND There should be a \"Starting Year\" dropdown that is optional. The options available here should be current year + 1 and back 10 years. \r\nAND The Attachment Label dropdown should have an \"All\" option, as well as have the option to select one or more of the available attachment labels if they unselect \"All\". \r\nAND When all of the required parameters have been entered, the Download and Generate Emails are both enabled.\r\nAND Clicking \"Download\" will download a zip file of all of the relevant attached files. \r\n  - Only MJ Contracts that have reached an Approved or higher status should be included (Terminated, Expired, Superceded should be included in addition to Approved, but not any status lower than Approved)\r\nAND Clicking \"Generate Email\" will generate one or more emails as required. \r\nAND Email feature should continue to work as originally designed:\r\nhttps://www.pivotaltracker.com/story/show/137747835\r\nhttps://www.pivotaltracker.com/story/show/137747647\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=file_attachments_-_major_contracts",
    "custom_steps_separated": null
  },
  {
    "id": 1228819,
    "title": "As a user I want the existing File Attachments utility updated to be able to bulk download Addendum C attachments",
    "section_id": 148745,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158429692",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532368888,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 4,
    "custom_preconds": "GIVEN a club or BOC user is logged in with MN Contracts admin or Viewer permissions",
    "custom_steps": "WHEN user is viewing the File Attachments utility",
    "custom_expected": "THEN they see \"Addendum C\" as an option in this dropdown. \r\nAND When selecting \"Minor Contracts\", the screen looks as it does in the wireframe.\r\nAND If a Club user is using this utility, they can ONLY use this for their own Organization. BOC should be able to select All or select Organizations. \r\nAND There should be a \"Date Type\" dropdown when Type is set to Minor Contracts. The options available in this dropdown should be Signing Date and Approval Date. \r\nAND The Attachment Label dropdown should have an \"All\" option, as well as have the option to select one or more of the available attachment labels if they unselect \"All\". \r\nAND When all of the required parameters have been entered, the Download and Generate Emails are both enabled.\r\nAND Clicking \"Download\" will download a zip file of all of the relevant attached files. \r\n  - Only Addendum Cs that have reached an Approved status should be included. \r\nAND Clicking \"Generate Email\" will generate one or more emails as required. \r\nAND Email feature should continue to work as originally designed:\r\nhttps://www.pivotaltracker.com/story/show/137747835\r\nhttps://www.pivotaltracker.com/story/show/137747647\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=file_attachments_-_addendum_c",
    "custom_steps_separated": null
  },
  {
    "id": 1228821,
    "title": "When running batches, check any required fields",
    "section_id": 148746,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154739752",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532369196,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user logs in with permission to run batches\r\n\r\n\r\n",
    "custom_steps": "WHEN user runs the any Batch without filling out all the required field(s)",
    "custom_expected": "THEN user should see an error message that required field must not be blank ",
    "custom_steps_separated": null
  },
  {
    "id": 1228822,
    "title": "As a user I want blue notifications and red alerts to display properly on mobile.",
    "section_id": 148746,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154151053",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532369196,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 2,
    "custom_preconds": "GIVEN a club or BOC user is logged  to ebis in mobile view ",
    "custom_steps": "WHEN user submit or Approve contracts or transactions ",
    "custom_expected": "THEN The entire blue notification or alert should visible on all screen sizes\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1228823,
    "title": "As a user, I want tables to be sized appropriately and not have unnecessary scroll bars",
    "section_id": 148746,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153329480",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532369196,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 3,
    "custom_preconds": "GIVEN club or BOC user logged in with normal browser sizes at 100% zoom\r\n",
    "custom_steps": "WHEN user viewing tables in the UI (CSP Summaries, MJCs, Trades, Batches) ",
    "custom_expected": "THEN the system should display without unnecessary scroll bars at normal browser sizes and 100% zoom when the content of the table all fits without need for a scroll bar\r\nAND We need to make sure these items are sized according to global UI standards and scroll bars should only appear when the table has reached its maximum designated size and they are needed to display more content.\r\n\r\nWireframes:\r\nhttps://ll2j6l.axshare.com/#p=csp\r\nhttps://ll2j6l.axshare.com/#p=cep\r\nhttps://t4lvuq.axshare.com/#p=view_an_existing_trade",
    "custom_steps_separated": null
  },
  {
    "id": 1228824,
    "title": "Account for transaction reversals in player snapshot",
    "section_id": 148746,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "146094811",
    "created_by": 103,
    "created_on": 1531767471,
    "updated_by": 136,
    "updated_on": 1532369196,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC approver logs \r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user reverse any transaction(s)",
    "custom_expected": "THEN system should capture player snapshots on savePlayer from the PlayerService(Backend)",
    "custom_steps_separated": null
  },
  {
    "id": 1227842,
    "title": "As a scouting user, I want to add a player to the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169575",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 1,
    "custom_preconds": "GIVEN scouting user logged in with permissions to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks an \"Add Row button\"",
    "custom_expected": "THEN Clicking the button will add a row to the bottom of the widget\r\nAND The widget will auto-scroll so the new row is in view\r\nAND The widget will also auto-horizontal scroll so the Name field is in view and in focus.  \r\nAND The new row will be in edit mode\r\nAND The player's **Name** box will be an auto-complete with the same population as International Amateur quick search for the viewing user (including any visibility restrictions)\r\nAND Selecting a player from the auto-complete will populate all the appropriate fields with the correct data points from the player's profile\r\nAND Address, Phone and Trainer Name should use the primary of the Scout version of the Contact information, if it exists. If not, this should not prepopulate with any value.\r\nAND In the unlikely event there is more than one Scout set of information, pick the most recent. \r\nAND The user should be able to tab from field to field and should be able to edit any of the prepopulated values.  If the next field is out of view the widget should auto scroll so it is in view.  \r\nAND There should be a red X available on the row when it is added. Clicking this red x will remove the newly added row.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1227843,
    "title": "As a scouting user, I want to free-type a player into the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169580",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 2,
    "custom_preconds": "GIVEN a scouting user logged in with permission to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks an \"Add Row button\"",
    "custom_expected": "THEN Users will also be able to free type a name into the Name box instead of selecting an existing player\r\nAND When free typing a new player, no columns will populate with values\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227845,
    "title": "As a scouting user, I want to edit an existing row of the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158204644",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 3,
    "custom_preconds": "GIVEN scouting user logged in with permissions to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks the \"trash can icon\" (there should be a trash can icon associated with each row)",
    "custom_expected": "THEN the system should prompt the user to confirm that they wish to delete the associated row. \r\nAND If the user confirms, the row is permanently deleted (do NOT need to do an overall widget save). If the user does not confirm then the user is returned to the widget with the row still available.  \r\nAND There should be a pencil icon associated with each row that is in view mode.\r\nAND Clicking the pencil icon should place the entire row in edit mode.\r\nAND There should be a red x icon when the row is in edit mode. As long as the row has been saved at least once before (is not a newly added row) clicking this x should cancel any edits made to the row and place the row back in view mode. \r\nAND When any row is in edit mode, there is a Save button. Clicking Save should save the changes made and place all rows in view mode.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1227846,
    "title": "As a scouting user, I want to Export the International Video Log to Excel",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169579",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 4,
    "custom_preconds": "GIVEN a scouting user logged in with permission to edit International Video Log\r\nAND user navigate to the Video log widget \r\n",
    "custom_steps": "WHEN user clicks an \"Export to Excel\" button ",
    "custom_expected": "THEN This button is only available when no rows are currently in edit mode.\r\nAND Clicking the button will create an Excel export and open it in Excel\r\nAND The Excel file will match the attached example, **both in layout and formatting**\r\nAND Player Status for all players will be \"INTL\"\r\nAND Video By will be blank for now\r\nNote: There will be some blank columns included in the export that do not appear in the widget\r\nAND The file should export as a CSV\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1227847,
    "title": "As a scouting user, I want to clear the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169581",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 5,
    "custom_preconds": "GIVEN scouting user logs in with permissions to edit International Video Log\r\n\r\n",
    "custom_steps": "WHEN user navigates to the video log widget\r\n\r\n",
    "custom_expected": "THEN there will be a Clear Log button on the video log as depicted in the wire\r\nAND This button is only available when there are no rows in edit mode. \r\nAND Clicking the Clear Log button will prompt the user to confirm that they wish to clear the log (this is a permanent action and cannot be undone)\r\nAND If they confirm the decision, all the information in the video log will be cleared and will not be retained by the system.  The video log will be saved and the system will display a blue success notification (\"The Video Log has been cleared\")\r\nAND If they do not confirm the decision, the user will be returned to the form and no action will be taken.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1227841,
    "title": "As a scouting user, I want to View the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169574",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC user is logged with permission to view the International Video Log\r\nAND user navigate to the Scouting dashboard\r\n",
    "custom_steps": "WHEN user clicks \"Video Log tab\"",
    "custom_expected": "THEN On this tab there will be an International Video Log widget\r\nAND The widget will match the provided wire and data discovery\r\nAND The video log is unique to each user.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n\r\n*Note that the domestic version of this widget has already been built by LL*",
    "custom_steps_separated": null
  },
  {
    "id": 1227844,
    "title": "As a scouting user, I want to Save the International Video Log",
    "section_id": 148796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169577",
    "created_by": 103,
    "created_on": 1530894496,
    "updated_by": 103,
    "updated_on": 1533587604,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20518,
    "display_order": 7,
    "custom_preconds": "GIVEN a scouting user is logged in with permission to edit International Video Log\r\n",
    "custom_steps": "WHEN user is adding a player to the International video log on the widget",
    "custom_expected": "THEN There will also be a \"Cancel all changes\" button anytime at least one row is in edit mode.\r\nAND Clicking \"Cancel all changes\" will cancel any changes made to the widget, including any row additions, and reload the widget in view mode.\r\nAND Clicking  \"Save\" will store the current values and the widget will reload with all rows in view mode\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND The next time the widget is loaded, the saved values will be displayed\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  }
]