[
  {
    "id": 16464370,
    "title": "As a club, I want to view a Preliminary Highmark bill",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 207,
    "updated_on": 1618933985,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 1,
    "custom_preconds": "-- User is a Club User with MN Insurance perms\r\n\r\n'**Wire**\r\nhttp://7xflwf.axshare.com/#p=pending_bill",
    "custom_steps": "WHEN a Club User navigates to MN Insurance dashboard a club navigates to this dashboard",
    "custom_expected": "THEN the user will see the \"Minor League Health & Wellness Plan Form C-Eligibility Adjustment\" form as shown in the wire\r\nAND the 'Last' bill date is defaulted to \"pending\" which is the next upcoming bill\r\nAND the status for a new bill is \"preliminary\" (preliminary = red) \r\nAND there is a note to remind clubs to submit adjustments by the 12th of each month\r\nAND there is a 'Edit' and 'Close' button enabled\r\nAND 'Submit to Boc' button disabled",
    "custom_steps_separated": null
  },
  {
    "id": 16791851,
    "title": "As a club, I want to enter adjustments to my Highmark bill for BOC review",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 207,
    "created_on": 1618934304,
    "updated_by": 207,
    "updated_on": 1618934466,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 2,
    "custom_preconds": "-- Club User is viewing a preliminary Highmark bill\r\n\r\n-- Wire\r\nhttp://7xflwf.axshare.com/#p=pending_bill",
    "custom_steps": "WHEN club user views a preliminary Highmark bill \r\nAND clicks on 'Edit' \r\n",
    "custom_expected": "THEN once in 'Edit' mode, the 'Last Bill' date field is locked down and cannot be changed\r\nAND IF there are no rows in the table, the system will automatically add the first row\r\nAND user can select from a \"type to search\" dropdown list of player roster name (population of DD should match the Quick Search pro player listing)\r\nAND Club can add multiple rows/players and delete any row\r\nAND Club can save the form (Save and Cancel buttons should match global behavior)\r\nAND 'Submit to Boc' button should be enabled in 'Edit' mode",
    "custom_steps_separated": null
  },
  {
    "id": 16464371,
    "title": "As a club, I want to easily view player history when entering adjustments",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 207,
    "updated_on": 1618934946,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 3,
    "custom_preconds": "-- Club User has added a player to the Highmark Bill\r\n\r\n-- Wire:\r\n- For view button on Pending bill:\r\nhttp://7xflwf.axshare.com/#p=pending_bill\r\n\r\n- For Player History modal\r\nhttp://7xflwf.axshare.com/#p=view_history\r\n",
    "custom_steps": "WHEN viewing the player's row\r\nAND clicks on the 'View' button",
    "custom_expected": "THEN the Player's history will display in a modal\r\nAND any 'Pending' or unapproved entries should be in green similar to the Player History on a player profile\r\nAND the player history modal has a 'Close' button that returns user back to the 'Pending bill'\r\nAND the 'View' button is disabled until a player is selected",
    "custom_steps_separated": null
  },
  {
    "id": 16464372,
    "title": "As a club, I want to enter details of the adjustment for each player",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 207,
    "updated_on": 1618936170,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 4,
    "custom_preconds": "-- user is a Club user\r\n-- viewing Highmark bill in edit mode\r\n\r\n'**Wire**\r\nhttp://7xflwf.axshare.com/#p=pending_bill",
    "custom_steps": "WHEN user views the row in edit mode\r\nAND adds a player",
    "custom_expected": "THEN for each adjustment row, club can enter the following fields for each added row:\r\n-- Effective date - defaults to blank and is a date picker \r\n-- Adjustment dropdown menu is blank by default. Available options are:\r\n   - Add (Bill Discrepancy)\r\n   - Add (Restricted List)\r\n   - Correction \r\n   - Delete (Bill Discrepancy)\r\n   - Delete (Restricted List)\r\nAND the 'Reason' field is a text field and not required\r\nAND 'Decision' and 'Comments' columns are visible but not editable to clubs\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 16464373,
    "title": "As Club/BOC, I only want users with the right permissions to access MN insurance",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "'**AC**\n- Users with MN Insurance Club-Basic have read-only access to MN insurance for their own club. They can view existing data but cannot edit or make state changes\n- Users with MN Insurance Club-Admin have full access to the MN insurance workflows for their own club\n- Users with MN Insurance BOC Basic have read-only access to MN insurance for all BOC functions. They can view existing data but cannot edit or make state changes\n- Users with MN Insurance BOC Admin have full access to MN insurance for all BOC functions.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16464374,
    "title": "As BOC HR, I can enter adjustments on behalf of clubs",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 6,
    "custom_preconds": null,
    "custom_steps": "'Wireframe:\nhttp://7xflwf.axshare.com/#p=review_pending_bill\n\n**AC**\n- BOC users can perform all actions that clubs can perform such as adding additional player rows and editing existing rows\n- They can also navigate to any Org that doesn't yet have a list for the current month and start adding players\n- BOC users can submit the list to BOC on behalf of Club",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16464375,
    "title": "As BOC HR, I want to mark a list of adjustments as reviewed",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 7,
    "custom_preconds": null,
    "custom_steps": "'Wireframe:\nhttp://7xflwf.axshare.com/#p=review_pending_bill\n\n**AC**\n- BOC can use the \"Mark Reviewed\" button to update the status of the form to \"Reviewed\".\n- Rule checks are run on any required fields. \n- The \"Decision\" field is also required on every row when marking a list as Reviewed. If it is not populated, show required field error to BOC\n- Once status has successfully updated, show blue notification \"Successfully marked Reviewed\"\n- Once reviewed, the button is no longer visible\n- If the form was in edit mode, reload into view mode.\n- Once a list is reviewed, the clubs are no longer able to edit the list though BOC can still make changes",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16464376,
    "title": "As BOC HR, I want to review each player and enter my decision on the adjustment",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 8,
    "custom_preconds": null,
    "custom_steps": "'**Wireframe:**\nhttp://7xflwf.axshare.com/#p=review_pending_bill\n\n**AC**\n- BOC can click on the status column of the MN insurance widget to view the list submitted by club\n- BOC users can put the form in edit mode and update the 'Decision' and 'Comments' columns as well as any other column that was editable by club.\n- The \"Decision\" dropdown is blank by default and has options \"Approved\" and \"Denied\"\n- Once BOC saves changes, the clubs can also view the changes as well as any decision or comments entered by BOC\n- Comments field should follow global behavior. In edit mode, a light blue bubble shows on all rows. If comment is added, it is dark blue. In view mode, a dark blue bubble only appears on rows with comments. There is no bubble on other rows.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16464377,
    "title": "As a club, I want to submit all adjustments to BOC for review",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 9,
    "custom_preconds": null,
    "custom_steps": "'**Wire**\nhttp://7xflwf.axshare.com/#p=pending_bill\n\n**AC**\n- Once a club has added at least one player to the list, the Submit to BOC button becomes enabled. Until then it should be disabled.\n- When club submits adjustments to BOC, system should do a required field check and show required field hard errors as needed\n- Once submitted successfully, update the status of the form to \"Submitted\" and throw a successful blue notification \"Successfully submitted\"\n- The username and the date/time of the submission should show in the \"Submitted to BOC\" field\n- Once Submitted, there is no longer a Submit to BOC button\n- Club can continue to add rows during Submitted state. The \"Save\" and \"Cancel\" buttons are still available. On saving, the system should update the date/time stamp to the new time and a blue notification is thrown.\n- If the decision column is not yet populated, club can also edit those rows. If Decision column is populated, row is locked for editing when list is in a submitted state",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16464378,
    "title": "As BOC HR, I want to submit the final list to Highmark",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 207,
    "updated_on": 1618931705,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 10,
    "custom_preconds": "-- User is a BOC MN Insurance Admin \r\n-- User is viewing the MN Insurance widget\r\n\r\nWireframe:\r\nhttp://7xflwf.axshare.com/#p=minor_league_insurance_widget",
    "custom_steps": "WHEN User clicks the \"Submit to Highmark\" button available on the widget",
    "custom_expected": "THEN a confirmation modal will display prompting user to confirm they wish to submit all reviewed adjustments to the Highmark\r\nAND the following will display:\r\n-- Message text: \"Are you sure you want to submit all reviewed adjustments to the Highmark?\"\r\n-- Buttons available are 'OK' and 'Cancel'\r\n-- Clicking 'Cancel' returns the user to the form without any action being taken.\r\n-- Clicking 'OK' proceeds with the submission and performs the following updates:\r\n       - Update all of the Pending bills with a status of 'Reviewed' to have a status of 'Finalized'\r\n       - Enable the next \"Pending Bill\" for Club users. ",
    "custom_steps_separated": null
  },
  {
    "id": 16464379,
    "title": "As BOC HR, I can preview the report that will get sent to Highmark",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1616595479,
    "updated_by": 103,
    "updated_on": 1616595479,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 11,
    "custom_preconds": null,
    "custom_steps": null,
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16707596,
    "title": "As a Highmark User, I don't want to receive blank addresses from ebis",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "811846",
    "created_by": 207,
    "created_on": 1618348741,
    "updated_by": 207,
    "updated_on": 1618930782,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 12,
    "custom_preconds": "-- Player has a blank address on the Player Profile - Contact Information\r\n-- AND an active contract",
    "custom_steps": "WHEN the Highmark batch runs\r\nAND IF there is no address on the player's profile\r\n",
    "custom_expected": "THEN the batch will take the address entered on the contract and send that instead",
    "custom_steps_separated": null
  },
  {
    "id": 16707597,
    "title": "As a Highmark User, I want users prevented from entering fake SSNs on player profiles",
    "section_id": 749599,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "811840",
    "created_by": 207,
    "created_on": 1618348741,
    "updated_by": 207,
    "updated_on": 1618930209,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 13,
    "custom_preconds": "-- User is viewing the National ID section on the Player Info tab of a player profile in edit mode \r\n\r\n-- Current requirement rules will remain unchanged:\r\n  -- i.e. SSN is not require to make update to an amateur profile, but is required to submit a contract",
    "custom_steps": "WHEN USER selects SSN# from dropdown menu\r\nAND  USER enters the same digit consecutively for the whole Social Security\r\n    -- i.e. 000000000, 111111111, 222222222\r\nAND clicks Save\r\n\r\n",
    "custom_expected": "THEN the rule check will run on Save\r\nAND the system will return a Error message for Club User/BOC User \r\n Header: Error\r\n   Body: You must enter a valid Social Security Number.\r\nButtons: Back",
    "custom_steps_separated": null
  },
  {
    "id": 16707598,
    "title": "As a User, I want to verify the Highmark batch works as expected for OD",
    "section_id": 768061,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "809501",
    "created_by": 207,
    "created_on": 1618348741,
    "updated_by": 207,
    "updated_on": 1618418909,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n - Batch should run as expected\r\n - Players should be correctly moved between Major and Minor League insurance",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 16716511,
    "title": "When the Highmark batch sends a 'REMOVE-MJ' record, set the effective date back two days.",
    "section_id": 768061,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 207,
    "created_on": 1618416321,
    "updated_by": 207,
    "updated_on": 1618929327,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 3,
    "custom_preconds": " -- Use Minor League Player who currently DOES NOT have Major League Insurance and DOES have Minor League Insurance (view General Info section of the Player Info tab)\r\n\r\nWhen the highmark batch runs on opening day it will detect any players who were selected to the MJ roster in the offseason and now have MJ insurance and send them over as 'REMOVE-MJ'  The date on this should be set back to the day prior to opening day.\r\nTesting this is complicated because its intertwined with the MJ insurance batch, the first day of mj season, the timing of the batch runs and the saving of opening day rosters.  The following steps should create the scenario appropriately.",
    "custom_steps": "WHEN user Logs in as BOC Approver\r\nAND back dates a 'MJ Selection' transaction for a minor league player who currently DOES NOT have MJ insurance and DOES have MN insurance to a prior date.\r\nAND Set the first day of major league season to yesterday\r\nAND Save the MJ opening day rosters for all orgs\r\nAND Run the MJ insurance batch\r\nAND Run the Highmark Insurance batch",
    "custom_expected": "THEN after running the MJ insurance batch - the players selected should show up as 'SET' and MJ insurance value should now be set to YES\r\n\r\nAND THEN after the Highmark Insurance Batch is run, it should detect the player as a REMOVE-MJ record and the effective date on that record should be set to two days prior (the day prior to opening day)",
    "custom_steps_separated": null
  },
  {
    "id": 16716510,
    "title": "When the Highmark batch sends a 'Player lost MJ insurance, has MN' record, set the effective date to Opening Day",
    "section_id": 768061,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 207,
    "created_on": 1618415732,
    "updated_by": 207,
    "updated_on": 1618929757,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 4,
    "custom_preconds": "-- User is BOC Approver\r\n-- User selects player who had a (current Year minus one) Major Contract BUT is currently Released or a Free Agent. (any Org but CLE)\r\n\r\nWhen the Highmark batch runs on Opening Day it will detect any players who were removed from an MJ roster in the offseason, are now on an MN roster, and now have MN insurance and send them over as 'Player lost MJ insurance, has MN'. The date on this should be set to Opening Day.\r\nTesting this is complicated because its intertwined with the MJ insurance batch, the first day of the MJ season, the timing of the batch runs and the saving of Opening Day rosters.  The following steps should create the scenario appropriately.",
    "custom_steps": "WHEN user Signs player to an MN contract (any org but CLE) and make the signing date and approval date several days prior to Opening Day.\r\nAND Set the first day of Major League season to yesterday.\r\nAND Save the MJ Opening Day rosters for all orgs.\r\nAND Run the MJ insurance batch - the player from step 1 should show up as a 'UNSET' and their MJ insurance value should now be set to No.\r\nAND WHEN BOC Approver runs the Highmark insurance batch, ",
    "custom_expected": "THEN it should detect the player as a 'Player lost MJ insurance, has MN' record'\r\nAND the effective date on that record should be set to Opening Day \r\nAND their MN Insurance value should be set to Yes",
    "custom_steps_separated": null
  },
  {
    "id": 22408578,
    "title": "As a Highmark User, I want users prevented from entering fake SSNs on player profiles",
    "section_id": 1138794,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "811840",
    "created_by": 207,
    "created_on": 1629828606,
    "updated_by": 207,
    "updated_on": 1629828606,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n - There will be a new rule to prevent the same digit from being entered for an entire SSN\r\n  -- i.e. 000000000, 111111111, 222222222 will not be allowed\r\n - The new rule check will run on save\r\n - If the check fails, the following error will be returned:\r\n  -- Header: Error\r\n  -- Body: You must enter a valid Social Security Number.\r\n  -- Buttons: Back\r\n - Current requirement rules will remain unchanged:\r\n  -- i.e. SSN is not require to make update to an amateur profile, but is required to submit a contract",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22408579,
    "title": "As a Highmark User, I want users prevented from entering fake SSNs on player profiles",
    "section_id": 1138795,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "811840",
    "created_by": 207,
    "created_on": 1629828663,
    "updated_by": 207,
    "updated_on": 1629828663,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 212084,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n - There will be a new rule to prevent the same digit from being entered for an entire SSN\r\n  -- i.e. 000000000, 111111111, 222222222 will not be allowed\r\n - The new rule check will run on save\r\n - If the check fails, the following error will be returned:\r\n  -- Header: Error\r\n  -- Body: You must enter a valid Social Security Number.\r\n  -- Buttons: Back\r\n - Current requirement rules will remain unchanged:\r\n  -- i.e. SSN is not require to make update to an amateur profile, but is required to submit a contract",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]