[
  {
    "id": 1230428,
    "title": "As a scouting admin I want to create a new Scout profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203465",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 1,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget \r\n",
    "custom_steps": "WHEN user click on Create New button on the widget ",
    "custom_expected": "THEN Clicking the Create New button will open a new Scout profile per the provided data discovery and wireframe.\r\nAND A Save button is available in addition to a Cancel button.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the new profile is discarded and the user is returned to their point of entry.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230429,
    "title": "As a scouting admin I want to view the Scout Directory",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169116",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 2,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to view the Scout Directory\r\nAND user navigate to the Scouting dashboard ",
    "custom_steps": "WHEN user click on Scouts tab in the scouting dashboard ",
    "custom_expected": "THAN The Scout Directory should be available for users that have permission to see it on the \"Scouts\" tab. \r\nAND The directory matches the provided wireframe and data discovery. \r\nAND EBIS-WIDGET-SCOUT-DIRECTORY-VIEWERS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND By default only Active profiles are displayed, but the user can use the header filter to display all or only Inactive profiles as well.\r\nAND The widget should be sorted alphabetically by scout name. \r\nAND Default filter and export widget behavior should work.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_directory\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Directory+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230430,
    "title": "As a scouting admin I want to view a Scout profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169115",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 3,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to view the Scout profile\r\nAND user navigate to the the Scout Directory",
    "custom_steps": "WHEN user click on a scout name in the Scout Directory ",
    "custom_expected": "THEN  The scout's profile opens if the logged in user has permission to see the Scout profile. By default this should land on the \"Info\"  tab of the profile. \r\nAND The Info tab of the profile matches the provided wireframe and data discovery. \r\nAND EBIS-SCOUT-EDITORS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND EBIS-SCOUT-VIEWERS should be added to  test_ebis_user78@mlb.com. \r\nAND This story does NOT include the \"Players\" tab of the profile. \r\nAND There is a \"Close\" button on the profile in view mode.\r\nAND Clicking \"Close\" will close the profile and return the user to the point of entry.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_info\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230431,
    "title": "As a scouting admin I want to view the Players tab of a Scout's profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169622",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 4,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to edit (EBIS-SCOUT-EDITORS) the Scout profile\r\nAND user navigate to the the Scout Directory\r\nAND user click on a scout name in the Scout Directory",
    "custom_steps": "WHEN user click on the \"Players\" tab on the profile ",
    "custom_expected": "THAN  The Players tab follows the provided wireframe and data discovery.\r\nAND Any player that appears in an APPROVED scouting report entered by the scout whose profile is being viewed appears in the widget. (will need to use the email address entered on the scout profile to make this mapping)\r\nAND If the player has a more than one report added by the same scout, we would show the latest report entered\r\nAND  This tab does  NOT appear if the user is only a viewer. \r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_players\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Players+Tab+-Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230432,
    "title": "As a scouting admin I want to save a new Scout profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203472",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 5,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget\r\nAND user is creating a new scout profile",
    "custom_steps": "WHEN user clicks \"Save\" ",
    "custom_expected": "The system will run a required field and format check. If this passes, a blue successful save notification is displayed. \r\nAND The profile is assigned a status of \"Approved\".\r\nAND The scout's profile should appear in the Scout Directory.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile_-_info\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1230433,
    "title": "As a scouting admin I want to edit an existing Scout profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158203475",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 6,
    "custom_preconds": "GIVEN a scouting admin is logged in with permission to create new scout profile(EBIS-SCOUT-EDITORS)\r\nAND user navigate to Scout Directory widget\r\nAND user loads the existing Scout profile \r\n",
    "custom_steps": "WHEN user click on an Edit button on the scout profile ",
    "custom_expected": "THAN Clicking the edit button will reload the profile in edit mode per the provided data discovery and wireframe.\r\nAND A Save button is available in addition to a Cancel button.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to lose their changes. If they confirm, the profile is reloaded in view mode and no changes are maintained.\r\nAND Clicking \"Save\" should run a required field and format check and store any changes made, including to the \"Active\" flag.\r\nAND A blue successful save notification should be displayed and the profile reloaded in View mode with the changes maintained.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_profile\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Profile+-+Info+Tab+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1230434,
    "title": "As a scouting admin I want to view the Scouting Report Submission Widget",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158204908",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 7,
    "custom_preconds": "GIVEN a Scouting admin is logged in with the permission to the Scout Director widget \r\nOR the scouting Report Submission widget \r\nAND user navigate to Scouting dashboard ",
    "custom_steps": "WHEN user click on Scouts tan on the Scouting dashboard ",
    "custom_expected": "THEN The Scouting Report Submission widget should be the first widget to display on the tab for users that have permission to see it. \r\nAND The widget matches the provided wireframe and data discovery. \r\nAND EBIS-WIDGET-SCOUTING-SUBMISSION-DETAIL-VIEWERS is the existing LDAP for this - please add this permission to  test_ebis_user74@mlb.com and user 75 prior to delivering this story. \r\nAND A line should appear in the widget for each ACTIVE scout profile found in the system.\r\nAND The year header filter should default to the current year, with the previous 5 years available as well. \r\nAND The widget should be sorted alphabetically by scout name. \r\nAND Default filter and export widget behavior should work. \r\nAND Region and Scout Name should come from the scout's profile. Scout Name should be a hyperlink to the scout's profile. \r\nAND Reports Submitted should be the number of APPROVED reports for the selected year entered by the corresponding scout.\r\nAND Players Reported On should be the number of players included in ALL APPROVED reports for the selected year entered by the corresponding scout. \r\nAND Prospect should be the number of approved prospect reports for the selected year entered by the corresponding scout (will always be 0 for now..).\r\nAND Int'l Workout should be the number of approved International Workout reports for the selected year entered by the corresponding scout.\r\nAND Daily Reports should be the number of approved Daily reports for the selected year entered by the corresponding scout. \r\nAND Grp 1 & 2 Reports should be the number of approved reports that identify the player as a group 1 or 2 prospect that have been entered by the scout for the selected year. \r\nAND Grp 3, 4, 5 Reports should be the number of approved reports that identify the player as a group 3, 4 or 5 prospect that have been entered by the scout for the selected year.\r\n\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scouting_report_submissions\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scouting+Report+Submission+Widget+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230435,
    "title": "As a user I want to see the scout name display on the scouting admin clipboard, International Scouting reports and Advanced Search",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159522860",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 8,
    "custom_preconds": "GIVEN scout profiles have been built\r\nAND user is logged in with scouting permissions (Clipboards, Reports, adv search etc)\r\n",
    "custom_steps": "WHEN user navigates to any of the following places:\r\n* The scout admin clipboard - Scout column \r\n* International Scouting reports- Entered by field \r\n* Daily Report- Scout Name field\r\n* Advanced Search Filters: \r\n      * Report Scout Name Filter should have list  of Scout profiles in the system\r\n* Advanced Search Results : \r\n       * Scout name column on search for daily reports \r\n       * Report Scout Name column on search for International Player reports",
    "custom_expected": "THEN scout name of the scout that entered the particular item should display instead of logged in username",
    "custom_steps_separated": null
  },
  {
    "id": 1230473,
    "title": "As a user I want the existing scout profiles converted to the new scout profile",
    "section_id": 149105,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "160029091",
    "created_by": 103,
    "created_on": 1536698122,
    "updated_by": 103,
    "updated_on": 1536698122,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 9,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria:\n* The existing scout profiles are converted so that they are visible in the Scout Directory widget just like newly created profiles.\n* The data from the profiles is maintained and correctly displayed (except for those fields that we removed from the profile).",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230421,
    "title": "As a scouting user, I want to add a player to the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169575",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 1,
    "custom_preconds": "GIVEN scouting user logged in with permissions to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks an \"Add Row button\"",
    "custom_expected": "THEN Clicking the button will add a row to the bottom of the widget\r\nAND The widget will auto-scroll so the new row is in view\r\nAND The widget will also auto-horizontal scroll so the Name field is in view and in focus.  \r\nAND The new row will be in edit mode\r\nAND The player's **Name** box will be an auto-complete with the same population as International Amateur quick search for the viewing user (including any visibility restrictions)\r\nAND Selecting a player from the auto-complete will populate all the appropriate fields with the correct data points from the player's profile\r\nAND Address, Phone and Trainer Name should use the primary of the Scout version of the Contact information, if it exists. If not, this should not prepopulate with any value.\r\nAND In the unlikely event there is more than one Scout set of information, pick the most recent. \r\nAND The user should be able to tab from field to field and should be able to edit any of the prepopulated values.  If the next field is out of view the widget should auto scroll so it is in view.  \r\nAND There should be a red X available on the row when it is added. Clicking this red x will remove the newly added row.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230422,
    "title": "As a scouting user, I want to free-type a player into the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169580",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 2,
    "custom_preconds": "GIVEN a scouting user logged in with permission to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks an \"Add Row button\"",
    "custom_expected": "THEN Users will also be able to free type a name into the Name box instead of selecting an existing player\r\nAND When free typing a new player, no columns will populate with values\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1230423,
    "title": "As a scouting user, I want to edit an existing row of the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158204644",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 3,
    "custom_preconds": "GIVEN scouting user logged in with permissions to edit International Video Log\r\nAND user navigate to the video log widget",
    "custom_steps": "WHEN user clicks the \"trash can icon\" (there should be a trash can icon associated with each row)",
    "custom_expected": "THEN the system should prompt the user to confirm that they wish to delete the associated row. \r\nAND If the user confirms, the row is permanently deleted (do NOT need to do an overall widget save). If the user does not confirm then the user is returned to the widget with the row still available.  \r\nAND There should be a pencil icon associated with each row that is in view mode.\r\nAND Clicking the pencil icon should place the entire row in edit mode.\r\nAND There should be a red x icon when the row is in edit mode. As long as the row has been saved at least once before (is not a newly added row) clicking this x should cancel any edits made to the row and place the row back in view mode. \r\nAND When any row is in edit mode, there is a Save button. Clicking Save should save the changes made and place all rows in view mode.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230424,
    "title": "As a scouting user, I want to Export the International Video Log to Excel",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169579",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 4,
    "custom_preconds": "GIVEN a scouting user logged in with permission to edit International Video Log\r\nAND user navigate to the Video log widget \r\n",
    "custom_steps": "WHEN user clicks an \"Export to Excel\" button ",
    "custom_expected": "THEN This button is only available when no rows are currently in edit mode.\r\nAND Clicking the button will create an Excel export and open it in Excel\r\nAND The Excel file will match the attached example, **both in layout and formatting**\r\nAND Player Status for all players will be \"INTL\"\r\nAND Video By will be blank for now\r\nNote: There will be some blank columns included in the export that do not appear in the widget\r\nAND The file should export as a CSV\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230425,
    "title": "As a scouting user, I want to clear the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169581",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 5,
    "custom_preconds": "GIVEN scouting user logs in with permissions to edit International Video Log\r\n\r\n",
    "custom_steps": "WHEN user navigates to the video log widget\r\n\r\n",
    "custom_expected": "THEN there will be a Clear Log button on the video log as depicted in the wire\r\nAND This button is only available when there are no rows in edit mode. \r\nAND Clicking the Clear Log button will prompt the user to confirm that they wish to clear the log (this is a permanent action and cannot be undone)\r\nAND If they confirm the decision, all the information in the video log will be cleared and will not be retained by the system.  The video log will be saved and the system will display a blue success notification (\"The Video Log has been cleared\")\r\nAND If they do not confirm the decision, the user will be returned to the form and no action will be taken.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1230426,
    "title": "As a scouting user, I want to View the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169574",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC user is logged with permission to view the International Video Log\r\nAND user navigate to the Scouting dashboard\r\n",
    "custom_steps": "WHEN user clicks \"Video Log tab\"",
    "custom_expected": "THEN On this tab there will be an International Video Log widget\r\nAND The widget will match the provided wire and data discovery\r\nAND The video log is unique to each user.\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n\r\n*Note that the domestic version of this widget has already been built by LL*",
    "custom_steps_separated": null
  },
  {
    "id": 1230427,
    "title": "As a scouting user, I want to Save the International Video Log",
    "section_id": 149106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "158169577",
    "created_by": 103,
    "created_on": 1536678131,
    "updated_by": 103,
    "updated_on": 1536678131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 7,
    "custom_preconds": "GIVEN a scouting user is logged in with permission to edit International Video Log\r\n",
    "custom_steps": "WHEN user is adding a player to the International video log on the widget",
    "custom_expected": "THEN There will also be a \"Cancel all changes\" button anytime at least one row is in edit mode.\r\nAND Clicking \"Cancel all changes\" will cancel any changes made to the widget, including any row additions, and reload the widget in view mode.\r\nAND Clicking  \"Save\" will store the current values and the widget will reload with all rows in view mode\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND The next time the widget is loaded, the saved values will be displayed\r\n\r\nWire:\r\nhttps://s8xnnx.axshare.com/#p=video_log\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Video+Log+-+Data+Discovery\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1230436,
    "title": "As a user I want to delete International Scouting Reports",
    "section_id": 149107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159608483",
    "created_by": 103,
    "created_on": 1536678273,
    "updated_by": 103,
    "updated_on": 1536678273,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n\n* Users that have permission to edit International Workout reports will see a Delete button on preliminary or rejected International Workout reports in view and edit mode \n* Clicking \"Delete\" will prompt the user to confirm that they wish to delete the report.\n* Confirming the delete will assign the  a deleted status and throw a blue notification \"Successfully deleted\"\n* The item will no longer appears on any Clipboard, or in any search unless the user has specifically searched for Deleted profiles.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230437,
    "title": "As a user I want to delete Daily Reports",
    "section_id": 149107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159608465",
    "created_by": 103,
    "created_on": 1536678273,
    "updated_by": 103,
    "updated_on": 1536678273,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n\n* Users that have permission to edit daily reports will see a Delete button on preliminary or rejected daily reports in view and edit mode \n* Clicking \"Delete\" will prompt the user to confirm that they wish to delete the report.\n* Confirming the delete will assign the  a deleted status and throw a blue notification \"Successfully deleted\"\n* The item will no longer appears on any Clipboard, or in any search unless the user has specifically searched for Deleted profiles.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230438,
    "title": "As a user, I want to open International Scouting reports from the Player History widget of a Professional Player",
    "section_id": 149107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159628382",
    "created_by": 103,
    "created_on": 1536678273,
    "updated_by": 103,
    "updated_on": 1536678273,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n\n* Users that have permission to view International Workout reports and daily reports should see these items appear in the Player History widget if the player has one\n* Item in Player History Widget Info: Date: Report Date, Code: Scouting, Description : [The Report Type] \n* The description should be a hyperlink \n* Clicking on the hyperlink will open the report as expected",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230439,
    "title": "As a BOC user I only want to see current year for the All Registered Player Report only if I have permission to do so",
    "section_id": 149107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159607235",
    "created_by": 103,
    "created_on": 1536678273,
    "updated_by": 103,
    "updated_on": 1536678273,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n\n* A new LDAP needs to be created EBIS-RPT-ALLREGISTEREDPLAYERSADMIN\n* When running the All Registered Player Report, BOC users with this LDAP will be able to see if current year as an option regardless of what the Open All Registered System Date is set to\n* BOC users without the EBIS-RPT-ALLREGISTEREDPLAYERSADMIN LDAP will not see the current year option in the All Registered Report dropdown until the Open All Registered System Date has passed",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230440,
    "title": "As a user I want the existing scout profiles converted to the new scout profile",
    "section_id": 149107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "160029091",
    "created_by": 103,
    "created_on": 1536678273,
    "updated_by": 103,
    "updated_on": 1536678273,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria:\n* The existing scout profiles are converted so that they are visible in the Scout Directory widget just like newly created profiles.\n* The data from the profiles is maintained and correctly displayed (except for those fields that we removed from the profile).",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230474,
    "title": "As a User I want entering a voluntary retired transaction on an optioned player to set both MJ and MN roster status to voluntary retired",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159043999",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "When approving a voluntary retired transaction for an optioned player, the player's MJ roster status should be set to voluntary retired in addition to their MN status.  \n\nThe player should then show as just voluntary retired and NOT optioned/voluntary retired.\n\nstory created as a result of: https://jira.boc.mlb.com:8443/browse/EBISII-15463",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230475,
    "title": "As a Club User, I want to Reinstate a Player From the Inactive List (Temporary Inactive List for All-Star Games - No Minimum amount of days) Less Than 3 Days after Placement",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159107686",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "Rules:\nhttps://wiki.mlbam.com/display/EBIS/19.+Reinstate+from+Inactive+List\n\nMessages:\nhttps://wiki.mlbam.com/display/EBIS/IL+-+Messages\n\nRule 19.18.1:\n A Minor League player on the Temporary Inactive List with a Reason for Placement of \"Inactive List (Temporary Inactive List for All-Star Games - No Minimum amount of days)\" may be reinstated with no minimum day requirement.\n\nAC:\n - If a minor league player on the temporary inactive list and his reason for placement is \"Inactive List (Temporary Inactive List for All-Star Games - No Minimum amount of days)\", he may be reinstated, with no minimum day requirements\n - Message #38 will not fire when these players are reinstated less than 3 days after placement on the IL",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230476,
    "title": "As a User, if a DFA'd player has both TRD and OUT Waivers In Effect, I want that to be indicated on the Current DFA Players widget",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159604164",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "Wire:\nhttps://b6mbog.axshare.com/#p=dfa_players\n\nData Discovery:\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Current+DFA+Players+widget\n\nAC:\n - If a player is Designated for Assignment and has both TRD and OUT Waivers currently in effect, the \"Waivers in Effect\" column of the Current DFA Players widget will display both TRD and OUT",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230477,
    "title": "Updated Permissions for Player Tracking Tab",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159604186",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "On the Transactions dashboard, there is a Player Tracking tab.\n\n - If a user has access to the widgets on that tab, the tab should be available to them.\n - If a user doesn't have access to any widgets on that tab, they should not see the tab.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230478,
    "title": "As a User, I want to View clubs who have received more than $800k in the past 6 months",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "159732803",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "Wire:\nhttps://t4lvuq.axshare.com/#p=trade_contract_info\n\nData Discovery:\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Trade+Contract+Info+widget\n\nCash Considerations Report Details:\nhttps://wiki.mlbam.com/display/EBIS/EBIS4-TXT-5844+Report+Details\n\nAC:\n - In the header of the widget, there will be a list of \"Clubs who received +800k in the last 6 months\", as depicted in the wire\n - This list will use same logic as the first page of the Cash Considerations Report\n - This list of clubs will match the list of clubs displayed on the Cash Summary tab of the Cash Considerations report",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1230479,
    "title": "As a User, I want to run the DL Summary Report based on Service Day / Year",
    "section_id": 149111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "160261380",
    "created_by": 103,
    "created_on": 1536698208,
    "updated_by": 103,
    "updated_on": 1536698208,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20569,
    "display_order": 6,
    "custom_preconds": null,
    "custom_steps": "Business Value:\nThis would allow users to obtain the number of DL days used, and the number of DL placements made, as of any specific day of the championship season.\n\nReqs:\nhttps://wiki.mlbam.com/display/EBIS/DL+Summary+-+Report+Prompts\n\nAC:\n - When running the Disabled List Summary Report, the prompt screen will display Date Type dropdown prompt\n - There will be a \"Service Day\" Option in the Date Type dropdown\n - Selecting Service Day will hide the From and To date fields\n - Selecting Service Day will display two new fields:\n  - Service Day (Defaults to 1)\n  - Service Year (Defaults to current year)\n - The specified Service Day will effectively become the end date of a date range, with January 1st being the start date\n - Running the report for Service Day will return the list of players who were placed on the Disabled List through the service day specified of the service year specified.\n\nFor example:  If the user enters Service Day: 135 and Service Year: 2017,  the report will return all DL Placements from the beginning of the year through Day 135 of 2017.",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]