[
  {
    "id": 572390,
    "title": "Taxi Squad Permissions",
    "section_id": 69091,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "130339763",
    "created_by": 75,
    "created_on": 1475608340,
    "updated_by": 75,
    "updated_on": 1475857173,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 1,
    "custom_preconds": "GIVEN the user is a MJ Transaction Admin",
    "custom_steps": "WHEN they want to view the taxi squad",
    "custom_expected": "THEN they would have the permissions to",
    "custom_steps_separated": null
  },
  {
    "id": 572391,
    "title": "Print NOD for a Designate for Release or Assignment",
    "section_id": 69092,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115900981",
    "created_by": 75,
    "created_on": 1475608480,
    "updated_by": 75,
    "updated_on": 1475856852,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 1,
    "custom_preconds": "GIVEN Users have permission to Print from the form will see a \"Print\" button on the transaction\r\n",
    "custom_steps": "WHEN the user clicks print on the tx in view or edit mode\r\n\r\n",
    "custom_expected": "THEN a menu will open where the user can choose to print a Notice of Disposition. \r\nAND Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in English if the language on the player's profile is set to anything other than Spanish. \r\nAND Selecting \"Notice of Disposition\" will generate a pdf of the Notice of Disposition in Spanish if the language on the player's profile is set to Spanish. \r\nAND The English pdf will follow the English Notice of Disposition format.\r\nAND The Spanish pdf will follow the Spanish Notice of Disposition format.",
    "custom_steps_separated": null
  },
  {
    "id": 572392,
    "title": "Player Terminates Contract Under Paragraph 7(a) updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115976905",
    "created_by": 75,
    "created_on": 1475608542,
    "updated_by": 75,
    "updated_on": 1475857661,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 1,
    "custom_preconds": "GIVEN the user created a Player Terminates Contract Under Paragraph 7(a)",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN When the transaction is approved:\r\n* Logo on player's profile reverts to MLB logo\r\n* Set the player’s uniform number to null - should display on profile as blank.\r\n* Set the player’s current major league club report date to null.\r\n* Set the player’s current club acquired from to null.\r\n* Set the player’s current major league acquisition org to null. \r\n* Set the player’s current major league acquisition date to null.\r\n* Set the player’s ten/five player date to null.\r\n* Set the player’s ten/five player flag to 0.\r\n\r\nAND When the transaction is reversed:\r\n* Set the logo on player's profile back to its previous value.\r\n* Set the player’s uniform number back to its previous value. \r\n* Set the player’s current major league club report date back to its previous value.\r\n* Set the player’s current club acquired from back to its previous value.\r\n* Set the player’s current major league acquisition org back to its previous value. \r\n* Set the player’s current major league acquisition date back to its previous value.\r\n* Set the player’s ten/five player date back to its previous value.\r\n* Set the player’s ten/five player flag back to its previous value.",
    "custom_steps_separated": null
  },
  {
    "id": 572393,
    "title": "Return of 26th Man updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115670131",
    "created_by": 75,
    "created_on": 1475608553,
    "updated_by": 75,
    "updated_on": 1475857742,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 2,
    "custom_preconds": "GIVEN the user created a Return of 26th Man tx",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n* Set the player’s Mn Lg. last club to that of the destination/target club.\r\n* Set the player’s Mn Lg. last year played to the year of the transaction.\r\n* Set Current Mj Lg club report date to null. \r\n\r\nAND *On Reverse:*\r\n* Set the player’s Mn Lg. last club to the vale prior to the transaction's approval.\r\n* Set the player’s Mn Lg. last year played to the value prior to the transaction's approval.\r\n* Set Current Mj Lg club report date to the value prior to the transaction's approval. ",
    "custom_steps_separated": null
  },
  {
    "id": 572394,
    "title": "Appointment of 26th Man updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "115670851",
    "created_by": 75,
    "created_on": 1475608563,
    "updated_by": 75,
    "updated_on": 1475857834,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 3,
    "custom_preconds": "GIVEN the user created an Appointment of 26th Man tx\r\n\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n* If during the season and player is to report, set the player’s Current ML club report date.\r\n* If First ML club report date is null, then set First ML club report date\r\n\r\nAND *On Reverse:*\r\n* If Current ML club report date was set, set it to the value prior to the approval of the transaction. \r\n* If First ML club report date was set, set it to the value prior to the approval of the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 572395,
    "title": "Recall tx updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "114049279",
    "created_by": 75,
    "created_on": 1475608570,
    "updated_by": 75,
    "updated_on": 1475857876,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 4,
    "custom_preconds": "GIVEN the user created a Recall tx\r\n\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n* If during the season and player is to report,\r\n* Set the player’s Current ML club report date\r\n* If the first ML Club report date is null then set “first major league club report date” (Player profile) to Report Date.\r\n\r\nAND *On Reverse:*\r\n* Set the player’s Current ML club report date to the prior value based on transaction history\r\n* If the first ML Club report date was set then set the field back to the prior values based on transaction history",
    "custom_steps_separated": null
  },
  {
    "id": 572396,
    "title": "MJ/MN Outright updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "113212293",
    "created_by": 75,
    "created_on": 1475608579,
    "updated_by": 75,
    "updated_on": 1475857929,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 5,
    "custom_preconds": "GIVEN the user created a MJ/MN Outright tx\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n* Set Mn League last club to destination/target club\r\n* Set Mn League last year played to the year of the transaction date\r\n* Set Current MJ League report date to null\r\n* Set Current club acquired from to null\r\n* Set the player’s current MJ league acquisition org to null. \r\n* Set the player’s current MJ Lg acquisition date to null.\r\n* If prior outright flag is 0,\r\no    Set prior outright flag to 1\r\no    Set prior outright date to current date\r\n\r\nAND *On Reverse:*\r\n* Set the player’s info to the prior values based on transaction history:\r\n* Set the player’s current major league roster status to the prior values based on transaction history\r\n* Set the player’s current minor league roster status to the prior values based on transaction history\r\n* Set the player’s club to the prior values based on transaction history\r\n* Set Mn League last club to the prior values based on transaction history\r\n* Set Mn League last year played to the prior values based on transaction history\r\n* Set Current MJ league acquisition org to the prior values based on transaction history\r\n* Set Current MJ League acquisition date to the prior values based on transaction history\r\n* Set Current MJ League report date to the prior values based on transaction history\r\n* Set Current club acquired from to the prior values based on transaction history\r\n* Set prior outright flag to the prior values based on transaction history\r\n* Set prior outright date to the prior values based on transaction history",
    "custom_steps_separated": null
  },
  {
    "id": 572397,
    "title": "Selection to ML Roster updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "112812077",
    "created_by": 75,
    "created_on": 1475608588,
    "updated_by": 75,
    "updated_on": 1475858016,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 6,
    "custom_preconds": "GIVEN the user created a Selection to ML roster tx\r\n\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN * Set the player’s club to the target/destination club\r\n* Set the player’s level of play to the level of the target/destination club\r\n* If player’s rookie flag is not set and the rookie milestone date is not set, then set the player’s rookie flag.\r\n* If it’s during the season and the current MJ Lg club report date is null, then set the player’s current MJ Lg club report date.\r\n* If it’s during the season and the first MJ Lg org is null, then set the player’s first MJ Lg Org.\r\n* If it's during the season and the first MJ Lg report date is null, then set the player's first MJ Lg report date.\r\n* If it's during the season, set the player’s highest level of play (only if we change definition of highest level of play; if we don't, then always set the player's highest level of play) \r\n* Set the player’s current major league acquisition org to their current Org. \r\n* Set the player’s current MJ Lg acquisition date to the transaction date\r\n* If the player's first MJ Lg acquisition org is blank, then set the player’s first MJ Lg acquisition org to their current org. If not - no change is made to this field.\r\n* If the player's first MJ Lg acquisition from club is blank, then set the player's first MJ Lg acquisition from club to their previous club.\r\n* Set the current club acquired from to the assignor club\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 572398,
    "title": "Reversing Selection to ML Roster reverts player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "112812085",
    "created_by": 75,
    "created_on": 1475608603,
    "updated_by": 75,
    "updated_on": 1475858069,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 7,
    "custom_preconds": "GIVEN the user has an Approved Selection to ML roster tx",
    "custom_steps": "WHEN reversed",
    "custom_expected": "THEN * Set the player’s info to the prior values based on transaction history:\r\n* Set the player’s current major league roster status to value in history prior to transaction approval\r\n*Set the player’s current minor league roster status to value in history prior to transaction approval\r\n* Set the player’s club to the target/destination club to value in history prior to transaction approval\r\n* Set the player’s level of play to value in history prior to transaction approval\r\n* If the approved transaction date was after the cutoff to avoid draft exclusion date or the transaction date was before the MJ/Mn reserve list date then remove the player’s ‘D’ value R5 DESEL\r\n* Set the player’s R5 DESEL year to value in history prior to transaction approval\r\n* Set the player’s current MJ Lg acquisition org to value in history prior to transaction approval\r\n* Set the player’s current MJ Lg acquisition date to value in history prior to transaction approval\r\n* Set the current club acquired from to value in history prior to transaction approval\r\n* If transaction set the player’s first MJ Lg acquisition org then set to value in history prior to transaction approval\r\n* If transaction set the player’s first MJ Lg acquisition from club then set to value in history prior to transaction approval\r\n* If it’s during the season and the current MJ Lg club report date was set by transaction then set to the value in history prior to transaction approval\r\n* If the First MJ Lg report date org was set by transaction then set to value in history prior to transaction approval\r\n* If the First MJ Lg report date was set by transaction then set to the value in history prior to transaction approval\r\n* If player’s rookie flag and the rookie milestone date was set by transaction, then set both values to value in history prior to transaction approval\r\n* If transactions set the player’s highest level of play, then set to value in history prior to transaction approval\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 572399,
    "title": "Declare MN League Free Agent updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "110644008",
    "created_by": 75,
    "created_on": 1475608619,
    "updated_by": 75,
    "updated_on": 1475858188,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 8,
    "custom_preconds": "GIVEN the user created a Declare MN League Free Agent tx\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n \r\n* Set the player’s current major league club report date to null\r\n* Set the player’s current club acquired from to null\r\n* Clear the player’s 10/5 info\r\n* Logo on player's profile reverts to MLB logo\r\n* The player’s current major league acquisition date is set to null\r\n\r\nAND *On Reverse:*\r\n* Set the player’s current major league club report date back to its previous value.\r\n* Set the player’s current club acquired from back to its previous value.\r\n* Set the player’s  player’s 10/5 info back to its previous value.\r\n* Set the player’s  Logo on player's profile back to its previous value.\r\n* Set the player’s current major league acquisition date back to its previous value.",
    "custom_steps_separated": null
  },
  {
    "id": 572400,
    "title": "Release of MN league player updates player info",
    "section_id": 69093,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "111006604",
    "created_by": 75,
    "created_on": 1475608633,
    "updated_by": 75,
    "updated_on": 1475858406,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 11473,
    "display_order": 9,
    "custom_preconds": "GIVEN the user created a Release of MN league player tx\r\n",
    "custom_steps": "WHEN approved",
    "custom_expected": "THEN *On Approve:*\r\n* Set the player’s org and the club to 'null'\r\n* Logo on player's profile reverts to MLB logo\r\n* Set the player’s uniform number to null\r\n* Set the player’s current major league club report date to null\r\n* Set the player’s current club acquired from to null\r\n* Set the player’s ever been released flag 1 (true)\r\n* Clear the player’s 10/5 info\r\n* Set the player’s current major league acquisition org to null. \r\n* Set the player’s current major league acquisition date to null\r\n\r\nAND *On Reverse:*\r\n* Set the player’s org and the club back to its previous value.\r\n* Logo on player's profile reverts back to its previous value\r\n* Set the player’s uniform number back to its previous value\r\n* Set the player’s current major league club report date back to its previous value\r\n* Set the player’s current club acquired from back to its previous value\r\n* Set the player’s ever been released flag back to its previous value\r\n* Set the player’s 10/5 info back to its previous value(s)\r\n* Set the player’s current major league acquisition org back to its previous value. \r\n* Set the player’s current major league acquisition date back to its previous value.",
    "custom_steps_separated": null
  }
]