[
  {
    "id": 1005446,
    "title": "Investigation History - Permissions",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390755",
    "created_by": 136,
    "created_on": 1493907028,
    "updated_by": 136,
    "updated_on": 1493907028,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": "GIVEN a CLUB or a BOC user has limited Investigation Permission\r\n(test_boc_approver@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com, Test-NYY-admin@mlb.com, Test-NYY-viewer@mlb.com, and test-basic-stl@mlb.com)\r\n",
    "custom_steps": "WHEN the user is in a players profile under 'Contracts' tab\r\n\r\n\r\n",
    "custom_expected": "THEN user should only be able to view what they have permission to. ",
    "custom_steps_separated": null
  },
  {
    "id": 1005447,
    "title": "Investigations Search - Permissions",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139251803",
    "created_by": 136,
    "created_on": 1493907028,
    "updated_by": 136,
    "updated_on": 1493907028,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "GIVEN a CLUB or BOC user with/without Investigation permission logs in",
    "custom_steps": "WHEN user is in advance search\r\n",
    "custom_expected": "THEN only users that have Investigations permissions should see \"Investigations\" as an option in advanced search. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005484,
    "title": "Investigation Form - Permissions",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138391269",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493911079,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "GIVEN Investigation permission varies for different user (Test-ARI-viewer@mlb.com, test_boc_viewer@mlb.com, test_boc_admin@mlb.com and test_boc_approver@mlb.com)",
    "custom_steps": "WHEN the users logs in \r\n",
    "custom_expected": "THEN the following should be true \r\n-The form has a view only permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but cannot edit anything.  Users without the permission cannot view the form anywhere in the system.\r\n-The form has a \"registration\" permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but can only edit/create Investigations with a type = Registration. Users without this permission or the admin permission cannot edit or create Investigations anywhere in the system. \r\n-The form has an admin permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, and can edit/create any Investigation type. Users without this permission cannot edit or create non-Registration Investigations anywhere in the system. ",
    "custom_steps_separated": null
  },
  {
    "id": 1005448,
    "title": "As a Club user I want to be prevented from creating a request for a player I do not have permission to request an inviestigation for",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515725",
    "created_by": 136,
    "created_on": 1493907028,
    "updated_by": 136,
    "updated_on": 1493907028,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": "GIVEN A club user is viewing different org's player profile ",
    "custom_steps": "WHEN Club Selects \"Investigation Request\" for that player\r\n\r\n",
    "custom_expected": "THEN system will know player is currently under contract with a different Org, then an error will display. \r\n**Error Message:**\r\nThis player is currently under contract with another Organization. You may not request an investigation for this player. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005465,
    "title": "As a Club user I want to be prevented from creating a request for a player my org has a current pending request for",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515901",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493910866,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 6,
    "custom_preconds": "GIVEN the Club's ORG already has a current pending Investigation request for a player in a Preliminary, Submitted or Update Needed state",
    "custom_steps": "WHEN Club attempts to create a new request for the player \r\nAND selects \"Investigation Request\"\r\n\r\n",
    "custom_expected": "THEN an error will display. \r\nError Message: \r\nYour Organization already has a Preliminary or Submitted request for this player. You may not submit another request until the existing request has been reviewed. Please contact the BOC for more information.\r\nAND The only available button should be \"Back\". Clicking this will return the user to the point of entry.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005456,
    "title": "As a Club user I want to be prevented from creating a request for a registration player not on my Org's Club Registration List",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515977",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911309,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": "GIVEN a club user attempting to create a request for a registration player \r\nAND the player is not yet eligible to sign\r\nAND the player is on the creating Org's Club Registration List",
    "custom_steps": "WHEN Selecting \"Investigation Request\" for a player\r\n",
    "custom_expected": "THEN system will check if the player has not yet reached their Eligible to Sign date. \r\nAND If the player is not yet eligible to sign, then the system will check if the player is on the creating Org's Club Registration List. \r\nAND If the player is not on the Club's Registration List, then display an error.  \r\n**Error Message:** \r\nYou must add this player to your Organization's Club Interest List prior to requesting an investigation.\r\nAND the only available button should be \"Back\". Clicking this will return the user to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005461,
    "title": "As a user I want to only see Investigations that I have permission to see within the player's Investigation History (Historical Only)",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390719",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911330,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 8,
    "custom_preconds": "GIVEN Club and BOC wants to only see Investigations that they have permission to",
    "custom_steps": "WHEN user tries to see an investigation on the investigation history\r\n\r\n",
    "custom_expected": "THEN Club users will only able to see an investigation on the investigation history if the following are ALL true:\r\n     * They are the requesting Club for the investigation. (The Org on the Investigation Form is their Organization)\r\n     * The player is currently under contract with the org OR the player is a Free Agent\r\n     * The investigation was entered on or after January 1, 2011. \r\nAND BOC Investigations users are able to see all investigations in the player's Investigation History, regardless of when they were entered or who requested them.",
    "custom_steps_separated": null
  },
  {
    "id": 1005462,
    "title": "As a Club user I want to be able to see that a player has an investigation on file even if I do not have permission to see the Investigation",
    "section_id": 119408,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390647",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911353,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 9,
    "custom_preconds": "GIVEN Club user has permission to view a player's Investigation History\r\nAND the player has at least one Investigation (not request) in ebis\r\nAND Club user doesn't have permission to view ANY of the Investigations in the player's history",
    "custom_steps": "WHEN user is in player's Investigation History\r\n\r\n",
    "custom_expected": "THEN display the text \"Investigation on file - please contact the BOC for more information\" in the Investigation History widget.",
    "custom_steps_separated": null
  },
  {
    "id": 1005449,
    "title": "As a Club user I want to create a new Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512519",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": "GIVEN a Club user wants to create a new investigation request for International Amateur players or Professional players",
    "custom_steps": "WHEN user selects \"Investigation Request\" option in the Create New top-level menu for Club users on International Amateur players or Professional players\r\n\r\n",
    "custom_expected": "THEN system will launch a new Investigation Request for the player. \r\nAND the form will follow the wireframe and data discovery.\r\nAND Investigation Type is defaulted based on whether or not the Club submitting the request has a submitted contract for the player. If there is a Terms Submitted or higher contract for the player from the submitting Club, then the default is \"Contract\". Otherwise it is \"Pre-Contract\".",
    "custom_steps_separated": null
  },
  {
    "id": 1005450,
    "title": "As a Club user I want to be able to submit an Investigation Request to the BOC",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512957",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911184,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "GIVEN a Club user logs in",
    "custom_steps": "WHEN the user opens a preliminary Investigation form in edit or view mode\r\n\r\n",
    "custom_expected": "THEN 'Submit to BOC' button will available. The button will be blue. \r\nAND Submit button is available for BOC users when the preliminary form is in edit mode or view mode. The button is grey.\r\nAND Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the request to \"Submitted\"  \r\nAND System reloads the request in view mode, and displays a successful submit blue notification. \r\nAND Once the request has been successfully submitted, system creates an entry in green font in Player's Investigation History.",
    "custom_steps_separated": null
  },
  {
    "id": 1005428,
    "title": "As a user I want to be able to view a player's Investigation History",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390543",
    "created_by": 136,
    "created_on": 1493906797,
    "updated_by": 136,
    "updated_on": 1493911156,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "GIVEN the user is in Player's profile\r\n",
    "custom_steps": "WHEN user selects \"Contracts\" tab of a player profile",
    "custom_expected": "THEN Investigation History widget will appear beneath the Contract History, and follows the provided wireframe and data discovery.",
    "custom_steps_separated": null
  },
  {
    "id": 1005431,
    "title": "As a Club user I want to be able to save an Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139511133",
    "created_by": 136,
    "created_on": 1493906797,
    "updated_by": 136,
    "updated_on": 1493911162,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": "GIVEN a Club user logs into the system ",
    "custom_steps": "WHEN Club creates or opens an Investigation Request form in Edit mode\r\n\r\n",
    "custom_expected": "THEN\r\n\r\nSAVE\r\n* A Save button will be available anytime the form is in edit mode. \r\n* Clicking Save will save the form and its current values and reload the form in view mode. \r\n* The request's status will be set to \"Preliminary\" if this is the first time the request is being saved. Otherwise the status will not change.  \r\n* After a successful save the system will display a successful save blue notification. \r\n\r\nCANCEL\r\n* Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \r\n* Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\n* If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\n* If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\n* If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1005451,
    "title": "As a Club user I want to be warned if a player already has an investigation on file",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139514993",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 6,
    "custom_preconds": "GIVEN a player already has an investigation on file in any state",
    "custom_steps": "WHEN Club user selects \"Investigation Request\" for that player\r\n\r\n",
    "custom_expected": "THEN a warning will display. \r\n**Message:**\r\nThis player already has an investigation on file and may not require an additional investigation. Please contact the BOC for more information.\r\nAND Clicking Back will return the user to the point of entry. Clicking Ignore and Continue will proceed with the creation of the investigation request.",
    "custom_steps_separated": null
  },
  {
    "id": 1005452,
    "title": "As a Club user I want to add a missing file to an Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139514875",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": "GIVEN Club user opens an Investigation Request in Edit mode\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user clicks on 'Add File' button under the 'Missing Files' section of the form",
    "custom_expected": "THEN system will display a set of missing file fields. \r\nAND the user may select each \"File\" type only once per request. \r\nAND there will always be a trash can in edit mode to remove any of the fieldsets, since these are not necessarily required fields. \r\nAND clicking the trash can will remove the associated fieldset.",
    "custom_steps_separated": null
  },
  {
    "id": 1005453,
    "title": "As a user I want to be edit an existing Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512677",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 8,
    "custom_preconds": "GIVEN the user has permission to EDIT Investigation form",
    "custom_steps": "WHEN user opens an existing Investigation Request form in view mode\r\n\r\n",
    "custom_expected": "THEN an edit button will be available.  \r\nAND clicking  Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode). \r\nAND in Preliminary and Update Needed states, the Club and BOC users will be able to edit all portions displayed on the form. \r\nAND edit should not display for Club users in any state other than Preliminary or Update Needed.\r\nAND BOC is able to edit all fields in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1005432,
    "title": "As a user I want to be able to delete an Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512675",
    "created_by": 136,
    "created_on": 1493906797,
    "updated_by": 136,
    "updated_on": 1493911201,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 9,
    "custom_preconds": "GIVEN the user has edit permissions for the form in Preliminary states",
    "custom_steps": "WHEN user clicks on 'Delete' button(Grey) on the Investigation Request form in view or edit mode\r\n\r\n",
    "custom_expected": "THEN system will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? \r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown confirming the deletion.\r\nOr If they do not confirm the deletion, then they should be returned to the form and no action should be taken. \r\nAND Deleted requests should not appear on the front end or be searchable.",
    "custom_steps_separated": null
  },
  {
    "id": 1005454,
    "title": "As a BOC user I want to be able to send an Investigation Request back to the Club for updates",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "EBISARC-3664",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 308,
    "updated_on": 1642106829,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 10,
    "custom_preconds": "GIVEN a Investigation Request is in Submitted States\r\n",
    "custom_steps": "WHEN BOC opens the Investigation Request in view or edit mode",
    "custom_expected": "THEN BOC Approver should see an \"Update Needed\" button in grey.\r\nAND clicking \"Update Needed\" will not run any rule checks. \r\nAND any changes to the form are saved, and the request's status is updated to \"Update Needed\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the request was saved.\r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Update Player's Investigation History entry to reflect the new status, but it should remain green. \r\nAND An Action Item should be generated for the submitting Club's Investigations Admin. (#4)",
    "custom_steps_separated": null
  },
  {
    "id": 1005436,
    "title": "As a BOC user I want to receive an approvals item for a submitted Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139595277",
    "created_by": 136,
    "created_on": 1493906797,
    "updated_by": 136,
    "updated_on": 1493911215,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 11,
    "custom_preconds": "GIVEN an Investigation Request has been Submitted by Club",
    "custom_steps": "WHEN BOC checks the BOC - Investigations - Admin's Approvals widget\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN an approval item will be generated and displayed in the widget\r\nAND The files attached are displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated, they display in the Comments column of the Approvals widget.\r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink.\r\nAND Clicking on the type hyperlink will open the submitted request in view mode in the same window/tab. \r\nAND This Approvals item should display under the \"Micellaneous\" filter in the approvals widget.",
    "custom_steps_separated": null
  },
  {
    "id": 1005455,
    "title": "As a Club user I want to be able to re-submit an Update Needed Investigation Request to the BOC",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513967",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 12,
    "custom_preconds": "GIVEN BOC sent an Investigation Request back to the Club for updates",
    "custom_steps": "WHEN user Opens the Update Needed Investigation Request in edit/view mode to re-submit back to the BOC\r\n\r\n",
    "custom_expected": "THEN a Submit to BOC button(Blue) will be available to Club users.\r\nOR Submit button(Grey) will be available for BOC users.\r\nAND clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND After the rules have passed, the system updates the status of the request to \"Submitted\"  \r\nAND System reloads the request in view mode, and displays a successful submit blue notification. \r\nAND Once the request has been successfully submitted, system creates an entry in green font in Player's Investigation History.\r\nAND When a request reaches a status of \"Submitted\" an approval item will be generated and display on the BOC - Investigations - Admin's Approvals widget. \r\nAND The files attached are displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated, they display in the Comments column of the Approvals widget.\r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink.\r\nAND Clicking on the type hyperlink will open the submitted request in view mode in the same window/tab. \r\nAND The Action Item associated with the request is removed for the club users.",
    "custom_steps_separated": null
  },
  {
    "id": 1005457,
    "title": "As a Club user I want to receive a notification when my Investigation Request has been approved or rejected",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513469",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 14,
    "custom_preconds": "GIVEN a club user has initiated an Investigation Request for a player ",
    "custom_steps": "WHEN the Investigation Request is approved or rejected",
    "custom_expected": "THEN initiating Club should receive a notification when the request is updated to Approved. (#2)\r\nAND initiating Club should receive a notification when the request is updated to Rejected. (#3)\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink of any of these notifications should open the submitted request in view mode in the same window/tab \r\nAND player's name should be a hyperlink\r\nAND clicking on the player's name hyperlink of any of these notifications should open the player's profile in view mode in the same window/tab on the Player History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1005458,
    "title": "As a Club user I want to be able to submit an Investigation Waiver Request to the BOC",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139514245",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 15,
    "custom_preconds": "GIVEN An Investigation Request is in preliminary or update needed state\r\nAND Investigation Type = Contract",
    "custom_steps": "WHEN Club user opens the form in edit or view mode \r\n\r\n",
    "custom_expected": "THEN Waiver Request button(Blue) will be available.\r\nAND Clicking Waiver Request will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND Once the request has been successfully submitted, system creates an entry in green font in Player's Investigation History.\r\nAND When a request reaches a status of \"Submitted\" an approval item will be generated and display on the BOC - Investigations - Admin's Approvals widget. \r\nAND The files attached are displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated, they display in the Comments column of the Approvals widget.\r\nAND Player name is a hyperlink in the Approvals widget.\r\nAND Clicking on the player name will open the Player Profile (defaults to Player History tab) in the same window/tab. \r\nAND \"Type\" will be a hyperlink.\r\nAND Clicking on the type hyperlink will open the submitted request in view mode in the same window/tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1005459,
    "title": "As a BOC user I want to be able to approve or reject an Investigation Waiver Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139515599",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 16,
    "custom_preconds": "GIVEN a Club user submitted an Investigation Waiver Request",
    "custom_steps": "WHEN BOC opens the Investigation Waiver Request in View or Edit mode\r\n\r\n",
    "custom_expected": "THEN\r\nAPPROVE:\r\n* BOC Approvers see an \"Approve\" button in blue when they are viewing a request (in view or edit mode) in Preliminary, Submitted to BOC and Update Needed states. \r\n* Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\n* Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\n* If the item was in edit mode, it is reloaded in view mode. \r\n* A successful blue notification is displayed that states the request was approved.\r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\n* Update Player's Investigation History entry for this request to be in black font. \r\n\r\nREJECT:\r\n* BOC Approvers see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in the Submitted state. \r\n* Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\n* Once all On Save rules have passed or been overridden, the status is updated to \"Rejected\"\r\n* Successful reject notification is displayed. \r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\n* Remove pending investigation history entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005460,
    "title": "As a Club user I want to receive an error if attempting to request a waiver for a player that already has an investigation on file",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139516425",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 17,
    "custom_preconds": "GIVEN a club user is logged in and attempting to request a waiver for a player\r\nAND that player already has an investigation on file",
    "custom_steps": "WHEN user clicks \"Waiver Request\" ",
    "custom_expected": "THEN system should check if the player already has an investigation in the system in any state\r\nAND if yes, then a hard error should display \r\nAND the text of the message should be: \r\n\"This player already has a completed investigation on file. Please contact the BOC for more information.\"\r\nAND clicking Back should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1005466,
    "title": "As a user I want to see current status display in different colors on an Investigation Request depending on the status",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140972729",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911376,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 21,
    "custom_preconds": "GIVEN a player's Investigation Request has Preliminary, Approved, Rejected or other status",
    "custom_steps": "When user is in Investigation form\r\n",
    "custom_expected": "THEN the color of current status should meet the following criteria: \r\n- For preliminary color should be red(#d42307) \r\n- For approved or rejected use black\r\n- For anything else use green (#00a651) ",
    "custom_steps_separated": null
  },
  {
    "id": 1005469,
    "title": "As a user I want the text in the attached files section to show accurate information about what documents are required",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140952447",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 103,
    "updated_on": 1494606946,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 28,
    "custom_preconds": "GIVEN the user is trying to open an investigation request for a player ",
    "custom_steps": "WHEN the user is on the Investigation form under 'Attached File(s)'\r\n\r\n\r\n",
    "custom_expected": "THEN system should show the following text:\r\n**\"In order to request an investigation, you must upload a completed investigation form, the player's birth certificate, a color headshot, the applicable consent form, the mother's ID, and the father's ID.\"**\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005474,
    "title": "As a user I want to see who submitted an Investigation Request on the form",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140984607",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 33,
    "custom_preconds": "GIVEN User submitted an Investigation Request ",
    "custom_steps": "WHEN user is on the Investigation Request form\r\n\r\n\r\n",
    "custom_expected": "THEN Request Submitted field and a Submitted By field appear in the Status & Dates section of the Investigation Request. \r\nAND Request Submitted should be the date and time the request was submitted. (mm/dd/yyyy - hh:mm pm)\r\nAND Submitted By should be populated with the username of the user that submitted the request.",
    "custom_steps_separated": null
  },
  {
    "id": 1005475,
    "title": "As a user I want to see a Close button on an Investigation Request form",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141418623",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 34,
    "custom_preconds": "GIVEN a user logs in",
    "custom_steps": "WHEN the user is viewing an Investigation Request in view mode\r\n\r\n\r\n",
    "custom_expected": "THEN when viewing an Investigation Request in view mode, there should be a Close button.\r\nAND Clicking the Close button will work the same as if the user had clicked their browser back button.",
    "custom_steps_separated": null
  },
  {
    "id": 1005476,
    "title": "As a Club user I want to see Investigation Requests in my Pending Approvals widget",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140973431",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 35,
    "custom_preconds": "GIVEN a club user submitted waiver request\r\nAND has investigation editors role ",
    "custom_steps": "WHEN user is on Pending Approvals Widget\r\n\r\n",
    "custom_expected": "THEN Club users should see the submitted waiver request in their Pending Approvals widget.\r\nAND it should match the BOC version of the Approvals item, including rolling off when the request is approved, rejected or sent for update.",
    "custom_steps_separated": null
  },
  {
    "id": 1005477,
    "title": "As a user I want to see which files are required within the label dropdown",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140964417",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 36,
    "custom_preconds": "GIVEN a user opens an investigation request form\r\nAnd uploaded a file(s)",
    "custom_steps": "WHEN user clicks on the label  \r\n\r\n",
    "custom_expected": "THEN a red \"*\" will appear after the required document labels within the label dropdown.",
    "custom_steps_separated": null
  },
  {
    "id": 1005478,
    "title": "As a user I want the correct status saved and displayed in a player's Investigation History and search results when an investigation is saved",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390649",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 308,
    "updated_on": 1699990542,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 37,
    "custom_preconds": "GIVEN Investigation with different status are created\r\n\r\n",
    "custom_steps": "WHEN user checks the Investigation History or search results for investigation in adv search",
    "custom_expected": "THEN the Status displayed in the Investigation History for Investigations (not Requests) follows the following rules: \r\n       *Before the Investigation has been submitted for the first time the Investigation Status = Preliminary\r\n       *When the Age Result and Identity Result = Pending or blank then the Investigation Status = Pending\r\n       *When the Age Result and Identity Result = Waived then the Investigation Status = Waived \r\n       *When the Age Result OR Identity Result = Failed then the Investigation Status = Failed\r\n       *When the Age Result AND Identity Result = Confirmed then the Investigation Status = Confirmed\r\n       *When the Age Result OR Identity Result = Undetermined and the other result = Undetermined or Confirmed, then the Investigation Status = Undertermined",
    "custom_steps_separated": null
  },
  {
    "id": 1005479,
    "title": "As a user I want to see Investigation Waiver Requests differently than Investigation Requests",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140983965",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 38,
    "custom_preconds": "GIVEN user logs into the system",
    "custom_steps": "WHEN a Club submits an investigation waiver\r\n\r\n",
    "custom_expected": "THEN the blue successful submit notification should indicate that an Investigation Waiver Request was submitted - not just an investigation request. \r\nAND the Approvals item, and corresponding Pending Approvals item, should say \"Investigation Waiver Request\" as the Type instead of Investigation Request. \r\nAND When a BOC user opens a submitted investigation waiver request, it should match the wireframe, instead of looking the same as a submitted waiver request. \r\nAND The Investigation Waiver Request should appear in the player's investigation history as an Investigation Waiver Request.",
    "custom_steps_separated": null
  },
  {
    "id": 1005480,
    "title": "As a user I want to be able to view a player's Contracts and Investigation History tab on the player profile",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250569",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 39,
    "custom_preconds": "GIVEN \"Contracts Tab\" on player profile has been updated to indicate the presence of the Investigation History\r\nAND a user is logged in as club or boc ",
    "custom_steps": "WHEN user navigates player profile contracts tab\r\n",
    "custom_expected": "THEN if the player has an Investigation History to display, then the user should see the tab as \"Contracts & Inv\"\r\nAND if user is a BOC user and the player has at least one investigation request or investigation on file, then they should have an Investigation History displayed\r\nAND if user is a club user and the player has at least one investigation on file OR a request from this Club, then they should have an Investigation History displayed\r\nAND title attribute on the tab should be set to title=\"Contracts & Investigations\" so hovering over the tab displays a browser tooltip",
    "custom_steps_separated": null
  },
  {
    "id": 1005481,
    "title": "As a BOC user I want approving an investigation request to automatically create a new, preliminary Investigation for a player",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513527",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493908893,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 40,
    "custom_preconds": "GIVEN an investigation request has been submitted to BOC ",
    "custom_steps": " WHEN BOC user clicks \"Approve\" on the Investigation Request ",
    "custom_expected": "THEN the system should save any changes made to the request\r\nAND system should mark the request as approved and display a successful approval notification\r\n AND system should close the request and open an Investigation Form for the player with the Final results for Age and ID set to Pending\r\n AND investigation Type and Org should be populated from the Request\r\n AND oif the Investigation Type = Contract then the Investigation Visibility should default to All Orgs\r\n BIUT if the Investigation Type = Pre-Contract, then the Investigation Visibility should default to Requesting Org(s)\r\n AND the Investigation Form should automatically be saved as preliminary\r\nAND any Attached Files should be carried from the Request to the Form \r\nAND the player's Investigation History should be updated \r\nAND club should be notified of the approval\r\nAND notification should state \"Investigation Request Approved\"",
    "custom_steps_separated": null
  },
  {
    "id": 1005482,
    "title": "As a BOC user I want approving an investigation waiver request to automatically create a new, preliminary waived Investigation for a player",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139514573",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 103,
    "updated_on": 1494853956,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 41,
    "custom_preconds": "GIVEN an investigation waiver request has been submitted to BOC",
    "custom_steps": " WHEN BOC user clicks \"Approve\" from the  Investigation Waiver Request",
    "custom_expected": "THEN the system should save any changes made to the request\r\nAND system should mark the waiver request as approved and display a successful approval notification\r\n AND system should remove the Approvals item for the BOC user\r\n AND system should close the waiver request and open an Investigation Form for the player for which the waiver was requested with the Final results for Age and ID set to Waived\r\n AND investigation Type and Org should be populated from the Request\r\n AND the Investigation Visibility should default to All Orgs\r\n AND the Investigation Form should automatically be saved as preliminary\r\nAND any Attached Files should be carried from the Request to the Form\r\n AND the player's Investigation History should be updated\r\n AND club should be notified of the approval\r\nAND notification should state \"Investigation Waiver Request Approved\"",
    "custom_steps_separated": null
  },
  {
    "id": 1227582,
    "title": "Investigation Requests - Permissions",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140494281",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914080,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 42,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n* The form has a view only permission set that can be added to an existing user if needed. Users with this permission can view all aspects of the form, but cannot edit anything.  Users without the permission cannot view the form anywhere in the system.\n* The form has an edit permission (including creation and delete) set that can be added to an existing user if needed. Users with this permission can create new requests, and edit existing ones. Users without the permission cannot edit or create the transaction anywhere in the system. This permission will only be for Club users. \n* Users without the edit permission should NOT see the option to create Investigation Requests in the Create New menu.\n* The form has an approve permission set that can be added to an existing user if needed. Users with this permission can edit existing requests, approve, reject, and send for updates. Users without the permission cannot approve, reject or send for update the form anywhere in the system. \n\n*Please include the delivery of the new LDAPs as part of this delivery*\nhttps://wiki.mlbam.com/display/EBIS/EBIS+2+Roles+to+LDAP+Mapping",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1227583,
    "title": "As a BOC user I want to be able to approve or reject an Investigation Request",
    "section_id": 119409,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139512955",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914088,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 43,
    "custom_preconds": null,
    "custom_steps": "Wireframe: \nhttp://tb5api.axshare.com/#p=investigation_request\n\nData Discovery: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=1994020\n\nAcceptance Criteria: \nAPPROVE:\n* BOC Approvers see an \"Approve\" button in blue when they are viewing a request (in view or edit mode) in Preliminary, Submitted to BOC and Update Needed states. \n* Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \n* Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\n* If the item was in edit mode, it is reloaded in view mode. \n* A successful blue notification is displayed that states the request was approved.\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \n* Update Player's Investigation History entry for this request to be in black font. \n\nREJECT:\n* BOC Approvers see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in the Submitted state. \n* Clicking \"Reject\" will not run any rule or required field checks. \n* The status is updated to \"Rejected\"\n* Successful reject notification is displayed. \n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \n* Remove pending investigation history entry.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1005467,
    "title": "As a BOC user I want to be able to create a new Investigation",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390963",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493912674,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "WHEN the user clicks Create New menu for professional, domestic amateur and international amateur players\r\nAND selects Investigation\r\n\r\n",
    "custom_expected": "THEN a new Investigation form is opened for the player. \r\nAND the Investigation Form matches the wireframe and data discovery. (http://tb5api.axshare.com/#p=investigation_form)",
    "custom_steps_separated": null
  },
  {
    "id": 1005490,
    "title": "As a user I want to be able to select an existing trainer/agent for use in the Investigation Form",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142187677",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493912782,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in with permissions to edit Investigation form \r\nAND user is viewing an Investigation form in edit mode",
    "custom_steps": "WHEN user selects \"Trainer/Agent\" dropdown\r\n",
    "custom_expected": "THEN Trainer/Agent field on an Investigation Form should be linked to the database of trainer/agents maintained in ebis amateur\r\nAND the field should be an auto-complete and work similar to player quicksearch \r\nAND user should be required to enter at least 3 characters to see any possible results\r\nAND the results returned are roughly as follows: \r\n - Any names where the entered characters match the Last exactly. (Ex if you enter \"Rodr\", then any trainer/agents with last names that start with Rodr would be displayed first, in alpha order by Last, First). \r\n - Followed by any names where the entered characters match the First exactly. (Ex: if you enter \"Rodr\", then any trainer/agents with first names that start with Rodr would be displayed following the above bullet's list, in alpha order by Last, First)\r\n - Any names that contain \"rodr\" in last name - but they don't start with Rodr. \r\n - Any names that contain \"rodr\" in first name - but they don't start with Rodr.",
    "custom_steps_separated": null
  },
  {
    "id": 1005468,
    "title": "As a BOC user I want to be able to save a new Investigation",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390993",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493912658,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user logs in\r\n",
    "custom_steps": "When the user is viewing a new Investigation Form\r\n\r\n",
    "custom_expected": "THEN \"Save\" and \"Cancel\" will be available.\r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery,  will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005473,
    "title": "As a BOC user I want to be able to link an Investigation to a Contract",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253001",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493912688,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user logs in\r\n",
    "custom_steps": "WHEN user opens an investigation form in edit more\r\n\r\n",
    "custom_expected": "THEN users should see a \"Select\" button associated with the Contract ID field (see wire). \r\nOR If no contract exists for this player, the button should not display.\r\nAND Clicking this button will launch a pop-up for the user to select the associated contract to link to this investigation (see 2nd wire). \r\nAND The popup will contain a complete list of the Major and Minor League Contracts that exist for this player. \r\nAND The Status of the Contract, Signing Org, Type and the Date Created will display. \r\nAND The Status will be a hyperlink to navigate the user to the contract. \r\nAND The user will only be able to select one contract to link. \r\nAND The button \"Select\" should be disabled until 1 contract is selected\r\nAND Clicking \"Select\" will populate the Contract ID field with the ID of the selected contract. \r\nAND If a contract ID already existed in this field, it is overwritten. \r\nAND The \"Signing Bonus\" field should be prepopulated with the signing bonus from the linked contract if no value has been entered. \r\nAND The \"Org\" field on the Investigation should be prepopulated with the Signing Org from the contract. If a different Org has already been selected, this Org should be added.",
    "custom_steps_separated": null
  },
  {
    "id": 1005472,
    "title": "As a BOC user I want an Investigation to automatically be linked to an existing Minor Contract",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390995",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493912704,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC user logs in",
    "custom_steps": "WHEN an Investigation is first created by the user \r\n\r\n",
    "custom_expected": "THEN the system should locate any contracts in the system for the player with a status of \"Terms Submitted\" or \"Terms Accepted\". If one exists, then this contract should be pre-populated in the Contract ID field of the Investigation Form.\r\nOr If no \"Terms Submitted\" or \"Terms Accepted\" contracts exist for the player then the system should check for any Approved contracts - if one exists then the contract with the latest Approval stamp should be pre-populated in the Contract ID field of the Investigation Form. \r\nAND The \"Signing Bonus\" field should be prepopulated with the signing bonus from the linked contract if no value has been entered. \r\nAND The \"Org\" field on the Investigation should be prepopulated with the Signing Org from the contract. If a different Org has already been selected, this Org should be added.",
    "custom_steps_separated": null
  },
  {
    "id": 1005483,
    "title": "As a BOC user I want to be able to view an existing Investigation",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390841",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493912695,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 6,
    "custom_preconds": "GIVEN a BOC user is in a Players profile under 'Contracts' tab\r\nAND Investigations that were created in ebis1 are visible in ebis2",
    "custom_steps": "WHEN user opens one of the exiting investigations\r\n\r\n",
    "custom_expected": "THEN system will display the form according to the provided wireframe. \r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005464,
    "title": "As a user I want to be able to search for Investigations",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250111",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493912714,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": "GIVEN the user is in advance search tab",
    "custom_steps": "WHEN user select 'Investigation' under Advanced Search\r\n\r\n\r\n",
    "custom_expected": "THEN the available filters should match the requirements. \r\nAND the columns displayed should match the requirements. \r\nAND The \"Date\" column should be hyperlink to the Investigation form for BOC users only.\r\nAND the player's name should be a hyperlink to their profile.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005470,
    "title": "As a BOC user I want to be able to edit an existing Investigation (converted from 1)",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608635",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911836,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 9,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "When the user is viewing an existing Investigation Form\r\n\r\n",
    "custom_expected": "THEN an \"Edit\" button will be available. \r\nAND Clicking \"Edit\" will place the form into edit mode with the fields editable per the data discovery \r\nAND \"Save\" and \"Cancel\" buttons will be available. \r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery,  will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005471,
    "title": "As a BOC user I want to be able to edit an existing Investigation (new in 2)",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608657",
    "created_by": 136,
    "created_on": 1493908893,
    "updated_by": 136,
    "updated_on": 1493911832,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 10,
    "custom_preconds": "GIVEN a BOC user logs in",
    "custom_steps": "When the user is viewing an existing Investigation Form\r\n\r\n",
    "custom_expected": "THEN an \"Edit\" button will be available. \r\nAND Clicking \"Edit\" will place the form into edit mode with the fields editable per the data discovery \r\nAND \"Save\" and \"Cancel\" buttons will be available. \r\nAND Clicking \"Save\" will conduct a required field and format check according to the data discovery, will save the form and throw a blue successful save notification. \r\nAND Clicking \"Cancel\" will ask the user if they are sure they would like to cancel - if they confirm nothing is saved and the user is returned to the point of entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1005485,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created prior to EBIS2)",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493909374,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 17,
    "custom_preconds": "GIVEN a club user is logged in and attempting to Adv Search for an Investigation created prior to ebis2 implementation\r\nAND club user is from requesting Club for the investigation they're searching for (The Org on the Investigation Form is their Org)\r\nAND player on this investigation is currently under contract with user's org OR the player is a Free Agent\r\nAND the investigation was entered on or after January 1, 2011. \r\n",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN only Investigations that meet ALL of the above criteria should display\r\nAND Investigations that do not meet ALL of the criteria above should not display",
    "custom_steps_separated": null
  },
  {
    "id": 1005486,
    "title": "As a user I want to only see Investigations that I have permission to see within the player's Investigation History (updated for ebis2 investigations)",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250327",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493909374,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 18,
    "custom_preconds": "GIVEN a user is logged in and attempting to view a player's Investigation History",
    "custom_steps": "WHEN user navigates to Investigation History Table on Player Profile ",
    "custom_expected": "THEN Investigation requests should only be visible to the submitting Org, and BOC Investigations\r\nAND Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History.",
    "custom_steps_separated": null
  },
  {
    "id": 1005487,
    "title": "As a BOC user I want to have the option to link an investigation request to an existing investigation on approval of a request",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139513471",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493909374,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 19,
    "custom_preconds": "GIVEN an Investigation Request has been submitted to the BOC",
    "custom_steps": " WHEN BOC user reviews the Investigation Request",
    "custom_expected": "THEN system should display only a standard \"Approve\" button if the player has no investigations in the system\r\nBUT if the player has at least one investigation in the system, the user should see a split button that allows the BOC to choose whether or not they want to start a new Investigation, or add this request to an existing Investigation form\r\nAND if the user clicks Approve - Create New, then the Investigation Request should be marked approved and the player should have a new investigation created as laid out in #139513527\r\nBUT if the user clicks Approve - Add to Existing, then the system should do the following: \r\n -System saves any changes that were made to the form. System marks the investigation request as approved and displays a successful approval notification. \r\n - If only one investigation exists for the player then the system automatically adds the club who submitted the request as a requesting Org for the existing investigation. \r\n - If more than one investigation exists in the system for the player - the system displays a pop-up prompting the user to select to which investigation to add the requesting Org.\r\n - If the visibility of the Investigation was set to include \"Requesting Org\" then the Org that submitted this request can now see the investigation in the Player's History. \r\n - The player's Investigation History is updated. Club is notified of the approval of their request. See Clipboard #2.",
    "custom_steps_separated": null
  },
  {
    "id": 1005488,
    "title": "As a user I only want to see Investigations in Search that I have permission to see (Created in EBIS2)",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139250087",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493909374,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 20,
    "custom_preconds": "GIVEN a user is logged in and attempting to Adv Search for an Investigation created in ebis2",
    "custom_steps": "WHEN user performs Adv Search",
    "custom_expected": "THEN Investigation visibility should be controlled by BOC Investigations users on the Investigation form itself\r\nAND if Requesting Org is checked then any Org that has an approved investigation request for the selected investigation should be able to see the Investigation on the player's History\r\nAND if Signing Org is checked, then the Org that the player is currently under contract with should be able to see the investigation on the player's History\r\nAND if All Orgs is checked, then all Orgs should be able to see the investigation on the player's History\r\nAND if BOC Only is checked, then only the BOC should be able to see the investigation on the player's History",
    "custom_steps_separated": null
  },
  {
    "id": 1005489,
    "title": "As a user I want to see useful information in my browser tab for Investigations, Investigation Requests and Investigation Waiver Requests",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "141257297",
    "created_by": 136,
    "created_on": 1493909374,
    "updated_by": 136,
    "updated_on": 1493909374,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 21,
    "custom_preconds": "GIVEN a user is logged in as club or BOC admin",
    "custom_steps": "WHEN user navigates to the Contracts & Inv tab of a player profile\r\nAND user opens an Investigation Request, Investigation Waiver Request, or Investigation\r\n",
    "custom_expected": "THEN browser tab text should be updated with the following:\r\n- Investigation Requests \"INV RQ - Last, Roster First\"\r\n- Investigation Waiver Requests \"INV WRQ - Last, Roster First\"\r\n- Investigation \"INV - Last, Roster First\"",
    "custom_steps_separated": null
  },
  {
    "id": 1227584,
    "title": "As a user I want to see the trainer/agent field populated on legacy investigations",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142802643",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914094,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 22,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n* For investigations coming from ebis1, the trainer/agent field in ebis2 should display the text of the selected \"buscon\" from ebis1. This field will be a text field on legacy investigations.\n* For new investigations created in 2, this trainer/agent field will be a Select2 field as detailed in this story #142187677.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1227585,
    "title": "As a user I want to see the First and Last Name fields on the Investigation Form itself in addition to the header",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142802861",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914102,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 23,
    "custom_preconds": null,
    "custom_steps": "Wireframe: \nhttp://tb5api.axshare.com/#p=legacy_form\nhttp://tb5api.axshare.com/#p=investigation_form\n\nData Discoveries: \nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Investigation+Form\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Legacy+Investigation+Form\n\nAcceptance Criteria: \n* For both the Legacy form and the new in ebis2 forms, we need to update the layout to account for the fact that First Name and Last Name need to be captured at the time of the creation of the Investigation. Updates to the player profile should NOT be reflected in the fields on the Investigation (including DOB and Middle/Extended Last Name). \n* Note that the subheader name has changed slightly to account for this change, and a few of the fields have been reordered. \n* Additionally, for both legacy and existing, we need to add the Home District and Home City fields to the Investigation form. These should pre-populate, along with Home Country, from the player's profile - but be editable by the user. \n* Ideally the \"Home District\" field would read \"Home Province\" or \"Home State\" depending on the country selected - just like on International Amateur addresses. The field should be either a dropdown or a text field depending on the Country selected, as should the City. (again reference the International addresses)\n* Primary and Secondary Investigator fields should be added ONLY to the Legacy Form under the \"Investigator Details\" section, and do not need to be editable. This information can be converted as text for those investigations that have this information populated in ebis1.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1227586,
    "title": "As a BOC user I want to be able to delete an investigation",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142694641",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914110,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 24,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n* When BOC Investigations Admin users (not registration users) are viewing an Investigation that has been previously saved in Edit or View mode, there is a \"Delete\" button.\n* Clicking \"Delete\" will prompt the user to confirm that they wish to delete the investigation. \n* Confirming they want to delete the investigation will delete the investigation from the system and display a blue successful delete notification.\n* Deleted notifications will no longer display in search for anyone and will not appear in Investigation Histories.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1227588,
    "title": "As a BOC user I want to see a warning if the player already has a Pending Investigation on file",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156229864",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914126,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 25,
    "custom_preconds": null,
    "custom_steps": "Messages: \nhttps://wiki.mlbam.com/display/EBIS/Messages+-+Investigations\n\nAcceptance Criteria:\n* Selecting \"Investigation\" from the Create New menu will check to see if the player has a Pending Investigation. (Either Age or ID is set to Pending). \n* If yes, display Messages #7.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1227589,
    "title": "As a BOC user I want to see a warning if the player already has a completed Investigation on file",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156231706",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914131,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 26,
    "custom_preconds": null,
    "custom_steps": "Messages: \nhttps://wiki.mlbam.com/display/EBIS/Messages+-+Investigations\n\nAcceptance Criteria: \n* Selecting \"Investigation\" from the Create New menu will check to see if the player has a Completed Investigation. (Both Age and ID are set to anything other than Pending). \n* If yes, display Messages #8.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1237087,
    "title": "As a user I want the correct status saved and displayed in a player's Investigation History and search results when an investigation is saved",
    "section_id": 119410,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "138390649",
    "created_by": 156,
    "created_on": 1550674928,
    "updated_by": 156,
    "updated_on": 1550674978,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 27,
    "custom_preconds": null,
    "custom_steps": "Wireframe:\nhttp://ll2j6l.axshare.com/#p=contracts\n\nData Discovery: \nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+Investigation+Form\n\nBusiness Rules:\nhttps://wiki.mlbam.com/display/EBIS/3.1+Investigation+Status\n\nAcceptance Criteria: \n* The Status displayed in the Investigation History for Investigations (not Requests) follows the following rules: \n      * Before the Investigation has been submitted for the first time the Investigation Status = Preliminary\n      * When the Age Result and Identity Result = Pending or blank then the Investigation Status = Pending\n      * When the Age Result and Identity Result = Waived then the Investigation Status = Waived \n     * When the Age Result OR Identity Result = Failed then the Investigation Status = Failed\n     * When the Age Result AND Identity Result = Confirmed then the Investigation Status = Confirmed\n     * When the Age Result OR Identity Result = Undetermined and the other result = Undetermined or Confirmed, then the Investigation Status = Undetermined",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1005492,
    "title": "As a user I want saving a new investigation to send the player profile information to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253905",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 136,
    "updated_on": 1493909416,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "GIVEN a new investigation has been created for a player",
    "custom_steps": "WHEN the investigation is saved\r\n",
    "custom_expected": "THEN  the player's profile information is sent to LARI. If the profile had previously been sent to LARI it is sent as a \"player update\".\r\nAND fields and methods of communication should follow documentation found here:https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1005493,
    "title": "As a user I want profile updates on profiles that have been sent to LARI to a registration profile to be sent to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464591",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 136,
    "updated_on": 1493909416,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "GIVEN a player profile has been previously sent to LARI",
    "custom_steps": "WHEN one or more fields updated that are typically sent to LARI\r\n\r\n\r\n",
    "custom_expected": "THEN the updates should be sent to LARI as a player update. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1005495,
    "title": "As a user I want investigation results entered in LARI to be reflected in ebis",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464589",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 136,
    "updated_on": 1493909416,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 5,
    "custom_preconds": "GIVEN a player profile has been previously sent to LARI",
    "custom_steps": "When investigation results are entered in LARI",
    "custom_expected": "THEN the investigation information should be communicated back to ebis according to the business rules and the data discovery of the Investigation Form.",
    "custom_steps_separated": null
  },
  {
    "id": 1005497,
    "title": "As a user I want saving a new investigation to send the investigation information to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140608327",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 103,
    "updated_on": 1528917233,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": "GIVEN a new investigation has been created for a player\r\n",
    "custom_steps": "WHEN the investigation is saved",
    "custom_expected": "THEN the investigation should be sent to LARI\r\nAND fields and methods of communication should follow documentation found here:https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1005498,
    "title": "As a user I want certain Investigation results to be communicated back to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464573",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 136,
    "updated_on": 1493909416,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 8,
    "custom_preconds": "GIVEN an investigation has been created for a Player in ebis",
    "custom_steps": "WHEN the investigation result is updated in ebis to be \"Waived\" ",
    "custom_expected": "THEN this result should be communicated back to LARI",
    "custom_steps_separated": null
  },
  {
    "id": 1005500,
    "title": "As a user I want files attached to an Investigation Form to be communicated back to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464571",
    "created_by": 136,
    "created_on": 1493909416,
    "updated_by": 136,
    "updated_on": 1493909416,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 10,
    "custom_preconds": "GIVEN an investigation has been created for a player and saved\r\nAND user has opened the investigation form in edit mode\r\nAND user has attached new files",
    "custom_steps": "WHEN user clicks Save on the investigation form ",
    "custom_expected": "THEN system should check for the presence of any new attached files since the last save\r\nAND system should send newly attached files to LARI",
    "custom_steps_separated": null
  },
  {
    "id": 1082416,
    "title": "As a user I want merging 2 International Player profiles to send the information to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "139253907",
    "created_by": 103,
    "created_on": 1498832275,
    "updated_by": 103,
    "updated_on": 1498832275,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 11,
    "custom_preconds": "GIVEN an International Player Profile has already been sent to LARI",
    "custom_steps": "WHEN the International Player Profile associated with a player ID a that has already been sent to LARI is merged with another International Player Profile ",
    "custom_expected": "THEN the information should be communicated to LARI. \r\nAND fields and methods of communication should follow documentation found here: https://wiki.mlbam.com/display/EBIS/4.1+Profile+fields",
    "custom_steps_separated": null
  },
  {
    "id": 1082418,
    "title": "As a user I want attempts to communicate information to LARI that fail to not be lost forever",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142771077",
    "created_by": 103,
    "created_on": 1498832301,
    "updated_by": 103,
    "updated_on": 1498832330,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 12,
    "custom_preconds": "GIVEN a user is performing some action in EBIS which will send information or files to LARI (saving investigation etc)",
    "custom_steps": "WHEN the attempt to send information or files to LARI fails because of an inability to establish a connection between the two systems",
    "custom_expected": "THEN system should queue the items to be sent and continue to try at regular intervals until the system can successfully transmit the information\r\nAND if after a pre-determined amount of time the system can still not communicate the information to LARI, then the system should cease efforts and send a failure email",
    "custom_steps_separated": null
  },
  {
    "id": 1082419,
    "title": "As a user I want to receive an email when any LARI communication fails",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "142771111",
    "created_by": 103,
    "created_on": 1498832301,
    "updated_by": 103,
    "updated_on": 1498832330,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is performing some action in EBIS which will send information or files to LARI (saving investigation etc)\r\n",
    "custom_steps": "WHEN the attempt to send player or investigation information or files to LARI  fails to be sent to LARI because of an error with the data or file",
    "custom_expected": "THEN an email should be generated detailing the piece of information that failed, along with the Player ID associated with the information and the reason for failure\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1227587,
    "title": "As a user I want deleting an investigation in ebis to send a deleted result to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "148605887",
    "created_by": 103,
    "created_on": 1528912845,
    "updated_by": 103,
    "updated_on": 1528914120,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 14,
    "custom_preconds": null,
    "custom_steps": "We have run into some issues with investigations in ebis being deleted, and then causing a mess in LARI. \n\nAcceptance Criteria: \n* When an Investigation is deleted in ebis, a result of \"DEL\" is sent via the API to LARI to mark the investigation deleted. \n* Once the investigation has been deleted, it should be considered completed so that another investigation can be successfully sent to LARI for the same player.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1237088,
    "title": "As a user I want profile updates on profiles that have pending Investigations to be sent to LARI",
    "section_id": 119411,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "140464591",
    "created_by": 156,
    "created_on": 1550674928,
    "updated_by": 156,
    "updated_on": 1550674939,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 15,
    "custom_preconds": null,
    "custom_steps": "Business Rules: \nhttps://wiki.mlbam.com/display/EBIS/4.+LARI+Integration\n\nhttps://wiki.mlbam.com/display/EBIS/4.1+Profile+fields\n\nAcceptance Criteria: \n* Whenever a player profile that has a Pending investigation associated with it has one or more fields updated that are typically sent to LARI, the updates should be sent to LARI as a player update. \n* This should occur on grandfathered player profiles, professional player profiles, international registration player profiles and domestic amateur profiles.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409088,
    "title": "As am EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from Venezuela",
    "section_id": 1138834,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-997",
    "created_by": 207,
    "created_on": 1629831242,
    "updated_by": 207,
    "updated_on": 1629831242,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "Wire: https://tb5api.axshare.com/#p=l2_inv_-_venezuela\r\n\r\nAC:\r\n\r\nWhen an Level 2 is selected as the investigation type and Venezuela is selected as the player's Home Country, the Venezuelan L2 Consent form is displayed\r\n\r\nThe form will match the provided data discovery\r\n\r\nNote: the wire provided is specific to VZ and may cause updates to previously completed forms\r\n\r\nThe following flows will be carried through from other countries' forms:\r\n\r\nAuto-population from profile\r\n\r\nSelecting / Creating a Trainer\r\n\r\nSaving the Consent Form\r\n\r\nUpdating player profile\r\n\r\nEditing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409089,
    "title": "As an EBIS Investigation Admin, I want to Print a Venezuelan L2 Consent Form",
    "section_id": 1138834,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-998",
    "created_by": 207,
    "created_on": 1629831242,
    "updated_by": 207,
    "updated_on": 1629831242,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n\r\nWhen a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Dominican Republic, the system will generate the attached PDF\r\n\r\nThe fields on pages 1-7 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409090,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from the Dominican Republic",
    "section_id": 1138834,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-986",
    "created_by": 207,
    "created_on": 1629831242,
    "updated_by": 207,
    "updated_on": 1629831242,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": null,
    "custom_steps": "Wire:  https://tb5api.axshare.com/#p=l2_inv_-_dr\r\n\r\nAC:\r\n\r\nWhen an Level 2 is selected as the investigation type and Dominican Republic is selected as the player's Home Country, the Dominican L2 Consent form is displayed\r\n\r\nThe form will match the provided data discovery\r\n\r\nNote: the wire provided is specific to DR and may cause updates to previously completed forms\r\n\r\nThe following flows will be carried through from other countries' forms:\r\n\r\nAuto-population from profile\r\n\r\nSelecting / Creating a Trainer\r\n\r\nSaving the Consent Form\r\n\r\nUpdating player profile\r\n\r\nEditing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409091,
    "title": "As an EBIS Investigation Admin, I want to Print a Dominican L2 Consent Form",
    "section_id": 1138834,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-996",
    "created_by": 207,
    "created_on": 1629831242,
    "updated_by": 207,
    "updated_on": 1629831242,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n\r\nWhen a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Dominican Republic, the system will generate the attached PDF\r\n\r\nThe fields on pages 1-7 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409061,
    "title": "As an EBIS Investigations Admin, I want to create new Level 2 Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-942",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1629925009,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": "QA NOTE: this test case applies to Australia consent form and the following Prospect Information, Contact Information, and Prospect Address subsections \r\nview data discovery",
    "custom_steps": "Data Discoveries:\r\n\r\n - https://baseball.atlassian.net/wiki/spaces/EBIS/pages/3787342/Data+Discovery+-+Investigation+Form\r\n\r\n - https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\n\r\nWire:\r\n\r\nhttps://tb5api.axshare.com/#p=l2_investigation\r\n\r\nWHEN User creates a new Investigation\r\n",
    "custom_expected": "THEN there will be a new 'Level 2' value in the \"Registration Type\" dropdown menu\r\nAND selecting LEVEl 2 will display the new \"Consent Form\" section \r\nAND the fields displayed within the Consent Form section will be driven by the *Home Country* field\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 22409062,
    "title": "As an EBIS Investigations Admin, I want to see a Residency Information subsectionon the L2 Consent Form",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-945",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1629925648,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "Data Discovery:\r\n\r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\n\r\nWire:\r\n\r\nhttps://tb5api.axshare.com/#p=l2_investigation\r\n\r\n",
    "custom_steps": "WHEN user is viewing the Consent Form section of an investigation",
    "custom_expected": "THEN there will be a Residency Information subsection added to the L2 Consent Form\r\nAND the layout will match the provided data discovery and wire\r\nAND if the user selects 'No' to the \"has the player ever been to...\" question, nothing will display\r\nAND if the user selects 'Yes' to the \"Has the player ever been to...\" question, the subsequent questions will be displayed (view data discovery)",
    "custom_steps_separated": null
  },
  {
    "id": 22409063,
    "title": "As an EBIS Investigations Admin, I want to see a School Information subsectionon the L2 Consent Form",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-944",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1629925793,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "Data Discovery:\r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\n\r\nWire:\r\nhttps://tb5api.axshare.com/#p=l2_investigation\r\n\r\n",
    "custom_steps": "WHEN user is viewing the consent form section on an L2 Investigation",
    "custom_expected": "THEN there will be School Information subsection added to the L2 Consent Form\r\nAND the section will match the layout of the provided data discovery and wire\r\nAND the user will have the ability to add and delete schools ",
    "custom_steps_separated": null
  },
  {
    "id": 22409064,
    "title": "As an EBIS Investigations Admin, I want to see the Family Information section of a L2 Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-943",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1629926012,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": "Data Discovery:  https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\nWire: https://tb5api.axshare.com/#p=l2_investigation\r\n\r\n",
    "custom_steps": "WHEN user is viewing the Consent Form on an L2 Investigation\r\n",
    "custom_expected": "THEN there will be a Family Information subsection added to the Consent Form\r\nAnd the layout will match the provided wire and data discovery\r\nAND User will have the ability to add and delete siblings\r\nAND if the user chooses YES to the \"Does the prospect have a family member who signed a professional contract with an MLB team?\" question, a table will be displayed\r\nAND IF user selects no, then nothing will display\r\nAND user will be able to add and delete family members",
    "custom_steps_separated": null
  },
  {
    "id": 22409065,
    "title": "As an EBIS Investigation Admin, I want L2 Consent Forms to be auto-populated",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-948",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630077322,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 5,
    "custom_preconds": "Data Discovery:\r\n\r\n* [https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia|https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia]\r\n\r\nWire:\r\n[https://tb5api.axshare.com/#p=l2_investigation|https://tb5api.axshare.com/#p=l2_investigation]\r\n",
    "custom_steps": "WHEN User creates an L2 Investigation for player",
    "custom_expected": "THEN certain fields will be auto - populated from the player's intl profile, where possible (view data discovery)\r\nAND fields will be editable \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 22409066,
    "title": "As an EBIS Investigation Admin, I want to Edit a Level 2 Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-950",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630077431,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 6,
    "custom_preconds": "Data Discovery:\r\n - https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\n\r\nWire:\r\n - https://tb5api.axshare.com/#p=l2_investigation",
    "custom_steps": "WHEN an existing L2 Investigation form is in view",
    "custom_expected": "THEN there will be an edit button\r\nAND clicking the edit button will reload the form in edit mode",
    "custom_steps_separated": null
  },
  {
    "id": 22409067,
    "title": "As an EBIS Investigation Admin, I want to Save a Level 2 Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-949",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630077899,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": "Data Discovery:\r\n - https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1828782224/Data+Discovery+-+L2+Consent+Form+-+Australia\r\nWire:\r\n - https://tb5api.axshare.com/#p=l2_investigation\r\n",
    "custom_steps": "WHEN the L2 Investigation is in edit mode\r\n",
    "custom_expected": "THEN there will be save button\r\nAND when the save button is clicked, any changes made will be committed and the form will reloaded in View mode\r\nAND any updates made to fields the pre-populated/auto-populated from or appear on the player intl profile, will also be updated on the profile\r\nAND there will be a Cancel button \r\nAND clicking Cancel will prompt the user to confirm their actions",
    "custom_steps_separated": null
  },
  {
    "id": 22409068,
    "title": "As an EBIS Investigation Admin, I want to select a trainer while creating an Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-946",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630079100,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 8,
    "custom_preconds": "Wires:\r\n - https://tb5api.axshare.com/#p=l2_investigation\r\n - https://tb5api.axshare.com/#p=select_trainer_agent\r\n\r\nGIVEN user has created an investigation",
    "custom_steps": "WHEN viewing the trainer/agent select box ",
    "custom_expected": "THEN IF select box is clicked a modal will open, allowing the user to search the EBIS trainer/agent database for an existing trainer\r\nAND Clicking Cancel or the X icon dismisses the modal\r\nAND When an existing trainer is chosen, the Select button will become active\r\nAND Clicking select will dismiss the modal and populate the trainers name and info in the trainer/agent fields in the consent form section",
    "custom_steps_separated": null
  },
  {
    "id": 22409069,
    "title": "As an EBIS Investigation Admin, I want to create a new trainer while creating an Investigation",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-947",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630080520,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 9,
    "custom_preconds": "GIVEN User is viewing an L2 investigation form in edit mode\r\n\r\nWires:\r\n\r\n* [https://tb5api.axshare.com/#p=l2_investigation|https://tb5api.axshare.com/#p=l2_investigation]\r\n* [https://tb5api.axshare.com/#p=select_trainer_agent|https://tb5api.axshare.com/#p=select_trainer_agent]\r\n* [https://tb5api.axshare.com/#p=create_a_new_trainer_agent|https://tb5api.axshare.com/#p=create_a_new_trainer_agent]",
    "custom_steps": "WHEN User clicks the NewTrainer/Agent hyperlink \r\n",
    "custom_expected": "THEN a new, blank trainer/agent create new profile will open and will match the provided wire\r\nAND clicking Save on the profile will create the new profile and return the user to their entry point\r\nAND clicking Cancel on the profile will close the profile and return the user to their point\r\nAND the new profile will be searchable through trainer searches\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 22409070,
    "title": "As an EBIS Investigation Admin, I want to update Trainer/Agent Contact Information on L2 Consent Forms",
    "section_id": 1138835,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-995",
    "created_by": 207,
    "created_on": 1629831128,
    "updated_by": 207,
    "updated_on": 1630080775,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 10,
    "custom_preconds": "WIre: https://tb5api.axshare.com/#p=l2_investigation\r\n",
    "custom_steps": "WHEN a Trainer/Agent is selected in the Investigation Info section of a L2 Consent Form",
    "custom_expected": "THEN the contact information from the Trianer/Agent's profile will be populated on the Consent Form\r\nAND the Trainer/Agent contact info will be editable\r\nAND IF any changes are made to this info, it will update the Trainer/Agent profile when the Consent Form is saved",
    "custom_steps_separated": null
  },
  {
    "id": 22409071,
    "title": "As an EBIS Investigation Admin, I want to Print a Level 2 Investigation Consent Form from Autstralia",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-951",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1630080981,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 1,
    "custom_preconds": "GIVEN player's Home Country = Australia",
    "custom_steps": "WHEN user clicks Print on the L2 Investigation Consent Form\r\n",
    "custom_expected": "THEN the system will generate the PDF\r\nAND the fields on pages 1 - 3 will be populated with the values entered in the corresponding fields on the UI",
    "custom_steps_separated": null
  },
  {
    "id": 22409072,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from Panama",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-984",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1630082211,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 2,
    "custom_preconds": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1969554156/Data+Discovery+-+L2+Consent+Form+-+Panama\r\nWire:  https://tb5api.axshare.com/#p=l2_investigation\r\n",
    "custom_steps": "WHEN an L2 Investigation is created\r\nAND Home Country = Panama",
    "custom_expected": "Then the form will match the provided data discovery\r\n  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\n\r\nAND the following flows will be carried through from the Australia form\r\n\r\n  -- Selecting / Creating a Trainer\r\n\r\n  -- Saving the Consent Form\r\n\r\n  -- Updating player profile\r\n\r\n  -- Editing the Consent Form",
    "custom_steps_separated": null
  },
  {
    "id": 22409073,
    "title": "As an EBIS Investigation Admin, I want to Print a Panamanian L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-990",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1630082756,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 3,
    "custom_preconds": "Players Home Country = Panama",
    "custom_steps": "WHEN a user clicks Print on a L2 Investigation Consent Form\r\n ",
    "custom_expected": "THEN the fields on pages 1 - 4 will be populated with the values entered in the corresponding fields on the UI",
    "custom_steps_separated": null
  },
  {
    "id": 22409074,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from Nicaragua",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-983",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1630083750,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 4,
    "custom_preconds": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1969750370/Data+Discovery+-+L2+Consent+Form+-+Nicaragua\r\nWire:  https://tb5api.axshare.com/#p=l2_investigation\r\n\r\n",
    "custom_steps": " When an Level 2 is selected as the investigation type and Nicaragua is selected as the player's Home Country, the Nicaraguan L2 Consent form is displayed",
    "custom_expected": "THEN The form will match the provided data discovery\r\n\r\n  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\n\r\nAND The following flows will be carried through from the Australia forms:\r\n\r\n  -- Auto-population from profile\r\n\r\n  -- Selecting / Creating a Trainer\r\n\r\n  -- Saving the Consent Form\r\n\r\n  -- Updating player profile\r\n\r\n  -- Editing the Consent Form",
    "custom_steps_separated": null
  },
  {
    "id": 22409075,
    "title": "As an EBIS Investigation Admin, I want to Print a Nicaraguan L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-989",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Nicaragua, the system will generate the attached PDF\r\r - The fields on pages 3-5 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409076,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from Colombia",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-985",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 6,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1969554177/Data+Discovery+-+L2+Consent+Form+-+Colombia\r\r\r\rWire:  https://tb5api.axshare.com/#p=l2_investigation\r\r\r\rAC:\r\r - When an Level 2 is selected as the investigation type and Colombia is selected as the player's Home Country, the Colombia L2 Consent form is displayed\r\r - The form will match the provided data discovery\r\r  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\rThe following flows will be carried through from the Australia forms:\r\r  -- Auto-population from profile\r\r  -- Selecting / Creating a Trainer\r\r  -- Saving the Consent Form\r\r  -- Updating player profile\r\r  -- Editing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409077,
    "title": "As an EBIS Investigation Admin, I want to Print an Colombian L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-988",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 7,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Colombia, the system will generate the attached PDF\r\r - The fields on pages 1-4 will be populated with the values entered in the corresponding fields on the U",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409078,
    "title": "As an EBIS Investigation Admin, I want to complete an L2 Consent Form for a player from Mexico",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-982",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 8,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1969554133/Data+Discovery+-+L2+Consent+Form+-+Mexico\r\r\r\rWire:  https://tb5api.axshare.com/#p=l2_investigation\r\r\r\rAC:\r\r - When an Level 2 is selected as the investigation type and Mexico is selected as the player's Home Country, the Mexican L2 Consent form is displayed\r\r - The form will match the provided data discovery\r\r  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\r - The following flows will be carried through from the Australia forms:\r\r  -- Auto-population from profile\r\r  -- Selecting / Creating a Trainer\r\r  -- Saving the Consent Form\r\r  -- Updating player profile\r\r  -- Editing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409079,
    "title": "As an EBIS Investigation Admin, I want to Print a Mexican L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-987",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 9,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Mexico the system will generate the attached PDF\r\r - The fields on pages 3, 4, and 5 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409080,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from Aruba, Bonaire, Curacao",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-963",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 10,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1900380250/Data+Discovery+-+L2+Consent+Form+-+Aruba+Bonaire+Curacao\r\r\r\rWire: https://tb5api.axshare.com/#p=l2_investigation\r\r\r\rAC:\r\r - When an Level 2 is selected as the investigation type and Aruba, Bonaire, or Curacao is selected as the player's Home Country, the Aruba, Bonaire, Curacao L2 Consent form is displayed\r\r - The form will match the provided data discovery\r\r  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\r - The following flows will be carried through from the Australia forms:\r\r  -- Auto-population from profile\r\r  -- Selecting / Creating a Trainer\r\r  -- Saving the Consent Form\r\r  -- Updating player profile\r\r  -- Editing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409081,
    "title": "As an EBIS Investigation Admin, I want to Print a Aruba, Bonaire, Curacao L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-964",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 11,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Aruba, Bonaire, Curacao, the system will generate the attached PDF\r\r - The fields on pages 2 and 3 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409082,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from the Bahamas",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-961",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 12,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: [https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1900380181/Data+Discovery+-+L2+Consent+Form+-+Bahamas|https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1900380181/Data+Discovery+-+L2+Consent+Form+-+Bahamas]\r\rWire: [https://tb5api.axshare.com/#p=l2_investigation|https://tb5api.axshare.com/#p=l2_investigation]\r\rAC:\r\r* When an Level 2 is selected as the investigation type and Bahamas is selected as the player's Home Country, the Bahamian L2 Consent form is displayed\r* The form will match the provided data discovery\r** Note: The wire provided is the Australian form, there are only minor differences between the two\r* The following flows will be continue to work for the Bahamian form:\r** Auto-population from profile\r** Saving the Consent Form\r** Updating player profile\r** Editing the Consent Form\r** Carry forward existing Trainer logic",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409083,
    "title": "As an EBIS Investigation Admin, I want to Print a Bahamian L2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-962",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 13,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Bahamas, the system will generate the attached PDF\r\r - The fields on pages 1 and 2 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409084,
    "title": "As an EBIS Investigation Admin, I want to complete a L2 Consent Form for a player from China",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-959",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 14,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: [https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1899757808/Data+Discovery+-+L2+Consent+Form+-+China|https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1899757808/Data+Discovery+-+L2+Consent+Form+-+China|smart-link] \r\rWire:  [https://tb5api.axshare.com/#p=l2_investigation|https://tb5api.axshare.com/#p=l2_investigation]\r\rAC:\r\r* When an Level 2 is selected as the investigation type and China is selected as the player's Home Country, the Chinese L2 Consent form is displayed\r* The form will match the provided data discovery\r** Note: The wire provided is the Australian form, there are only minor differences between the two\r* The following flows will continue to work on the Chinese form:\r** Auto-population from profile\r** Saving the Consent Form\r** Updating player profile\r** Editing the Consent Form\r** Carry forward existing Trainer Requirements",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409085,
    "title": "As an EBIS Investigation Admin, I want to Print a Chinese Level 2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-960",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 308,
    "updated_on": 1642629031,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 15,
    "custom_preconds": null,
    "custom_steps": "AC:\r\n\r\n - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of China, the system will generate the attached PDF\r\n\r\n - The fields on pages 1, 2, and 3 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409086,
    "title": "As an EBIS Investigation Admin, I want to complete an L2 Consent Form for a player from Brazil",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-957",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 16,
    "custom_preconds": null,
    "custom_steps": "Data Discovery: https://baseball.atlassian.net/wiki/spaces/EBIS/pages/1899757588/Data+Discovery+-+L2+Consent+Form+-+Brazil\r\r\r\rWire:  https://tb5api.axshare.com/#p=l2_investigation\r\r\r\rAC:\r\r - When an Level 2 is selected as the investigation type and Brazil is selected as the player's Home Country, the Brazilian L2 Consent form is displayed\r\r - The form will match the provided data discovery\r\r  -- Note: The wire provided is the Australian form, there are only minor differences between the two\r\r - The following flows will be carried through from the Australia forms:\r\r  -- Auto-population from profile\r\r  -- Selecting / Creating a Trainer\r\r  -- Saving the Consent Form\r\r  -- Updating player profile\r\r  -- Editing the Consent Form",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22409087,
    "title": "As an EBIS Investigation Admin, I want to Print a Brazilian Level 2 Investigation Consent Form",
    "section_id": 1138836,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-958",
    "created_by": 207,
    "created_on": 1629831166,
    "updated_by": 207,
    "updated_on": 1629831166,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 18185,
    "display_order": 17,
    "custom_preconds": null,
    "custom_steps": "AC:\r\r - When a user clicks Print Consent Form on a L2 Investigation where the player has a home country of Brazil, the system will generate the attached PDF\r\r - The fields on pages 1, 2, and 3 will be populated with the values entered in the corresponding fields on the UI",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]