[
  {
    "id": 34780244,
    "title": "Nav Bar || Mobile - Update Aesthetics and Functionality of Nav Bar",
    "section_id": 2036952,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "STT-2198",
    "created_by": 309,
    "created_on": 1744302499,
    "updated_by": 308,
    "updated_on": 1747336856,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 704985,
    "display_order": 1,
    "custom_steps": "As an Admin, I want to update the Nav Bar, so that as new features are added, we can more compactly organize them within the existing space on mobile.\r\nZeplin: https://app.zeplin.io/project/5a0f1d4f4dcff4ca30221618/screen/66d8c1c16a1fb46979f81d37\r\n \r\n1. Mobile Nav Bar wireframes are implemented.\r\n\r\n2. Text within subnav is separated by Domestic and International headers, depending on which part of BATTER the feature is classified under.\r\na. Clicking/tapping on Domestic and International keeps the user on the current page.\r\n\r\n3. Only nav links with a subnav display a carrot.\r\n\r\n4. Upon click/tap of a nav link section (link, padding, and/or carrot)…\r\na. The user is taken to the link’s associated page, if one exists.\r\nNOTE: If no associated page exists, it is because the nav link has a subnav.\r\nb. The nav link’s subnav opens, if one exists.\r\ni. The user remains on the current page.\r\nii. The carrot flips to point up.\r\niii. Clicking/tapping the nav link section a second time closes the subnav.\r\n* The carrot flips to its original position, pointing down.\r\niv. Links in subnav are alphabetically ordered.\r\n\r\n5. Clicking/tapping a subnav link takes the user to the link’s associated page.\r\na. Only one subnav is open at a time.\r\n\r\n6. If a user has a subnav open, then navigates to a different subnav, the current subnav will close in order to open the new subnav.\r\n\r\n7. Clicking/tapping in negative space of Nav Bar does not do anything.\r\n\r\n8. Clicking/tapping on user’s email displays the Sign Out button.\r\n\r\n9. Clicking/tapping Sign Out logs the user out of BATTER. \r\n\r\n10. Links in menu are alphabetically ordered."
  },
  {
    "id": 34780245,
    "title": "Nav Bar || Desktop - Update Aesthetics and Functionality of Nav Bar",
    "section_id": 2036952,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "STT-2197",
    "created_by": 309,
    "created_on": 1744302546,
    "updated_by": 308,
    "updated_on": 1747336870,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 704985,
    "display_order": 2,
    "custom_steps": "As an Admin, I want to update the Nav Bar, so that as new features are added, we can more compactly organize them within the existing space on desktop.\r\n\r\nZeplin: - https://app.zeplin.io/project/5a0f1d4f4dcff4ca30221618/screen/66d8c1c16a1fb46979f81d37\r\n\r\n \r\n\r\n1. Desktop Nav Bar wireframes are implemented.\r\n\r\n2. Text within subnav is separated by Domestic and International headers, depending on which part of BATTER the feature is classified under.\r\n\r\n3. Upon mouse hover of nav link…\r\na. Nav text is highlighted.\r\ni. NOTE: mouse hover is defined as the mouse existing within the bounds of the highlighted area. \r\nb. If nav link has associated subnav, subnav flies open to the right.\r\nc. When mouse is no longer hovering over the link, subnav closes. \r\nd. Links in subnav are alphabetically ordered.\r\n\r\n4. Upon click/tap of a nav link…\r\na. The user is taken to the link’s associated page, if applicable.\r\ni. NOTE: If no associated page exists, it is because the nav link has a subnav.\r\nb. The user remains on the current page if the menu link has a subnav.\r\ni. Subnav remains open if user clicks on menu link.\r\nc. Menu item is highlighted.\r\n\r\n5. Clicking/tapping a subnav link takes the user to the link’s associated page.\r\n\r\n6. Clicking/tapping in negative space of Nav Bar does not do anything.\r\n\r\n7. Links in menu are alphabetically ordered."
  }
]