[
  {
    "id": 1226049,
    "title": "Re-working of how parameters are passed to BO for reports",
    "section_id": 148100,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157220750",
    "created_by": 103,
    "created_on": 1526936661,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "(note to QA: this will need to be tested on reports globally, devs should provide a list of reports to check on the attached story)\r\nGIVEN devs have re-worked how parameters are passed to BO for reports that open in a new tab from EBIS (Bulk NOD for example)\r\n",
    "custom_steps": "WHEN user runs a report that opens a new BO tab",
    "custom_expected": "THEN that report should run as expected for any prompts selected\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1226047,
    "title": "As a developer i want to be able to get MJC ids that were updated (via a data fix)",
    "section_id": 148101,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156997184",
    "created_by": 103,
    "created_on": 1526931591,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN one or more fields on an MJC have been data fixed by devs\r\n\r\n",
    "custom_steps": "WHEN user runs the Ebis Link Updated Batch",
    "custom_expected": "THEN MJC IDs for all the MJC that were data fixed should display in batch results\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1225576,
    "title": "As a BOC user I want to edit an existing form in the System Forms widget",
    "section_id": 148103,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156901520",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user logs in with system forms widget edit permission\r\nAND user sees a pencil icon on each row in the widget",
    "custom_steps": "WHEN user clicks the pencil icon\r\n\r\n",
    "custom_expected": "THEN system will place that row in edit mode.\r\nAND Once any row is in edit mode, the \"Save\" button appears and is enabled.\r\nAND Once any row is in edit mode, the \"Cancel All Changes\" button appears and is enabled. \r\nAND When a row is in edit mode, there is a red x on the row that allows the user to cancel the editing of that row. If this x is clicked, any changes made are discarded. If this was the only row in edit mode, then the Save and Cancel All Changes buttons are disabled or hidden. \r\nAND The user has the ability to change any of the relevant values, including replace the applicable file. \r\nAND The user has the ability to change whether or not this form appears to Club users by making the form Active or Inactive using the provided checkbox.\r\n\r\nWireframe:\r\nhttps://7xflwf.axshare.com/#p=system_forms_-_boc\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Data+Discovery+-+System+Forms+widget",
    "custom_steps_separated": null
  },
  {
    "id": 1225562,
    "title": "As a user I want to be able to create a MN Contract for an International Amateur player",
    "section_id": 148104,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155479751",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN club user is logged in with Edit International Amateur permissions\r\nAND user is viewing International Amateur Player profiles",
    "custom_steps": "WHEN user click on \"Create New icon\" on International Amateur profiles ",
    "custom_expected": "THEN Users are able to launch a new Minor Contract for the player via the Create New. \r\nAND The Minor Contract workflow is able to be completed for the new kind of International Amateur profiles, just like it was previously. This includes the information properly populating the printed MN Contract, and the contract showing up in the International Signing Bonus utility if applicable. \r\nAND This needs to still work for existing international amateurs. \r\n\r\n*Amateur conversion to professional is covered in another story*",
    "custom_steps_separated": null
  },
  {
    "id": 1225572,
    "title": "As a user I want to be able to run the All Registered Players List Report",
    "section_id": 148106,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156214007",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 4,
    "custom_preconds": "GIVEN Club and BOC logs in with Reporting permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in Report Widget\r\n\r\n",
    "custom_expected": "THEN \"All Registered Players\" Report should be listed on reporting widget. \r\nAND Selecting this report from the widget will launch the prompts according to the requirements. \r\nAND The category of this report should be \"International\". \r\nAND The current year should always be available for the BOC.\r\nAND The current year should ONLY be available for anyone outside of the BOC after the Open All Registration Report system date for the current year. \r\nAND Entering the desired prompts and running the report will work and match the requirements. \r\nAND The report will continue to use the existing LDAP. \r\nAND The report will NOT be downloadable to any format other than pdf.\r\nAND The report will include a watermark on each page of the running user's username. \r\nAND Players who have been indicating as needing a # next to their names, have it. \r\nAND Running the report includes the designated fake players, with their DOB adjusting based on the Org of the user running the report.\r\n\r\nReport Layout: \r\nhttps://wiki.mlbam.com/display/EBIS/All+Registered+Players+-+Report+Layout\r\n\r\nReport Details: \r\nhttps://wiki.mlbam.com/display/EBIS/All+Registered+Players+-+Report+Details\r\n\r\nReport Logic: \r\nhttps://wiki.mlbam.com/display/EBIS/All+Registered+Players+-+Population%2C+Logic+and+Sort+Considerations\r\n\r\nReport Prompts: \r\nhttps://wiki.mlbam.com/display/EBIS/All+Registered+Players+-+Prompts\r\n\r\nReport Security: \r\nhttps://wiki.mlbam.com/display/EBIS/All+Registered+Players+-+Audience+-+Security-+Frequency\r\n\r\nView Story: #156213976",
    "custom_steps_separated": null
  },
  {
    "id": 1225578,
    "title": "As a BOC user I want International Amateur quick searches tracked",
    "section_id": 148107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902068",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Advanced Search\r\nAND user navigated to the International Amateur quick Search",
    "custom_steps": "When user quick search for any Intl Ama player",
    "custom_expected": "THEN the system needs to keep a record of every international quick search undertaken. \r\nAND the system will need to keep a record of the following information about each search: \r\n - Username of the user conducting the search\r\n - Org of the user conducting the search\r\n - Date of the search\r\n - Time of the search (EST)\r\n - The value entered into the search bar\r\n - How many results were returned\r\nAND Each time results are returned to the user is considered a new and unique search.",
    "custom_steps_separated": null
  },
  {
    "id": 1225583,
    "title": "As a BOC user I want the actions taken after an International Amateur quick search tracked",
    "section_id": 148107,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156902106",
    "created_by": 103,
    "created_on": 1525198558,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama quick search permissions\r\nAND user navigated to the International Amateur quick search\r\n",
    "custom_steps": "WHEN user quick search for any Intl Ama player",
    "custom_expected": "THEN the system will need to keep a record of the following information about the actions taken for each search: \r\n - Profiles opened as a result of the search. (Last, First and Player ID)\r\n - Whether the user \"tagged\" the player as a result of the search.\r\n - Whether the user created a Contract as a result of the search. \r\n - Whether the user registered the player as a result of the search.",
    "custom_steps_separated": null
  },
  {
    "id": 1225615,
    "title": "As a user I want to view an existing International Prospect Report",
    "section_id": 148110,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155455084",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and Club user logs in with International Prospect Report permission\r\nAND an international ama player has existing International Prospect Report\r\n\r\n",
    "custom_steps": "WHEN user is in international player's Scouting History widget\r\n",
    "custom_expected": "THEN the Report Date will be clickable hyperlink on the player's Scouting History widget. \r\nAND Clicking the hyperlink for International Prospect reports opens the report in the same window.\r\nAND The report follows the provided wireframe and data discovery.  \r\nAND The browser tab text says \"Prospect Report(or if a code exists for this use that instead) - Last, First\"\r\nAND There is a Close button on the Report in view mode. Clicking close will return the user to their point of entry.\r\n\r\n*Note that there are 2 different sets of fields/layouts depending on the position used for the report. If the player report is for a pitching position, use the pitching fields provided - otherwise use the position player fields*\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=prospect_report\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Prospect+or+Signable+Report+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1225617,
    "title": "As a user I want to view an existing Daily Report",
    "section_id": 148111,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157230124",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC and Club user logs in with Daily Report permission\r\nAND an international ama player is included in Daily Report\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in international player's Scouting History widget\r\n\r\n",
    "custom_expected": "THEN Daily Reports should appear as a clickable hyperlink in the player's Scouting History widget for each player that is included in a Daily Report. \r\nAND The Report Date is a clickable hyperlink on the player's Scouting History widget. \r\nAND Clicking the hyperlink for Daily Reports opens the report in the same window.\r\nAND The report follows the provided wireframe and data discovery. \r\nAND The Player blocks appear in alphabetical order and are expanded by default\r\nAND The browser tab text says \"Daily Report - [report date]\"\r\nAND There is a Close button on the Report in view mode. Clicking close will return the user to their point of entry. \r\nAND The expand/collapse all links on the quick search will also expand/collapse all of the player blocks in addition to the form sections.  \r\n\r\nThere are actually only 2 of these in Production: https://ebis.mlb.com/scouting/dailyreport/view?rptMasterId=1007214\r\n\r\nThis is the best one and should be available in the Scouting Report widget of Player ID 798112.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=daily_report_1\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/Daily+Report+-+Data+Discovery\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1225610,
    "title": "As a user I want to view an existing International Workout Report",
    "section_id": 148113,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155455064",
    "created_by": 103,
    "created_on": 1525986783,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 5,
    "custom_preconds": "GIVEN Club and BOC user logs with permission to view International Workout Report\r\n\r\n\r\n",
    "custom_steps": "WHEN user is in international player's Scouting History widget\r\n",
    "custom_expected": "THEN The Report Type should be a clickable hyperlink on the player's Scouting History widget.\r\nAND Clicking the hyperlink for International Workout reports should open the report in the same window\r\nAND The report should follow the provided wireframe and data discovery\r\nAND The browser tab text should say \"Workout Report(or if a code exists for this use that instead) - Last, First\"\r\nAND There should be a Close button on the Report in view mode. Clicking close should return the user to their point of entry\r\nAND There are a number of fields indicated on the form as \"legacy\" fields. These should not be used in new reports created after go live, but still need to display on historical reports\r\n*Note that there are 2 different sets of fields/layouts depending on the position used for the report. If the player report is for a pitching position, use the pitching fields provided - otherwise use the position player fields*\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=workout_report\r\n\r\nData Discovery:\r\nhttps://wiki.mlbam.com/display/EBIS/International+Workout+Report+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1225709,
    "title": "International Scouting Report - Permissions",
    "section_id": 148114,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157499395",
    "created_by": 103,
    "created_on": 1526398977,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN International Scouting Reports should only be visible to those users that have permission to view the reports",
    "custom_steps": "WHEN a user is logged in that has any of the following permissions, AND the new intl-user LDAP(EBIS-INTL-USER-NEW) \r\n  - EBIS-INTL-SCOUTING-REPORT-EDITORS\r\n  - EBIS-INTL-SCOUTING-REPORT-APPROVERS\r\n  - EBIS-INTL-SCOUTING-REPORT-VIEWERS\r\n\r\n",
    "custom_expected": "THEN these users should be able to view International Scouting Reports (International Workout Report, International Signable Report and International Prospect Reports)\r\n\r\nNote:the following updates have been made to the user ids below to test this: \r\n  - test_ebis_user73@mlb.com should have the editors permission (Scout)\r\n  - test_ebis_user74@mlb.com should have the approvers permission (Scout Admin)\r\n  - test_ebis_user77@mlb.com should have the viewers permission (Scout Viewer)\r\n  - test_ebis_user75@mlb.com should have the approvers permission (BOC Admin and Scout Admin)\r\n  - test_ebis_user76@mlb.com should have the editors permission (BOC Admin and Scout)\r\n  - test_ebis_user78@mlb.com should have the viewers permission (BOC Viewer and Scout Viewer)",
    "custom_steps_separated": null
  },
  {
    "id": 1226028,
    "title": "As a Scout I want my Clipboard to hold only my own items",
    "section_id": 148115,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156057672",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN Scout Clipboards are specific to each user",
    "custom_steps": "WHEN a specific Scout user logs into the system and views their Scouting Clipboards",
    "custom_expected": "THEN ONLY those items created by their own username should appear in the widget",
    "custom_steps_separated": null
  },
  {
    "id": 1226029,
    "title": "As a Scout Admin I want my Clipboard to hold only my own items and those submitted by Scouts",
    "section_id": 148116,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156058467",
    "created_by": 103,
    "created_on": 1526930655,
    "updated_by": 103,
    "updated_on": 1528213585,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20425,
    "display_order": 1,
    "custom_preconds": "GIVEN a scout admin user is logged in with permission to view scout admin clipboard",
    "custom_steps": "WHEN Scouting Admin user views their Clipboard",
    "custom_expected": "THEN user should see their own items, just like any scout would in their Clipboard\r\nBUT user should not see the items in a non-Submitted state created by other Admins\r\nAND the Admin should also see any items that have been submitted by ANY Scout or Scout Admin",
    "custom_steps_separated": null
  }
]