[
  {
    "id": 1198845,
    "title": "As a user I want to be able to create a new Assign as 7th Coach transaction for an employee",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905761",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN user is in Employee Profile",
    "custom_steps": "WHEN user clicks on \"Create New\" button on the Employee Profile\r\n",
    "custom_expected": "\r\nTHEN \"Transactions\" is an option in the top-level dropdown.\r\nAND Selecting \"Transactions\" will display a secondary and tertiary dropdown.\r\nAND \"Assignments\" should be an option under the secondary dropdown. \r\nAND \"Assign as 7th Coach\" should be an option in the third level dropdown when \"Assignments\" is selected.\r\nAND Selecting \"Assign as 7th Coach\" from the Create New will check to see if there is an existing Preliminary transaction of the same type for the same employee created within 10 days of the current date. \r\nAND If a preliminary already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If no preliminary transaction created within the last 10 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_as_7th_coach\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198846,
    "title": "As a user I want to be able to save a new Assign as 7th Coach transaction for an employee",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905807",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN the user is in employee profile",
    "custom_steps": "WHEN user opens a new Assign as 7th Coach transaction in edit mode for an employee\r\n\r\n",
    "custom_expected": "THEN Save button will be available anytime the form is in edit mode.\r\nAND Clicking Save will save the transaction and it's current values.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made.\r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOr If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nOR If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.\r\n\r\nWireframe:\r\nhttp://hri2kq.axshare.com/#p=assign_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198847,
    "title": "As a user I want to be able to delete an Assign as 7th Coach transaction for an employee",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905751",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN the user is in employee profile\r\n\r\n",
    "custom_steps": "WHEN user opens a new Assign as 7th Coach transaction in edit mode for an employee in Preliminary or Rejected states\r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode.\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\nTitle: Warning\r\nBody: Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\nHint: This is a permanent action that cannot be undone.\r\nButtons: Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nAND If they do not confirm the deletion, then they should be returned to the form and no action should be taken.\r\n\r\nWireframe:\r\nhttp://hri2kq.axshare.com/#p=assign_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198848,
    "title": "As a Club user I want to be prevented from initiating an Assign as 7th Coach transaction for an employee that does not belong to my Club",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906171",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN club user Initials an Assign as 7th Coach transaction for a 7th coach\r\nAND Employee's Current Org is different from logged in club user's Org\r\n\r\n",
    "custom_steps": "WHEN user selects Assign as 7th Coach transaction on the Create New menu\r\n\r\n",
    "custom_expected": "THEN system should display a blocking message \"You do not have permission to create a transaction for an employee that belongs to another Organization. If you believe you have received this message in error, please contact the BOC.\"\r\nAND clicking \"Back\" will return the user to the entry point\r\nOr If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198849,
    "title": "As a user I want to Submit an Assign as 7th Coach to the BOC for approval",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908040",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN a user is attempting to submit an Assign as 7th Coach transaction\r\nAND transaction is in preliminary or rejected state\r\n\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Submit to BOC\" button (Blue for Club users and grey for the BOC)\r\n",
    "custom_expected": "THEN system will run a required field and formatting check, as well as all on Submit rules. Once the rule checks have been passed or overridden, the system will save the transaction and its current values.\r\nAND Transaction status will be set to \"Submitted to BOC\".\r\nAND After a successful submission the system will display a successful submit blue notification. \r\nAND An approvals item will be generated for the BOC. \r\nAND The transaction is added to the Player's History in green font: Code =AS7CO Description = Assign as 7th Coach , From Org/Club fields\r\n\r\nWireframe:\r\nhttp://hri2kq.axshare.com/#p=assign_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198850,
    "title": "As a BOC user I want to approve an Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908058",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN an Assign as 7th Coach transaction is in Preliminary, Submitted to BOC, or Rejected status\r\nAND blue \"Approve\" button is available\r\n\r\n\r\n",
    "custom_steps": "WHEN the BOC user clicks \"Approve\"\r\n",
    "custom_expected": "THEN Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND If applicable, the BOC approvals item is removed.\r\nAND A successful blue notification is displayed that states the transaction was approved.\r\nAND Update Player's Player History: Code =AS7CO Description = Assign as 7th Coach , From Org/Club fields in black font.",
    "custom_steps_separated": null
  },
  {
    "id": 1198851,
    "title": "As a BOC user I want to reject an Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908060",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN an Assign as 7th Coach transaction has been submitted to BOC\r\nAND grey \"Reject\" button is available (in view or edit mode)\r\n\r\n\r\n",
    "custom_steps": "WHEN BOC user clicks \"Reject\"",
    "custom_expected": "THEN BOC users with edit permissions see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in a Submitted to BOC state. \r\nAND Clicking \"Reject\" will run all required field, and formatting checks and display any relevant error or warning messages. \r\nAND The transaction status is updated to \"Rejected\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was rejected.\r\nAND The item is removed from the player's history. \r\nAND The Approvals item is removed for the BOC.\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198852,
    "title": "As a BOC user I want to be able to suppress an Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908056",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "GIVEN an Assign as 7th Coach transaction has been approved or Reversed for a player\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN BOC user is on Assign as 7th Coach transaction in view or Edit mode",
    "custom_expected": "THEN Users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. Reverse is handled in a previous story so this story will only deal with the suppression. \r\nAND When a transaction is suppressed it will be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\nAND Suppressing a transaction will also remove any notifications that were generated for the transaction prior to suppression.\r\nAND A blue notification should be thrown saying \"The transaction has been successfully suppressed\"",
    "custom_steps_separated": null
  },
  {
    "id": 1198853,
    "title": "As a Club user I want to receive a notification when an Assign as 7th Coach is rejected, approved or reversed",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908061",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "GIVEN an Assign as 7th Coach tx exists for a Employee\r\nAND a user is logged in as a club \r\n\r\n",
    "custom_steps": "WHEN Assign as 7th Coach tx reaches a rejected, approved or reversed status",
    "custom_expected": "THEN a notification will appear on the notification clipboard \r\nAND Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Approved. \r\nOr Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Rejected.\r\nOr Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Player's name will be a hyperlink.\r\nAND Clicking on the player's name hyperlink of any of these notifications will open the player's profile in view mode in the same window/tab on the Player History tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1198854,
    "title": "As a user I want to edit an existing Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908059",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "GIVEN user with edit permission logs in\r\n\r\n",
    "custom_steps": "WHEN user opens an existing Assign as 7th Coach transaction\r\n\r\n",
    "custom_expected": "THEN an Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state.\r\nAND Clicking Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND in Preliminary, the Club and BOC users will be able to edit all portions displayed on the form. \r\nOR In states other than Preliminary, edit only gives clubs access to attach new files. Club cannot edit existing attachments or any other part of transaction.\r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions.\r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and AND \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND Clicking Save will always reload the form in View mode.\r\n\r\nSee Wireframe: \r\nhttp://aceshn.axshare.com/#p=voluntary_designation",
    "custom_steps_separated": null
  },
  {
    "id": 1198855,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a transaction with an assignment date after the current date",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908054",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 136,
    "updated_on": 1516129077,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC approver logs in\r\nAND Assignment date on the Assign as 7th Coach transaction is set after the current date",
    "custom_steps": "WHEN user clicks on Approve",
    "custom_expected": "THEN system will check if the current date is after the assignment date entered on the transaction. If yes, display an error. See Messages #9.\r\nSee Error Message #9:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198856,
    "title": "As a user I want to be able to view an existing Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150896159",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "GIVEN the user is in Employee Profile\r\nAND Employee has an existing Assign as 7th Coach transaction",
    "custom_steps": "WHEN the user clicks on Transaction on employee's History (or Advanced Search)\r\n",
    "custom_expected": "THEN system will open the transaction in the same window.\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey.\r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198857,
    "title": "Assign as 7th Coach - Editor permissions",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906003",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN BOC or Club admin account logs in",
    "custom_steps": "WHEN the user is in employee widget\r\n",
    "custom_expected": "THEN they should have the following Editor permission\r\nBOC users with a Editor permission can:\r\n  -Can view and Print all employee transactions [Club and BOC] in all states for Employees.\r\n  -Can create, delete, edit, e-sign and submit all employee transactions for Employees. \r\n  -Can Approve, Reject, Reverse and Suppress all Employee transactions.\r\n\r\nClub users with a Editor permission can:\r\n  -Club users with this role can view and print all minor league transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs to.\r\n  However, there are exceptions:\r\n       1. No Transactions that are in Suppressed state\r\n       2. They cannot see \"BOC Notes\" field\r\n  -Club users with this role Can view all APPROVED (no other states) minor league transactions including other club's Minor League transactions or BOC only transactions with the following exceptions:\r\n       1. Cannot see BOC Notes field for any transaction\r\n       2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAttached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n       3. Can create, delete, submit, edit, attach files, and e-sign all Minor League transactions for Minor League players on their Org's roster or if they are the\"From Org\" or \"To Org\".",
    "custom_steps_separated": null
  },
  {
    "id": 1198858,
    "title": "Assign as 7th Coach - Viewer Permissions",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905991",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "GIVEN BOC or Club viewer account logs in\r\n\r\n",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have the following Viewer permission\r\n-BOC users with a Viewer permission can*:\r\n  -- Can view and Print all employee transactions in all states but cannot make any changes or e-sign.\r\n  --Can view all flags for all transactions and transaction attachments in all states.\r\n\r\n-Club users with a Viewer permission can*:\r\n  --Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs to.\r\n\r\n          However, there are exceptions:\r\n                  1. No Transactions that are in Suppressed state\r\n                  2. They cannot edit or change these transactions (Basic only)\r\n                  3. They cannot see \"BOC Notes\" field\r\n \r\n -Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2.  Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is \r\n         currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1198859,
    "title": "As a BOC user I want to be able to reverse an Assign as 7th Coach transaction",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150908056",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 15,
    "custom_preconds": "GIVEN an Assign as 7th Coach transaction has been approved for a player\r\n\r\n\r\n",
    "custom_steps": "WHEN BOC user is on Assign as 7th Coach transaction in view or Edit mode",
    "custom_expected": "THEN BOC Approvers see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Selection to ML Rosterâ€￾ \r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198860,
    "title": "As a user I want to be prevented from creating an Assign as 7th Coach for someone who is not a currently Active Employee",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151198201",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 16,
    "custom_preconds": "GIVEN BOC or club user logged in with Employee Transaction Permissions\r\nAND user is on an Employee Profile for employee who has one of the following Employee Roster Status:\r\n  - Active\r\n  - Suspended\r\n  - Temporarily Inactive\r\n  - Ineligible\r\n  - Disqualified",
    "custom_steps": "WHEN the user selects \"Assign as 7th Coach\" on the employee Create New menu",
    "custom_expected": "THEN system will check if the person has a current Employee Roster Status of:\r\n   - Active \r\n   - Suspended\r\n  - Temporarily Inactive\r\n  - Ineligible\r\n  - Disqualified\r\nAND If not, then display a blocking message. See Messages #12.\r\n\r\nSee Error Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198861,
    "title": "As a BOC user I want approving an Assign as 7th Coach transaction to auto-create/approve a Remove as 7th Coach transaction for the current 7th Coach",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142532",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 17,
    "custom_preconds": "GIVEN the user initials an Assign as 7th Coach transaction\r\nAND the org already has a 7th Coach assigned\r\n\r\n\r\n\r\n",
    "custom_steps": "When the Assign as 7th Coach transaction is moved to \"Approved\"\r\n\r\n\r\n",
    "custom_expected": "Then the system should auto create and approve a Remove as 7th Coach transaction for the current 7th Coach. \r\nAND All on approve rules and updates should be run per the provided rules, just as if the transaction was manually created.",
    "custom_steps_separated": null
  },
  {
    "id": 1198862,
    "title": "As a user I want to receive an error if I have back dated my placement date more than 10 days",
    "section_id": 143803,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503037",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234727,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 18,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND Assignment date on an Assign as 7th Coach transaction is set more than 10 days prior to the current date",
    "custom_steps": "WHEN user clicks on Submit or Approve",
    "custom_expected": "THEN Clicking \"Submit\" or \"Approve\" (all places OnSubmit rules are fired) will check if the placement date is 10 or more days prior to the current date. If yes, display error. See Messages #2.\r\n\r\nSee Error Message #2: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198832,
    "title": "As a user I want to be able to save a new Remove as 7th Coach transaction for an employee",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142282",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN the user is in employee profile\r\nAND employee is 7th Coach\r\n",
    "custom_steps": "WHEN user opens a new Remove as 7th Coach transaction in edit mode for an employee\r\n\r\n",
    "custom_expected": "THEN A Save button will be available anytime the form is in edit mode.\r\nAND Clicking Save will save the transaction and it's current values.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made.\r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOr If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nOr If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198833,
    "title": "As a user I want to be able to create a new Remove as 7th Coach transaction for an employee",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142284",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN the user is in employee profile for 7th Coach\r\n\r\n",
    "custom_steps": "WHEN user clicks on \"Create New\" button on the Employee Profile\r\n\r\n",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown.\r\nAND Selecting \"Employee Transactions\" will display a secondary and tertiary dropdown.\r\nAND \"Assignments\" should be an option under the secondary dropdown. \r\nAND \"Remove as 7th Coach\" should be an option in the third level dropdown when \"Assignments\" is selected.\r\nAND Selecting \"Remove as 7th Coach\" from the Create New will check to see if there is an existing Preliminary transaction of the same type for the same employee created within 10 days of the current date. \r\nAND If a preliminary already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOr If no preliminary transaction created within the last 10 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND  Transaction should follow the wireframe and data discovery.\r\n\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198834,
    "title": "As a user I want to be prevented from initiating a Remove as 7th Coach transaction for an employee that is not a 7th Coach",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142617",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN user is on an employee profile for employee who is not 7th coach\r\n\r\n\r\n",
    "custom_steps": "WHEN user selects 'Remove as 7th coach' on the employee Create New menu\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN system will check if the employee is currently a 7th Coach.  \r\nAND If not, then display a blocking message. See Messages #11.\r\n\r\nSee Error Message #11: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198835,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a transaction with an assignment date after the current date",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142271",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC approver initiated Remove as 7th Coach transaction\r\nAND Assignment date on the Remove as 7th Coach transaction is set after the current date",
    "custom_steps": "WHEN user clicks on Approve\r\n\r\n",
    "custom_expected": "THEN system will check if the current date is after the assignment date entered on the transaction. If yes, display an error. See Messages #9.\r\n\r\nSee Error Message #9:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198836,
    "title": "As a user I want to Submit a Remove as 7th Coach to the BOC for approval",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142278",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN the user initiated Remove as 7th Coach transaction for 7th coach \r\nAND transaction is in preliminary or rejected state\r\n\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Submit to BOC\" button (Blue for Club users and grey for the BOC)\r\n",
    "custom_expected": "THEN system will run a required field and formatting check, as well as all on Submit rules. Once the rule checks have been passed or overridden, the system will save the transaction and its current values.\r\nAND Transaction status will be set to \"Submitted to BOC\".\r\nAND After a successful submission the system will display a successful submit blue notification. \r\nAND An approvals item will be generated for the BOC. \r\nAND The transaction is added to the Player's History in green font: Code =RM7CO Description = Remove as 7th Coach , From Org/Club fields",
    "custom_steps_separated": null
  },
  {
    "id": 1198837,
    "title": "As a user I want to be able to delete a Remove as 7th Coach transaction for an employee",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142281",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN the user is in employee profile for 7th coach",
    "custom_steps": "WHEN user opens a new Remove 7th Coach transaction in edit mode for an employee in Preliminary or Rejected states\r\n\r\n\r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode.\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\nTitle: Warning\r\nBody: Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\nHint: This is a permanent action that cannot be undone.\r\nButtons: Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1198838,
    "title": "As a BOC user I want to reject a Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142275",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN an Remove as 7th Coach transaction has been submitted to BOC\r\nAND grey \"Reject\" button is available (in view or edit mode)",
    "custom_steps": "WHEN BOC user clicks \"Reject\"\r\n\r\n",
    "custom_expected": "THEN BOC users with edit permissions see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in a Submitted to BOC state. \r\nAND Clicking \"Reject\" will run all required field, and formatting checks and display any relevant error or warning messages. \r\nAND The transaction status is updated to \"Rejected\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was rejected.\r\nAND The item is removed from the player's history. \r\nAND The Approvals item is removed for the BOC.",
    "custom_steps_separated": null
  },
  {
    "id": 1198839,
    "title": "As a Club user I want to be prevented from initiating a Remove as 7th Coach transaction for an employee that does not belong to my Club",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142280",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "GIVEN club user Initials Remove as 7th Coach transaction for a 7th coach\r\nAND Employee's Current Org is different from logged in club user's Org\r\n\r\n",
    "custom_steps": "WHEN user selects Remove as 7th Coach transaction on the Create New menu\r\n\r\n\r\n",
    "custom_expected": "THEN system will check the employee's Current Org against the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nAND If the Org of the initiating user is not BOC or the Current Org of the employee, then display a blocking message. See Messages #1.",
    "custom_steps_separated": null
  },
  {
    "id": 1198840,
    "title": "As a Club user I want to receive a notification when a Remove as 7th Coach is rejected, approved or reversed",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142273",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "GIVEN a Remove as 7th Coach tx exists for a Employee\r\nAND a user is logged in as a club",
    "custom_steps": "WHEN Remove as 7th Coach tx reaches a rejected, approved or reversed status\r\n\r\n",
    "custom_expected": "THEN a notification will appear on the notification clipboard\r\nAND Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Approved. \r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Rejected.\r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Player's name will be a hyperlink.\r\nAND Clicking on the player's name hyperlink of any of these notifications will open the player's profile in view mode in the same window/tab on the Player History tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1198841,
    "title": "As a BOC user I want to approve a Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142276",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "GIVEN an Remove as 7th Coach transaction is in Preliminary, Submitted to BOC, or Rejected status\r\nAND blue \"Approve\" button is available",
    "custom_steps": "WHEN the BOC user clicks \"Approve\"\r\n\r\n",
    "custom_expected": "THEN Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND If applicable, the BOC approvals item is removed.\r\nAND A successful blue notification is displayed that states the transaction was approved.\r\nAND Update Player's Player History: Code =RM7CO Description = Remove as 7th Coach , From Org/Club fields in black font. \r\nAND All other \"Approval\" updates per the provided business rules.",
    "custom_steps_separated": null
  },
  {
    "id": 1198842,
    "title": "As a BOC user I want to be able to reverse a Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142274",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN an Remove as 7th Coach tx exists for a Employee\r\nAND a user is logged in as a BOC\r\n\r\n",
    "custom_steps": "WHEN Remove as 7th Coach tx reaches a approved status\r\n\r\n\r\n",
    "custom_expected": "THEN BOC Approvers see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Selection to ML Rosterâ€￾ \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198843,
    "title": "As a BOC user I want to be able to supress a Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142274",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "GIVEN an Remove as 7th Coach tx exists for a Employee\r\nAND a user is logged in as a BOC\r\n\r\n",
    "custom_steps": "WHEN Remove as 7th Coach tx reaches a approved or Reverse status",
    "custom_expected": "THEN users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. Reverse is handled in a previous story so this story will only deal with the suppression. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\nAND Suppressing a transaction will also remove any notifications that were generated for the transaction prior to suppression.\r\nAND A blue notification should be thrown saying \"The transaction has been successfully suppressed\"",
    "custom_steps_separated": null
  },
  {
    "id": 1198844,
    "title": "As a user I want to edit an existing Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142272",
    "created_by": 103,
    "created_on": 1507234668,
    "updated_by": 103,
    "updated_on": 1507234668,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN an Remove as 7th Coach tx exists for a 7th coach\r\n",
    "custom_steps": "WHEN user opens the existing Remove as 7th Coach transaction\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN an Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state.\r\nAND Clicking Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND In Preliminary and Rejected, the Club and BOC users will be able to edit all portions displayed on the form. \r\nAND In states other than Preliminary or Rejected, edit only gives clubs access to attach new files. Club cannot edit existing attachments or any other part of transaction.\r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions.\r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND Clicking Save will always reload the form in View mode.\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198863,
    "title": "As a user I want to be able to view an existing Remove as 7th Coach transaction",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150896166",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234738,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND the user is in Employee Profile \r\nAND Employee has an existing Remove as 7th Coach transaction\r\n",
    "custom_steps": "WHEN the user clicks on Transaction on employee's History (or Advanced Search)",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_as_7th_coach",
    "custom_steps_separated": null
  },
  {
    "id": 1198864,
    "title": "Remove as 7th Coach - Editor permissions",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906102",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 178,
    "updated_on": 1561133309,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 15,
    "custom_preconds": "GIVEN BOC or Club admin account logs in",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have the following Editor permission\r\nBOC users with a Editor permission can*:\r\n - Can view and Print all employee transactions [Club and BOC] in all states for Employees.\r\n - Can create, delete, edit, and submit all employee transactions for Employees. \r\n - Can Approve, Reject, Reverse and Suppress all Employee transactions.\r\n\r\nClub users with a Editor permission can:\r\n- Club users with this role can view and print all minor league transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs to.\r\nHowever, there are exceptions:\r\n1. No Transactions that are in Suppressed state\r\n2. They cannot see \"BOC Notes\" field\r\n- Club users with this role Can view all APPROVED (no other states) minor league transactions including other club's Minor League transactions or BOC only transactions with the following exceptions:\r\n1. Cannot see BOC Notes field for any transaction\r\n2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAttached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n3. Can create, delete, submit, edit, attach files, and e-sign all Minor League transactions for Minor League players on their Org's roster or if they are the\"From Org\" or \"To Org\".",
    "custom_steps_separated": null
  },
  {
    "id": 1198865,
    "title": "Remove as 7th Coach - Viewer Permissions",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906101",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234738,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 16,
    "custom_preconds": "GIVEN BOC or club admin account logs in",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have the following Viewer permission\r\nBOC users with a Viewer permission can:\r\n - Can view and Print all employee transactions in all states but cannot make any changes or e-sign.\r\n - Can view all flags for all transactions and transaction attachments in all states.\r\n\r\nClub users with a Viewer permission can:\r\n - Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs to.\r\nHowever, there are exceptions:\r\n1. No Transactions that are in Suppressed state\r\n2. They cannot edit or change these transactions (Basic only)\r\n3. They cannot see \"BOC Notes\" field\r\n - Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n1.  Cannot see BOC Notes field for any transaction\r\n2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1198866,
    "title": "As a user I want to receive an error if I have future dated my placement date more than 1 day",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503072",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234738,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 17,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND Assignment date on an Assign as 7th Coach transaction is set 1 day after the current date",
    "custom_steps": "WHEN the user clicks on Submit",
    "custom_expected": "THEN system will check if the placement date is more than 1 day past the current date. If yes, display error. See Messages #18.\r\n\r\nSee Error Message #18: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198867,
    "title": "As a user I want to receive an error if I have back dated my placement date more than 10 days",
    "section_id": 143804,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503035",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234738,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 18,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND Assignment date on Assign 7th Coach transaction is set 10 or more days prior to the current date",
    "custom_steps": "WHEN the user clicks on Submit or Approve\r\n",
    "custom_expected": "THEN Clicking \"Submit\" or \"Approve\" (all places OnSubmit rules are fired) will check if the placement date is 10 or more days prior to the current date. If yes, display error. See Messages #2.",
    "custom_steps_separated": null
  },
  {
    "id": 1198868,
    "title": "As a user I want to be able to view an existing Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905578",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND the user is in Employee Profile\r\nAND the Employee has an existing Assign/Reassign Employee transaction",
    "custom_steps": "WHEN clicks on the transaction on employee's History (or Advanced Search)",
    "custom_expected": "THEN system will open the transaction in the same window.\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey.\r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_reassign_employee\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120635456",
    "custom_steps_separated": null
  },
  {
    "id": 1198869,
    "title": "Assign/Reassign Employee - Editor permissions",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906105",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC or Club admin account logs in",
    "custom_steps": "WHEN user is in employee widget",
    "custom_expected": "THEN they should have the following editor permission\r\nBOC users with a Viewer permission can:\r\n - Can view and Print all employee transactions [Club and BOC] in all states for Employees.\r\n - Can create, delete, edit, e-sign and submit all employee transactions for Employees. \r\n - Can Approve, Reject, Reverse and Suppress all Employee transactions.\r\n\r\nClub users with a Viewer permission can:\r\n - Club users with this role can view and print all minor league transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved player currently belongs to.\r\nHowever, there are exceptions:\r\n1. No Transactions that are in Suppressed state\r\n2. They cannot see \"BOC Notes\" field\r\n- Club users with this role Can view all APPROVED (no other states) minor league transactions including other club's Minor League transactions or BOC only transactions with the following exceptions:\r\n  1. Cannot see BOC Notes field for any transaction\r\n  2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the player involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAttached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n  3. Can create, delete, submit, edit, attach files, and e-sign all Minor League transactions for Minor League players on their Org's roster or if they are the\"From Org\" or \"To Org\".",
    "custom_steps_separated": null
  },
  {
    "id": 1198870,
    "title": "Assign/Reassign Employee - Viewer Permissions",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906103",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC or club Viewer account logs in",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have the following Viewer permission\r\nBOC users with a Viewer permission can*:\r\n - Can view and Print all employee transactions in all states but cannot make any changes or e-sign.\r\n - Can view all flags for all transactions and transaction attachments in all states.\r\n\r\nClub users with a Viewer permission can:\r\n  - Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs to.\r\nHowever, there are exceptions:\r\n1. No Transactions that are in Suppressed state\r\n2. They cannot edit or change these transactions (Basic only)\r\n3. They cannot see \"BOC Notes\" field\r\n - Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n1.  Cannot see BOC Notes field for any transaction\r\n2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1198871,
    "title": "As a user I want to be able to create a new Assign/Reassign transaction for a person",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142709",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC or club user logged in with Employee Transaction Permissions\r\nAND the user is in Employee Profile",
    "custom_steps": "WHEN the user clicks on \"Create New\" button on the Employee Profile",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown.\r\nAND Selecting \"Employee Transactions\" will display a secondary and tertiary dropdown.\r\nAND \"Assignments\" should be an option under the secondary dropdown. \r\nAND \"Assign/Reassign Employee\" should be an option in the third level dropdown when \"Assignments\" is selected.\r\nAND Selecting \"Assign/Reassign Employee\" from the Create New will check to see if there is an existing Preliminary transaction of the same type for the same employee created within 10 days of the current date. \r\nAND If a preliminary already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If no preliminary transaction created within the last 10 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND Transaction should follow the wireframe and data discovery. \r\n\r\n*Note that the editable fields differ for BOC and Club and based on Employee status*\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_reassign_employee",
    "custom_steps_separated": null
  },
  {
    "id": 1198872,
    "title": "As a user I want to be able to save a new Assign/Reassign Employee transaction for an employee",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142708",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile",
    "custom_steps": "WHEN the user opens a new Assign/Reassign Employee transaction in edit mode for an employee",
    "custom_expected": "THEN A Save button will be available anytime the form is in edit mode.\r\nAND Clicking Save will save the transaction and it's current values.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made.\r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOR If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nOR If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1198873,
    "title": "As a user I want to be able to delete an Assign/Reassign Employee transaction for an employee",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142707",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile \r\nAND Employee has an existing Assign/Reassign Employee transaction",
    "custom_steps": "WHEN the users opens a new Assign/Reassign Employee transaction in edit mode for an employee in Preliminary or Rejected states ",
    "custom_expected": "THEN the user will see a \"Delete\" button on the form in grey, in either view or edit mode.\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\nTitle: Warning\r\nBody: Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\nHint: This is a permanent action that cannot be undone.\r\nButtons: Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1198874,
    "title": "As a user I want to see new options in the Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151611194",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN BOC and club user is logged in with Employee Transaction Permissions\r\nAND the user is in Employee Profile\r\n\r\n",
    "custom_steps": "WHEN the user opens a new Assign/Reassign Employee transaction in edit mode for an employee",
    "custom_expected": "THEN if user is creating a new assign/reassign employee transaction then only the updated list of Employee positions should be available in the dropdown\r\nBUT if user is viewing an employee profile converted from EBIS1, then historical employee positions should still display\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_reassign_employee\r\n\r\nList of Current and Historical Positions:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+-+Positions\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198875,
    "title": "As a Club user I want to be prevented from initiating an Assign/Reassign transaction for an employee that does not belong to my Club",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142706",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permission and attempting to create Assign/Reassign transaction for an employee\r\nAND Employee's Current Org is different from logged in club user's Org",
    "custom_steps": "WHEN the user select \"Assign/Reassign Employee\" on the Employee Create New menu\r\n ",
    "custom_expected": "THEN system will check the employee's Current Org against the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nOR If the Org of the initiating user is not BOC or the Current Org of the employee, then display a blocking message. See Messages #1.\r\n\r\nSee Error Message #1: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198876,
    "title": "As a user I want to Submit an Assign/Reassign Employee to the BOC for approval",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142705",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "GIVEN a club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile\r\nAND Employee has an existing Assign/Reassign Employee transaction\r\nAND transaction is in Preliminary or Rejected status",
    "custom_steps": "WHEN the user clicks \"Submit\" button (Blue for club users and grey for the BOC)",
    "custom_expected": "THEN Clicking Submit will run a required field and formatting check, as well as all on Submit rules. Once the rule checks have been passed or overridden, the system will save the transaction and its current values.\r\nAND If the transaction is NOT for a MJ Roster employee, then the transaction will automatically move to \"Approved\", after passing all On Approve rules. All on approve updates are run per story #151142704.\r\nOR If the transaction IS for a MJ Roster employee, then the transaction status will be set to \"Submitted to BOC\".\r\nAND After a successful submission the system will display a successful submit blue notification. \r\nAND An approvals item will be generated for the BOC if the transaction has been moved to Submitted to BOC. \r\nAND If the transaction is for a MJ Roster employee, then the transaction is added to the Player's History in green font: Code =ASGEE Description = Assign/Reassign Employee to Roster as {Position}  , From Org/Club fields. Otherwise, no entry is added.",
    "custom_steps_separated": null
  },
  {
    "id": 1198877,
    "title": "As a user I want to approve an Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142704",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC approver is logged in \r\nAND an Assign/Reassign employee transaction has been submitted to the BOC \r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected status\r\nAND blue \"Approve\" button is available (in view or edit mode)",
    "custom_steps": "WHEN BOC approver clicks on \"Approve\"",
    "custom_expected": "THAN Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND If applicable, the BOC approvals item is removed.\r\nAND A successful blue notification is displayed that states the transaction was approved.\r\nAND If applicable, update Player's Player History: Code =ASGEE Description = Assign/Reassign Employee as {Position} , From Org/Club fields in black font. \r\nAND All other \"Approval\" updates per the provided business rules.",
    "custom_steps_separated": null
  },
  {
    "id": 1198878,
    "title": "As a user I want the approval of an assign/reassign transaction to convert a player into an employee, if relevant",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151309872",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC approver is logged in \r\nAND an Assign/Reassign employee transaction of a player submitted to the BOC done via a professional player profile\r\n",
    "custom_steps": "WHEN the user click on \"Approve\" button",
    "custom_expected": "THEN system should convert the player into an employee.  \r\nAND The player's Roster Status should be maintained.",
    "custom_steps_separated": null
  },
  {
    "id": 1198879,
    "title": "As a user I want the approval of an assign/reassign transaction to convert a domestic amateur player into an employee, if relevant",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151419401",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "GIVEN BOC approver is logged in \r\nAND an Assign/Reassign employee transaction of a domestic amateur player submitted to the BOC done via a domestic amateur player profile\r\n",
    "custom_steps": "WHEN the user click on \"Approve\" button",
    "custom_expected": "THEN system should convert the player into an employee.  \r\nAND The employee should have a Scouting/Drafts tab as well as Info, History, Contract History.\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\n\r\nEmployee Profile Wires: \r\nhttp://hri2kq.axshare.com/#p=employee_profile_-_past_player",
    "custom_steps_separated": null
  },
  {
    "id": 1198880,
    "title": "As a user I want the approval of an assign/reassign transaction to convert an international amateur player into an employee, if relevant",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151419485",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN an assign/reassign employee transaction is being done via an international amateur player profile\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user approves the transaction\r\n\r\n\r\n",
    "custom_expected": "THEN system should convert the player into an employee.  \r\nAND the employee should have an International tab and Scouting/Drafts tab as well as Info, History, Contract History.\r\n\r\n\r\nEmployee Profile Wires: \r\nhttp://hri2kq.axshare.com/#p=employee_profile_-_past_player",
    "custom_steps_separated": null
  },
  {
    "id": 1198881,
    "title": "As a BOC user I want to reject an Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142703",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "GIVEN an Assign/Reassign Employee transaction has been submitted to BOC\r\nAND grey \"Reject\" button is available (in view or edit mode)",
    "custom_steps": "WHEN BOC user clicks \"Reject\"\r\n\r\n\r\n",
    "custom_expected": "THEN BOC users with edit permissions see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in a Submitted to BOC state. \r\nAND Clicking \"Reject\" will run all required field, and formatting checks and display any relevant error or warning messages. \r\nAND The transaction status is updated to \"Rejected\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was rejected.\r\nAND The item is removed from the player's history. \r\nAND The Approvals item is removed for the BOC.",
    "custom_steps_separated": null
  },
  {
    "id": 1198882,
    "title": "As a BOC user I want to be able to reverse an Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142702",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 15,
    "custom_preconds": "GIVEN an Assign/Reassign Employee transaction exists for a Employee\r\nAND a user is logged in as a BOC",
    "custom_steps": "WHEN Assign/Reassign Employee transaction reaches a approved status\r\n\r\n\r\n",
    "custom_expected": "THEN BOC Approvers see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Selection to ML Rosterâ€￾ \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198883,
    "title": "As a BOC user I want to be able to supress an Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": null,
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 16,
    "custom_preconds": "GIVEN an Assign/Reassign Employee transaction exists for a Employee\r\nAND a user is logged in as a BOC",
    "custom_steps": "WHEN Assign/Reassign Employee transaction reaches a approved or Reverse status",
    "custom_expected": "THEN users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. Reverse is handled in a previous story so this story will only deal with the suppression. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\nAND Suppressing a transaction will also remove any notifications that were generated for the transaction prior to suppression.\r\nAND A blue notification should be thrown saying \"The transaction has been successfully suppressed\"",
    "custom_steps_separated": null
  },
  {
    "id": 1198884,
    "title": "As a Club user I want to receive a notification when an Assign/Reassign Employee is rejected, approved or reversed",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142701",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 17,
    "custom_preconds": "GIVEN an Assign/Reassign Employee tx exists for a Employee\r\nAND a user is logged in as a club\r\n\r\n",
    "custom_steps": "WHEN Assign/Reassign Employee tx reaches a rejected, approved or reversed status",
    "custom_expected": "THEN a notification will appear on the notification clipboard\r\nAND Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Approved. \r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Rejected.\r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Player's name will be a hyperlink.\r\nAND Clicking on the player's name hyperlink of any of these notifications will open the player's profile in view mode in the same window/tab on the Player History tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1198885,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a transaction with an assignment date after the current date",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142699",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 18,
    "custom_preconds": "GIVEN BOC approver initiated an Assign/Reassign Employee Transaction\r\nAND Assignment date on the Assign/Reassign Employee Transaction is set after the current date",
    "custom_steps": "WHEN user clicks on Approve\r\n\r\n",
    "custom_expected": "THEN system will check if the current date is after the assignment date entered on the transaction. If yes, display an error. See Messages #9.",
    "custom_steps_separated": null
  },
  {
    "id": 1198886,
    "title": "As a user I want to edit an existing Assign/Reassign Employee transaction",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142700",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 19,
    "custom_preconds": "GIVEN an Assign/Reassign Employee transaction exists for an employee\r\n\r\n",
    "custom_steps": "WHEN user opens the existing Assign/Reassign Employee transaction\r\n\r\n",
    "custom_expected": "THEN an Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state.\r\nAND Clicking Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND In Preliminary, the Club and BOC users will be able to edit all portions displayed on the form. \r\nAND In states other than Preliminary, edit only gives clubs access to attach new files. Club cannot edit existing attachments or any other part of transaction.\r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions.\r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND  Clicking Save will always reload the form in View mode.\r\n\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_reassign_employee",
    "custom_steps_separated": null
  },
  {
    "id": 1198887,
    "title": "As a Club user I want to be prevented from initiating an Assign/Reassign transaction for a person that is not a current Employee",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142697",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 20,
    "custom_preconds": "GIVEN club user initiating an Assign/Reassign transaction for an employee with the following status\r\n  - Active\r\n  - Suspended\r\n  - Temporarily Inactive\r\n  - Disqualified\r\n  - Ineligible\r\n",
    "custom_steps": "WHEN user selects \"Assign/Reassign Employee\" on the Employee Create New menu\r\n\r\n",
    "custom_expected": "THEN system will check if the person has a current Employee Roster status of: \r\n  - Active\r\n  - Suspended\r\n  - Temporarily Inactive\r\n  - Disqualified\r\n  - Ineligible\r\nAND If not, and the initiating user is a Club user, then display a blocking message. See Messages #17. \r\nAND If not, and the initiating user is a BOC user, proceed with the transaction.",
    "custom_steps_separated": null
  },
  {
    "id": 1198888,
    "title": "As a user I want to receive an error if I have future dated my placement date more than 1 day",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503073",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 21,
    "custom_preconds": "GIVEN the user future dated the placement date more than 1 day on Assign/Reassign Employee transaction",
    "custom_steps": "WHEN Clicking \"Submit\" ONLY (not approve)\r\n\r\n",
    "custom_expected": "THEN system will check if the placement date is more than 1 day past the current date. If yes, display error. See Messages #18.",
    "custom_steps_separated": null
  },
  {
    "id": 1198889,
    "title": "As a user I want to receive an error if I have back dated my placement date more than 10 days",
    "section_id": 143807,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503036",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 22,
    "custom_preconds": "GIVEN the user back dated the placement date more than 10 days on Assign/Reassign Employee transaction\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN click \"Submit\" or \"Approve\"",
    "custom_expected": "THEN system will check if the placement date is 10 or more days prior to the current date. If yes, display error. See Messages #2.",
    "custom_steps_separated": null
  },
  {
    "id": 1198890,
    "title": "As a user I want to be able to view an existing Remove Employee from Org transaction",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150905576",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND the user is in the Employee Profile\r\nAND Employee has an existing Remove Employee from Org transaction",
    "custom_steps": "When the user click on Transaction on employee's History (or Advanced Search) ",
    "custom_expected": "THEN system will open the transaction in the same window.\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey.\r\nAND Clicking \"Close\" will return the user to their entry point into the transaction.\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_employee_from_org\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Remove+Employee+from+Org\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198891,
    "title": "Remove Employee from Org - Editor permissions",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906099",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC or Club admin account logs in",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have the following Editor permission \r\nBOC users with a Editor permission can:\r\n - Can view and Print all employee transactions [Club and BOC] in all states for Employees.\r\n - Can create, delete, edit, e-sign and submit all employee transactions for Employees. \r\n - Can Approve, Reject, Reverse and Suppress all Employee transactions.\r\n\r\nClub users with a Editor permission can:\r\n - Club users with this role can view and print all minor league transactions in all states when the logged \r\n    in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated \r\n    the transaction. It also does not matter which Org the involved player currently belongs to.\r\n    However, there are exceptions:\r\n    1. No Transactions that are in Suppressed state\r\n    2. They cannot see \"BOC Notes\" field\r\n - Club users with this role Can view all APPROVED (no other states) minor league transactions including \r\n    other club's Minor League transactions or BOC only transactions with the following exceptions:\r\n    1. Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To \r\n    Org. Note that even if the player involved is currently part of their Org, they still cannot see the \r\n    comments field unless they are the From Org or To Org\r\n    Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n    3. Can create, delete, submit, edit, attach files, and e-sign all Minor League transactions for Minor \r\n    League players on their Org's roster or if they are the\"From Org\" or \"To Org\".",
    "custom_steps_separated": null
  },
  {
    "id": 1198892,
    "title": "Remove Employee from Org - Viewer Permissions",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "150906098",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC or Club viewer account logs in",
    "custom_steps": "WHEN the user is in employee widget",
    "custom_expected": "THEN they should have following Viewer permission\r\n BOC users with a Viewer permission can:\r\n  - Can view and Print all employee transactions in all states but cannot make any changes or e-sign.\r\n  - Can view all flags for all transactions and transaction attachments in all states.\r\n\r\nClub users with a Viewer permission can:\r\n - Club users with this role can view and print all employee transactions in all states when the logged in \r\n    Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated \r\n    the transaction. It also does not matter which Org the involved employee currently belongs to.\r\nHowever, there are exceptions:\r\n1. No Transactions that are in Suppressed state\r\n2. They cannot edit or change these transactions (Basic only)\r\n3. They cannot see \"BOC Notes\" field\r\n- Club users with this role Can view all APPROVED (no other states) employee transactions including \r\n   other club's employee transactions or BOC only transactions with the following exceptions:\r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To \r\n    Org. Note that even if the employee involved is currently part of their Org, they still cannot see the \r\n    comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1198893,
    "title": "As a user I want to be able to create a new Remove Employee from Org transaction for an employee",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142734",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND the user is in the Employee Profile ",
    "custom_steps": "WHEN the user clicks on \"Create New\" button on the Employee Profile",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown.\r\nAND Selecting \"Employee Transactions\" will display a secondary and tertiary dropdown.\r\nAND \"Assignments\" should be an option under the secondary dropdown. \r\nAND \"Remove Employee from Org\" should be an option in the third level dropdown when \"Assignments\" is selected.\r\nAND Selecting \"Remove Employee from Org\" from the Create New will check to see if there is an existing Preliminary transaction of the same type for the same employee created within 10 days of the current date. \r\nAND If a preliminary already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If no preliminary transaction created within the last 10 days already exists, then the system will load a new Preliminary transaction in edit mode. \r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_employee_from_org",
    "custom_steps_separated": null
  },
  {
    "id": 1198894,
    "title": "As a user I want to be able to save a new Remove Employee from Org transaction for an employee",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142733",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile \r\n",
    "custom_steps": "WHEN user opens a new Remove Employee from Org transaction in edit mode for an employee",
    "custom_expected": "THEN A Save button will be available anytime the form is in edit mode.\r\nAND Clicking Save will save the transaction and it's current values.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.\r\nAND After a successful save the system will display a successful save blue notification.\r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey.\r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made.\r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOR If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded in the default mode (view/edit) for the current transaction state, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nOR If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.\r\n\r\nSee Wireframe: \r\nhttp://hri2kq.axshare.com/#p=remove_employee_from_org",
    "custom_steps_separated": null
  },
  {
    "id": 1198895,
    "title": "As a user I want to be able to delete a Remove Employee from Org transaction for an employee",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142732",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN BOC or Club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile \r\nAND Employee has an existing Remove Employee transaction",
    "custom_steps": "WHEN the user opens a new Remove Employee from Org transaction in edit mode for an employee in Preliminary or Rejected states",
    "custom_expected": "THEN user should see a \"Delete\" button on the form in grey, in either view or edit mode.\r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\nTitle: Warning\r\nBody: Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\nHint: This is a permanent action that cannot be undone.\r\nButtons: Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1198896,
    "title": "As a Club user I want to be prevented from initiating a Remove Employee from Org transaction for an employee that does not belong to my Club",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142731",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permission and attempting to create a Remove Employee from Org transaction for an employee\r\nAND Employee's Current Org is different from logged in club user's Org\r\nAND the user is in Employee Profile",
    "custom_steps": "WHEN the user selects \"Remove Employee from Org\" on the Employee Create New menu",
    "custom_expected": "THEN system should check the employee's Current Org against the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nOR If the Org of the initiating user is not BOC or the Current Org of the employee, then display a blocking message. See Messages #1.\r\n\r\nSee Error Message #1: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198897,
    "title": "As a BOC user I want to be able to reverse a Remove Employee from Org transaction",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142726",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "GIVEN BOC Approvers user is logged in\r\nAND the user is in the Employee Profile  \r\nAND Remove Employee from Org transaction has been approved for a player",
    "custom_steps": "WHEN BOC Approves is on Remove Employee from Org transaction in view or Edit mode \r\n",
    "custom_expected": "THEN BOC Approvers will see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND A blue Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with \"Voided:\" in front of the transaction description. Example:” Voided: Selection to ML Roster”\r\n\r\nSee Reverse Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/4.+Remove+Employee+from+Org",
    "custom_steps_separated": null
  },
  {
    "id": 1198898,
    "title": "As a user I want to edit an existing Remove Employee from Org transaction",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142724",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND the user is in the Employee Profile \r\nAND Employee has an existing Remove Employee from Org transaction",
    "custom_steps": "WHEN the user opens an existing Remove Employee from Org transaction",
    "custom_expected": "THEN An Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state.\r\nAND Clicking Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode).\r\nAND In Preliminary, the Club and BOC users will be able to edit all portions displayed on the form. \r\nOR In states other than Preliminary, edit only gives clubs access to attach new files. Club cannot edit existing attachments or any other part of transaction.\r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions.\r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND Clicking Save will always reload the form in View mode.",
    "custom_steps_separated": null
  },
  {
    "id": 1198899,
    "title": "As a user I want to be prevented from initiating a Remove Employee from Org transaction for a person that is not an active employee",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142722",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions \r\nAND user is on an Employee Profile for employee who has one of the following Employee Roster Status: \r\n- Active\r\n- Suspended \r\n- Temporarily inactive \r\n- Ineligible \r\n- Disqualified ",
    "custom_steps": "WHEN the user selects \"Remove Employee from Org transaction\" on the employee Create New menu",
    "custom_expected": "THEN system will check if the employee has the Employee Roster Status of: \r\n- Active\r\n- Suspended \r\n- Temporarily inactive \r\n- Ineligible \r\n- Disqualified \r\nAND If not, then display a blocking message. See Messages #12.\r\n\r\nSee Error Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198900,
    "title": "As a BOC user I want to approve a Remove Employee from Org transaction",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142728",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC approver user is logged in\r\nAND a Remove Employee from Org transaction has been submitted to the BOC \r\nAND transaction is in Preliminary, Submitted to BOC, or Rejected status\r\nAND blue \"Approve\" button is available (in view or edit mode)",
    "custom_steps": "WHEN BOC user clicks on \"Approve\"",
    "custom_expected": "THEN Clicking \"Approve\" will run all required field, formatting, On Submit and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND If applicable, the BOC approvals item is removed.\r\nAND A successful blue notification is displayed that states the transaction was approved.\r\nAND Update Player's Player History: Code =RELEE Description = Remove Employee from Org , From Org/Club fields in black font. \r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198901,
    "title": "As a Club user I want to receive a notification when a Remove Employee from Org is rejected, approved or reversed",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142725",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "GIVEN a club user is logged in with Employee Transaction Permissions\r\nAND a Remove Employee from Org Transaction exists for an employee \r\n ",
    "custom_steps": "WHEN Remove Employee from Org Transaction reaches a rejected, approved or reversed status",
    "custom_expected": "THEN a notification will appear in the notification clipboard\r\nAND Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Approved. \r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Rejected.\r\nOR Initiating Club (or the Club that the player belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Player's name will be a hyperlink.\r\nAND Clicking on the player's name hyperlink of any of these notifications will open the player's profile in view mode in the same window/tab on the Player History tab.",
    "custom_steps_separated": null
  },
  {
    "id": 1198902,
    "title": "As a user I want to receive an error if I'm attempting to approve a transaction with an assignment date after the current date",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142723",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN BOC approver logged in\r\nAND Assignment date on the Remove Employee from Org transaction is set after the current date",
    "custom_steps": "WHEN the user clicks on \"Approve\"",
    "custom_expected": "THEN system will check if the current date is after the assignment date entered on the transaction. If yes, display an error. See Messages #9.\r\n\r\nSee Error Message #9:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1198903,
    "title": "As a user I want to Submit a Remove Employee from Org to the BOC for approval",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142730",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "GIVEN a club user is logged in with Employee Transaction Permissions \r\nAND the user is in the Employee Profile\r\nAND Employee has an existing Remove Employee from Org transaction\r\nAND transaction is in Preliminary or Rejected status\r\n",
    "custom_steps": "WHEN the user clicks ''Submit\" button (Blue for club users and grey for the BOC)",
    "custom_expected": "THEN Clicking Submit will run a required field and formatting check, as well as all on Submit rules. Once the rule checks have been passed or overridden, the system will save the transaction and its current values.\r\nAND If the transaction is NOT for a MJ Roster employee, then the transaction will automatically move to \"Approved\", after passing all On Approve rules. All on approve updates are run per story #151142728.\r\nOR If the transaction is for a MJ Roster employee, then the transaction status will be set to \"Submitted to BOC\".\r\nAND After a successful submission the system will display a successful submit blue notification. \r\nAND An approvals item will be generated for the BOC if the transaction has been moved to Submitted to BOC. \r\nAND If the transaction is for a MJ Roster employee, then the transaction is added to the Player's History in green font: Code =RELEE Description = Remove Employee From Org , From Org/Club fields. Otherwise, no entry is added.",
    "custom_steps_separated": null
  },
  {
    "id": 1198904,
    "title": "As a BOC user I want to reject a Remove Employee from Org transaction",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151142727",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 15,
    "custom_preconds": "GIVEN a BOC user logged in with edit permissions\r\nAND Remove Employee from Org transaction has been submitted to BOC\r\nAND Grey \"Reject\" button is available (in view or edit mode)\r\n",
    "custom_steps": "When BOC user clicks \"Reject\"",
    "custom_expected": "THEN BOC users with edit permissions see a \"Reject\" button in grey when they are viewing a transaction (in view or edit mode) in a Submitted to BOC state. \r\nAND Clicking \"Reject\" will run all required field, and formatting checks and display any relevant error or warning messages. \r\nAND The transaction status is updated to \"Rejected\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was rejected.\r\nAND The item is removed from the player's history. \r\nAND The Approvals item is removed for the BOC.",
    "custom_steps_separated": null
  },
  {
    "id": 1198905,
    "title": "As a user I want to receive an error if I have back dated my placement date more than 10 days",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151502995",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 16,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND Assignment date on Remove Employee from Org transaction is set more than 10 days prior to the current date\r\n",
    "custom_steps": "WHEN user clicks on Submit or Approve",
    "custom_expected": "THEN Clicking \"Submit\" or \"Approve\" (all places OnSubmit rules are fired) will check if the placement date is 10 or more days prior to the current date. If yes, display error. See Messages #2.\r\n\r\nSee Error Message #2: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1198906,
    "title": "As a user I want to receive an error if I have future dated my placement date more than 1 day",
    "section_id": 143808,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151503056",
    "created_by": 103,
    "created_on": 1507234715,
    "updated_by": 103,
    "updated_on": 1507234715,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 17,
    "custom_preconds": "GIVEN BOC or club user is logged in with Employee Transaction Permissions\r\nAND Assignment date on the Remove Employee from Org transaction is set 1 day after the current date",
    "custom_steps": "WHEN the user clicks on Submit",
    "custom_expected": "THEN system will check if the placement date is more than 1 day past the current date. If yes, display error. See Messages #18.\r\n\r\nSee Error Message #18: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214116,
    "title": "As a user I want to see new options in the Assign/Reassign Employee transaction",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151611194",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and club user is logged in with Employee Transaction Permissions\r\nAND the user is in Employee Profile\r\n\r\n",
    "custom_steps": "WHEN the user opens a new Assign/Reassign Employee transaction in edit mode for an employee",
    "custom_expected": "THEN if user is creating a new assign/reassign employee transaction then only the updated list of Employee positions should be available in the dropdown\r\nBUT if user is viewing an employee profile converted from EBIS1, then historical employee positions should still display\r\n\r\nWireframe: \r\nhttp://hri2kq.axshare.com/#p=assign_reassign_employee\r\n\r\nList of Current and Historical Positions:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+-+Positions\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214117,
    "title": "As a user I want the approval of an assign/reassign transaction to convert a domestic amateur player into an employee, if relevant",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151419401",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC approver is logged in \r\nAND an Assign/Reassign employee transaction of a domestic amateur player submitted to the BOC done via a domestic amateur player profile\r\n",
    "custom_steps": "WHEN the user click on \"Approve\" button",
    "custom_expected": "THEN system should convert the player into an employee.  \r\nAND The employee should have a Scouting/Drafts tab as well as Info, History, Contract History.\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\n\r\nEmployee Profile Wires: \r\nhttp://hri2kq.axshare.com/#p=employee_profile_-_past_player",
    "custom_steps_separated": null
  },
  {
    "id": 1214118,
    "title": "As a user I want the approval of an assign/reassign transaction to convert an international amateur player into an employee, if relevant",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151419485",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN an assign/reassign employee transaction is being done via an international amateur player profile\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN user approves the transaction\r\n\r\n\r\n",
    "custom_expected": "THEN system should convert the player into an employee.  \r\nAND the employee should have an International tab and Scouting/Drafts tab as well as Info, History, Contract History.\r\n\r\n\r\nEmployee Profile Wires: \r\nhttp://hri2kq.axshare.com/#p=employee_profile_-_past_player",
    "custom_steps_separated": null
  },
  {
    "id": 1214119,
    "title": "As a user I want to be able to select \"blank\" as a valid choice for \"Level\"",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152761407",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN a club or BOC user is logged in with Employee Transaction Permissions \r\nAND user is creating Assign/Reassign employee transaction",
    "custom_steps": "When the user clicks Level dropdown selection ",
    "custom_expected": "THEN there is a blank dropdown option that is acceptable to select (passes the required field check). The user should have to actively select this choice (not just use the default blank option). \r\nAND On UECs, there is a blank dropdown option that is acceptable to select (passes the required field check). The user should have to actively select this choice (not just use the default blank option). \r\nAND These should update the employee profiles properly, and properly be reflected in any relevant widgets and reports, and should not cause issues with follow up transactions (Like Remove from Org).",
    "custom_steps_separated": null
  },
  {
    "id": 1214120,
    "title": "As a user I want to receive an error if this assignment will result in the assigning Org to have more than one MJ Conditioning Coaches",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152156222",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "Business Rule #1.11: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nError Message #16: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with submit or approve permissions for Assign/Reassign Employee tx\r\nAND club user is attempting to submit an Assign/Reassign tx\r\nOR BOC user is attempting to submit or approve an Assign/Reassign tx\r\nAND Level/Employee Position chosen on the form is MJ Strength & Conditioning Coach or MJ Strength and Conditioning Assistant Coach\r\nAND the Org the assign/reassign transaction is for already has at least 1 current employee with a position of MJ Strength & Conditioning Coach or MJ Strength & Conditioning Assistant Coach",
    "custom_steps": "WHEN User clicks \"Submit\" or \"Approve\"(BOC Only) (all places OnSubmit rules are fired) ",
    "custom_expected": "THEN system should display error Messages #16:\r\n**\"This assignment will bring the number of conditioning coaches with the club over the limit of 1\"**\r\nAND Ignore and Continue button should be available and if clicked should Ignore the error and continue with the submission/approval of the tx\r\nAND Back button should be available and if clicked should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214121,
    "title": "As a user I want to receive an error if this assignment will result in the assigning Org to have more than two MJ Trainers",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152156224",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "Business Rule #1.10: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nError Message #15: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with submit/approve permissions for Assign/Reassign Employee tx\r\nAND club user is attempting to submit Assign/Reassign tx\r\nOR BOC user is attempting to submit/approve Assign/Reassign tx\r\nAND Level/Employee Position chosen on the form is MJ Trainer\r\nAND the Org the assign/reassign transaction is for already has at least 2 current employees with a position of MJ Trainer",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"(BOC Only) (all places OnSubmit rules are fired) \r\n",
    "custom_expected": "THEN system should  display error Messages #15:\r\n**\"This assignment will bring the number of trainers with the club over the limit of 2\"**\r\nAND Ignore and Continue button should be available and if clicked should Ignore the error and continue with the submission/approval of the tx\r\nAND Back button should be available and if clicked should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214122,
    "title": "As a user I want to receive an error if this assignment will result in the assigning Org to have more than 6 MJ Coaches",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152156225",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "Business Rule #1.09: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nError Message #14: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with submit or approve permissions for Assign/Reassign Employee tx\r\nAND club user is attempting to submit an Assign/Reassign tx\r\nOR BOC user is attempting to submit or approve an Assign/Reassign tx\r\nAND Level/Employee Position chosen on the form is one of the following MJ positions: pitching coach, hitting coach, 1B coach, 3B coach, bench coach, or bullpen coach\r\nAND the Org the assign/reassign transaction is for already has at least 6 current employees with a MJ position of pitching coach, hitting coach, 1B coach, 3B coach, bench coach, or bullpen coach",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"(BOC Only) (all places OnSubmit rules are fired)\r\n",
    "custom_expected": "THEN system should display error Messages #14:\r\n**\"This assignment will bring the number of coaches with the club over the limit of 6\"**\r\nAND Ignore and Continue button should be available(For BOC Only) and if clicked should Ignore the error and continue with the submission/approval of the tx\r\nAND Back button should be available and if clicked should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214123,
    "title": "As a user I want to receive an error if this assignment will result in the assigning Org to have more than one MJ Manager",
    "section_id": 145939,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152156227",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "Business Rule #1.08: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nError Message #13: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with submit or approve permissions for Assign/Reassign Employee tx\r\nAND club user is attempting to submit an Assign/Reassign tx\r\nOR BOC user is attempting to submit or approve an Assign/Reassign tx\r\nAND Level/Employee Position chosen on the form is MJ level Manager\r\nAND the Org the Assign/Reassign transaction is for already has at least one MJ Manager",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\"(BOC Only) (all places OnSubmit rules are fired) \r\n",
    "custom_expected": "THEN system should  display error Messages #13:\r\n**\"This assignment will bring the number of managers with the club over the limit of 1\"**\r\nAND Ignore and Continue button should be available (For BOC Only) and if clicked should Ignore the error and continue with the submission/approval of the tx\r\nAND Back button should be available and if clicked should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214124,
    "title": "As a user I want to edit an existing Place on Ineligible List transaction for a Employee",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534249",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN the users are viewing an an existing Place on Ineligible List transaction for an Employee\r\n\r\n",
    "custom_expected": "THEN An Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \r\nAND Clicking  Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode). \r\nAND  In Preliminary state, the BOC users will be able to edit all portions displayed on the form. \r\nAND Club cannot edit existing attachments or any other part of transaction.\r\nAND BOC is able to edit all fields in all states except for Approved and Reversed transactions. \r\nAND In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\r\nAND A Save button will be available anytime the form is in edit mode. \r\nAND Clicking Save will save the transaction and it's current values and reload the form in View mode.\r\nAND Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \r\nAND After a successful save the system will display a successful save blue notification. \r\nAND Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \r\nAND Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \r\nAND If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \r\nAND If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected.\r\nOR If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Ineligible+List",
    "custom_steps_separated": null
  },
  {
    "id": 1214125,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Ineligible List transaction with an assignment date after the current date",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534251",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC approver logs in with Employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN user attempting to approve a Place on Ineligible List transaction with an assignment date after the current date",
    "custom_expected": "THEN system will check if the assignment date entered on the transaction is after the current date. If yes, then show Message #9.\r\n\r\nSee Business Rule #8.08: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #9: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214126,
    "title": "As a user I want to receive an error if the employee I am creating a Place on Ineligible List transaction for has a pending or approved transaction after the entered assignment date",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534253",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC user logs in with Employee transaction permission\r\nAND an employee has an existing Pending or Approved Place on Ineligible List transaction after the entered assignment date on the new Place on Ineligible List transaction \r\n\r\n",
    "custom_steps": "WHEN user clicks on Approve on new Place on Ineligible List transaction\r\n\r\n",
    "custom_expected": "THEN all places OnSubmit rules are fired\r\nAND system will check if the Assignment date is before the latest approved or pending (Pending to Club, Submitted to BOC) transaction date for the player. If it is, an error will display. See Messages #3.\r\n\r\nSee Business Rule #8.06: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #3: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214127,
    "title": "As a user I want to be able to delete a Place on Ineligible List transaction",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534248",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN user is logged in with Employee Transaction Permissions\r\n",
    "custom_steps": "\r\nWHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in Preliminary or Rejected states",
    "custom_expected": "THEN Users that have edit permissions for the form in Preliminary and Rejected states will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1214128,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Place on Ineligible List transaction",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534250",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions\r\n\r\n",
    "custom_steps": "WHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in the Approved state\r\n\r\n\r\n\r\n",
    "custom_expected": "THEN BOC Approvers see a \"Reverse\" button in grey \r\nAND Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \r\nAND Successful reverse notification will be displayed. \r\nAND The transaction status is updated to \"Reversed\"\r\nAND Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Major/Minor Outrightâ€￾\r\nAND Set all of the employee's fields to what they were prior to the transaction being approved.\r\nAND Users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \r\nAND Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \r\nAND Clicking \"Suppress\" will suppress the transaction.\r\nAND When a transaction is suppressed it will be hidden from the History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\r\nAND Clicking \"Reverse\" or \"Reverse and Suppress\", will check if the current transaction is the most recent approved transaction. \r\nAND If the transaction is not the most recent approved transaction for the employee, then the user will receive an error message. \r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND User will ONLY have the back option. Clicking Back will close the modal and return the user to the transaction.\r\n\r\nSee Reverse/Suppress Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List",
    "custom_steps_separated": null
  },
  {
    "id": 1214129,
    "title": "As a BOC user I want to be able to create a new Place on Ineligible List transaction for an Employee",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534231",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN the BOC user logs in with proper permission\r\n\r\n",
    "custom_steps": "WHEN the user clicks on \"Create New\" button on the Employee Profile\r\n\r\n",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown (already built)\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Place on Ineligible List\" should be an option in the third level dropdown.\r\nAND Selecting \"Place on Ineligible List\" from the Create New will check to see if there is an existing Preliminary Place on Ineligible List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If no preliminary transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Ineligible+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_ineligible_list",
    "custom_steps_separated": null
  },
  {
    "id": 1214130,
    "title": "As a user I want to view an existing Place on Ineligible List transaction",
    "section_id": 145940,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534255",
    "created_by": 103,
    "created_on": 1513283505,
    "updated_by": 103,
    "updated_on": 1513283505,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction permission\r\nAND Place on Ineligible List transaction already exist\r\n\r\n\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in an employee's History or Advanced Search",
    "custom_expected": "THEN system will open the transaction in the same window\r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC:The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Ineligible+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_ineligible_list",
    "custom_steps_separated": null
  },
  {
    "id": 1214131,
    "title": "As a user I want submitting a UEC to auto-create an Assign/Reassign transaction for the employee",
    "section_id": 145941,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152357814",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN a club and BOC user is logged with edit employee contract permissions \r\nAND user is submitting a employee contract",
    "custom_steps": "When user clicks \"Submit\" button",
    "custom_expected": "THEN If the employee's current position does not match that contained in the UEC, then an Assign/Reassign Transaction is auto-created and submitted by the system for the position contained on the UEC.\r\nAND When a UEC is moved to a submit signed state, an Assign/Reassign Employee transaction is auto-created and submitted for the employee for the position indicated on the UEC. \r\nAND All stateflow changes and submission/approval updates should follow the Assign/Reassign rules as though it were created manually.",
    "custom_steps_separated": null
  },
  {
    "id": 1214132,
    "title": "As a user I want approving an assign/reassign to update the player's status to the appropriate status based on their UEC",
    "section_id": 145941,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "151611527",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\nGIVEN a user is logged in as BOC approver\r\nAND an Assign/Reassign Employee tx has been submitted to BOC for approval\r\n",
    "custom_steps": "WHEN BOC approver Approves the Assign/Reassign tx",
    "custom_expected": "THEN system should assign the employee's roster status based on the status of the contract\r\nAND if the employee has a current Approved or Submit Signed UEC, then the roster status should be set to \"Active\"\r\nBUT if the employee does not have a current Approved or Submit Signed UEC, then the roster status should be set to \"Active, Not Under Contract\"",
    "custom_steps_separated": null
  },
  {
    "id": 1214133,
    "title": "As a user I want changing the employee's position to auto-create an assign/reassign transaction for the employee",
    "section_id": 145941,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152456872",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN a club and BOC user is logged with edit employee contract permissions \r\nAND user is viewing a employee contract in Approved or Submit Signed state\r\n ",
    "custom_steps": "When user clicks \"Change Position\"",
    "custom_expected": "THEN system will enable the position fields for editing. \r\nAND On Save, if the Change Position action has been taken, the system should check if the employee's current position differs from the new position on the UEC.\r\nAND If yes, then an Assign/Reassign Employee transaction is auto-created and submitted for the employee for the position indicated on the UEC. \r\nAND All stateflow changes and submission/approval updates should follow the Assign/Reassign rules as though it were created manually.\r\n\r\nWireframe (scroll down and to the right):\r\nhttps://hri2kq.axshare.com/#p=info_and_general_layout\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/pages/viewpage.action?pageId=120636039\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214134,
    "title": "As a user I want to be able to create a new Place on Temporarily Inactive List transaction for an employee",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535073",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nWireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_temporary_inactive_list\r\nGIVEN a club or BOC user is logged in with Create New Permissions for Temp Inactive list tx",
    "custom_steps": "WHEN user navigates to an Employee Profile\r\nAND selects Create New",
    "custom_expected": "THEN \"Employee Transactions\" should be an option in the top-level dropdown\r\nAND \"Inactive List\" should be an option under Employee Transactions\r\nAND \"Place on Temporarily Inactive List\" should be an option in the third level dropdown\r\nAND selecting \"Place on Temporarily Inactive List\" from the Create New should check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Place on Temporarily Inactive List transaction for the same employee created within 10 days of the current date\r\nAND if a preliminary or rejected transaction already exists, the system should load the existing transaction in Edit Mode instead of opening a new transaction\r\nAND if a submitted transaction already exists, the system should load the existing transaction in View Mode\r\nBUT if no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system should load a new Preliminary transaction\r\nAND transaction should follow the wireframe and data discovery",
    "custom_steps_separated": null
  },
  {
    "id": 1214135,
    "title": "As a user I want to be able to delete a Place on Temporarily Inactive List transaction",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535010",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN a user with edit permissions for the transaction is logged in\r\nAND transaction is in Preliminary or Rejected state",
    "custom_steps": "WHEN user opens the form in view or edit mode",
    "custom_expected": "THEN user should see a \"Delete\" button on the form in grey\r\nAND clicking \"Delete\" should prompt the user to confirm that they wish to delete the form from the system\r\nAND warning should be as follows:\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND if they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown\r\nBUT if they do not confirm the deletion, then they should be returned to the form and no action should be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1214136,
    "title": "As a user I want to view an existing Place on Temporarily Inactive List transaction",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535019",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nWireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_temporary_inactive_list\r\nGIVEN a club or BOC user is logged in with view permissions for Temp Inactive List tx",
    "custom_steps": "WHEN user attempts to open a Temp Inactive list tx from Employee's history or adv search",
    "custom_expected": "THEN clicking on the transaction in an employee's History or Advanced Search should open the transaction in the same window\r\nAND the layout of the transaction should match the View mode of the provided wireframe\r\nAND fields should match the provided data discovery\r\nAND whenever the form is in view mode, the user should see a \"Close\" button on the form in grey\r\nAND clicking \"Close\" should return the user to their entry point into the transaction\r\nAND the field Current Status should display in red if the transaction is in a preliminary state, green if pending and black for all other states(global AC)",
    "custom_steps_separated": null
  },
  {
    "id": 1214137,
    "title": "As a BOC user I want approving an Employee's Place on Temporarily Inactive List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394002",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user is logged in with daily transaction bulletin permissions",
    "custom_steps": "WHEN a  \"Placed on Temporarily Inactive List\" is approved for a MJ Roster employee",
    "custom_expected": "THEN transaction should appear on the current Pending Daily Transaction Bulletin as  \"Placed on Temporarily Inactive List\"\r\nAND when a  \"Placed on Temporarily Inactive List\" transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed\r\nBUT if it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \" \"Placed on Temporarily Inactive List - Reversed\" \r\nAND when a  \"Placed on Temporarily Inactive List\" is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1214138,
    "title": "As a user I want to submit a Place on Temporarily Inactive List transaction to the BOC for approval",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535000",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN a club or BOC user is logged in with create/submit permissions for Place on Temporarily Inactive List transaction",
    "custom_steps": "WHEN user opens a new preliminary or rejected Place on Temporarily Inactive List transaction\r\n",
    "custom_expected": "THEN a Submit to BOC button is available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is blue. \r\nAND Submit button is available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is grey.\r\nAND clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \r\nAND clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\r\nAND after the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \r\nAND system reloads the transaction in view mode, and displays a successful submit blue notification.  \r\nAND once the transaction has successfully been submitted, the system sets the employee's pending Status to \"Temporarily Inactive\".\r\nAND when a transaction reaches a status of \"Submitted to BOC\" an approval item will be generated and display on the BOC - Employee Transactions - Admin's Approvals widget. \r\nAND If a file is attached to the transaction, that is displayed and available for download from the Attachments column of the Approvals widget. \r\nAND If Comments are populated on the transaction, they display in the Comments column of the Approvals widget.\r\nAND employee name is a hyperlink in the Approvals widget. Clicking on the employee name will open the profile (defaults to History tab) in the same window/tab. \r\nAND Type\" will be a hyperlink. Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.\r\nAND once the transaction has been successfully submitted, system creates an entry in employee's History in green font. Code = EETMPIN, Description = Place on Temporarily Inactive List, From Org.\r\n\r\nSee Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214139,
    "title": "As a Club user I want to be prevented from initiating a Place on Temporarily Inactive List transaction for an employee at the MJ Level",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152950304",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "See Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nSee Messages #17:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club user is logged in with create permissions for Place on Temporarily Inactive list tx\r\nAND user is attempting to create a \"Place on Temporarily Inactive List\" for an Employee\r\nAND selected Employee is at the MJ level",
    "custom_steps": "WHEN user Selects \"Place on Temporarily Inactive List\" on the Employee Transactions create new menu",
    "custom_expected": "THEN system should check to see if the Employee's current position level is Major League\r\nAND if it is, system should display error #17 \"Only a BOC user is authorized to use the selected transaction on this employee\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214140,
    "title": "As a BOC user I want to approve or reject a Place on Temporarily Inactive List transaction",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535002",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions",
    "custom_steps": "WHEN the user is viewing Place on Temporarily Inactive List transaction (in view or edit mode) in Preliminary or Submitted",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved.  \r\nAND Update Player's Player History: Code = EETMPIN , Description = Place on Temporarily Inactive List , From Org/Club fields to be in black font. \r\nAND Update employee's Status to be Temporarily Inactive. \r\nOR BOC Approves see  \"Reject\" button when Temporarily Inactive List tx is in Submitted states \r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. See Messages #15.\r\nAND If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Remove pending history entry.",
    "custom_steps_separated": null
  },
  {
    "id": 1214141,
    "title": "As a Club user I want to receive a notification when my Place on Temporarily Inactive List transaction is approved, rejected, or reversed",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534998",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "See Clipboard Rules (#1, #2, #3): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard\r\nSee Wireframe: \r\nhttp://7xflwf.axshare.com/#p=clipboard_-_notifications\r\nGIVEN a club user is logged in \r\nAND a \"Place on Temporarily Inactive List\" transaction has been initiated for an Employee from user's club\r\n",
    "custom_steps": "WHEN \"Place on Temporarily Inactive List\" transaction is Approved, Rejected, or Reversed",
    "custom_expected": "THEN initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Approved\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Rejected\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink of any of these notifications should open the transaction in view mode in the same window/tab \r\nAND player's name should be a hyperlink\r\nAND clicking on the player's name hyperlink of any of these notifications should open the player's profile in view mode in the same window/tab on the Player History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1214142,
    "title": "As a user I want to edit an existing Place on Temporarily Inactive List transaction for an employee",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534999",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "See Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Temporarily+Inactive+List\r\nGIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List transaction\r\n",
    "custom_steps": "WHEN user opens a Place on Temporarily Inactive List transaction",
    "custom_expected": "THEN an Edit button should be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state\r\nAND clicking  Edit should reload the form in edit mode, and a Save button should appear in place of the Edit button (no edit button displayed in edit mode)\r\nAND in Preliminary or Rejected state, Club users should be able to edit all portions displayed on the form\r\nAND BOC should be able to edit all fields in all states except for Approved and Reversed transactions\r\nAND in Approved and Reversed transactions, edit should only give Clubs access to attach new files, but they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND in Approved and Reversed transactions, edit should only give BOC access to attach new files or edit existing attachments. They should also be able to update \"Comments\" and \"BOC Notes\" fields, but they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND a Save button should be available anytime the form is in edit mode\r\nAND clicking Save should save the transaction and it's current values and reload the form in View mode\r\nAND transaction status should be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status should not change\r\nAND after a successful save the system should display a successful save blue notification\r\nAND whenever the form is in edit mode, the user should see a \"Cancel\" button on the form in grey\r\nAND clicking \"Cancel\" should prompt the user to confirm that they wish to cancel the changes they have made\r\nAND if they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction\r\nBUT if they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected\r\nAND if they do not confirm the cancellation then the user should be returned to the form and no action will be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1214143,
    "title": "As a Club user I want to be prevented from initiating a Place on Temporarily Inactive List transaction for an employee that does not belong to my Club",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535016",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "Given a club user is logged in with create permissions for Place on Temporarily Inactive List Transactions\r\nAND user is attempting to create  a \"Place on Temporarily Inactive List\" for an employee that does not belong to logged in club \r\n ",
    "custom_steps": "WHEN user Selects \"Place on Temporarily Inactive List\" on the Employee Transactions create new menu",
    "custom_expected": "THEN system will check if the employee's Current Org is set to the Org of the initiating user. \r\nAND If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\r\nAND If the Org of the initiating user is not BOC or the Current Org of the employee, then display message #1.",
    "custom_steps_separated": null
  },
  {
    "id": 1214144,
    "title": "As a user I want to receive an error if the employee I am creating a Place on Temporarily Inactive List transaction for has a pending or approved transaction after the entered assignment date",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535014",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List Transactions\r\nAND user is attempting to submit or approve a Place on Temporarily Inactive List Transactions \r\nAND Employee the tx is being created for has a pending or approved transaction dated after the entered assignment date of Place on Temporarily tx",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (All places OnSubmit rules fired)",
    "custom_expected": "THEN system will check if the Assignment date is before the latest approved or pending (Pending to Club, Submitted to BOC) transaction date for the employee. If it is, an error will display. Messages #3.",
    "custom_steps_separated": null
  },
  {
    "id": 1214145,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Place on Temporarily Inactive List transaction",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535009",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "See Reverse/Suppress Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nGIVEN a BOC user is logged in with approver permissions\r\n",
    "custom_steps": "WHEN user is viewing a Place on Temporarily Inactive List transaction (in view or edit mode) in the Approved state\r\n",
    "custom_expected": "THEN user should see a \"Reverse\" button in grey\r\nAND clicking \"Reverse\" should run all required field and formatting checks and display any relevant error or warning messages. (On Submit rules should not be run)\r\nAND successful reverse notification should be displayed. See Messages #16\r\nAND the transaction status should be updated to \"Reversed\"\r\nAND system should display reversed transaction in player history with \"Voided\" in front of the transaction description. Example:\"Voided: Major/Minor Outright\"\r\nAND system should set the employee's Status, Club and Org to their values from prior to the transaction approval\r\nAND users that have permission to suppress the form should see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode\r\nAND clicking \"Reverse and Suppress\" should first reverse, and then suppress the transaction\r\nAND clicking \"Suppress\" should suppress the transaction\r\nAND when a transaction is suppressed it should be hidden from the employee's History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI\r\nAND clicking \"Reverse\" or \"Reverse and Suppress\", should check if the current transaction is the most recent approved transaction\r\nAND if the transaction is not the most recent approved transaction for the employee, then the user should receive an error message\r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND user will ONLY have the back option\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1214146,
    "title": "As a user I want to receive an error if the person I'm attempting to create an Employee Place on Temporarily Inactive List transaction for is not an Active Employee",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535017",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN a user is logged in with edit permissions for Place on Temporarily Inactive List Transactions\r\nAND user us attempting to submit a Place on Temporarily Inactive tx for not active employee\r\n",
    "custom_steps": "WHEN user selecting \"Place on Temporarily Inactive List\" from the transaction Create New menu",
    "custom_expected": "THEN system will check that the person is a currently Active or Active, Not Under Contract employee . If not, display error #12.\r\n\r\nBusiness Rule 6.01: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nMessages #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214147,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Temporarily Inactive List transaction for an employee with a prior pending transaction",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535011",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "GIVEN a BOC Approver is logged with the Employee Permissions \r\nAND user attempting to approve a Place on Temporarily Inactive List tx \r\nAND Employee the tx is being approve for has a pending transaction dated prior the assignments date of the Place on Temporarily tx ",
    "custom_steps": "WHEN user clicks \"Approve\"",
    "custom_expected": "THEN system will check if the employee has any pending transactions with an assignment date prior to this transaction's assignment date.  If yes, display message #19.\r\n\r\nBusiness Rule 6.16: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\n\r\nMessages #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214148,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Temporarily Inactive List transaction with an assignment date after the current date",
    "section_id": 145942,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152535012",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 15,
    "custom_preconds": "Business Rule 6.15: \r\nhttps://wiki.mlbam.com/display/EBIS/6.+Place+on+Temporarily+Inactive+List\r\nMessages #9: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to Approve a Place on Temporarily Inactive List transaction\r\nAND Assignment Date on the transaction is later than current date",
    "custom_steps": "WHEN user clicks \"Approve\" ",
    "custom_expected": "THEN system should check if the current date is before the assignment date entered on the transaction\r\nAND if it is, system should display message #9: \"This transaction cannot be approved unless the placement date is on or before the current date.\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214158,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions - Basic",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 178,
    "updated_on": 1562009392,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List tx",
    "custom_expected": "THEN user should be able to view and Print all employee transactions [Club and BOC] in all states for employees\r\nBUT user should not be able to make any changes or e-sign\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states\r\nBUT users without the permission should not be able to view the form anywhere in the system\r\n\r\nCurrently Employee transactions do NOT have a print button",
    "custom_steps_separated": null
  },
  {
    "id": 1214159,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions - Admin",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 178,
    "updated_on": 1562009412,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Admin Permissions",
    "custom_steps": "WHEN user attempts to do anything with Temp Inactive List tx",
    "custom_expected": "THEN user should be able to view and Print all Temp Inactive List transactions [Club and BOC] in all states for Employees\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states\r\nAND user should be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable) \r\nAND user should be able to Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags\r\nBUT Users without the permission cannot view the form anywhere in the system.\r\n\r\nCurrently Employee transactions do NOT have a print button\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214160,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions - Basic",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Temporarily Inactive list tx",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List tx",
    "custom_expected": "THEN user should be able to view and print all Temp InactiveList transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAnd user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. **Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org**\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214161,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions - Admin",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN a club user is logged in with viewer permissions for Temporarily Inactive list tx",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive list tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view or print Transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. **Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org**\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1214162,
    "title": "Place on Temporarily Inactive List Permissions - BOC - Employee Transactions",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534767",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Temporarily Inactive List Admin Permissions\r\nOR a BOC user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Temporarily Inactive List transactions",
    "custom_expected": "THEN user with Admin permissions can view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND Can view all flags for all transactions and transaction attachments in all states.\r\nAND Can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND Can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\nOR user with Viewer permissions can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1214163,
    "title": "Place on Temporarily Inactive List Permissions - Club - Employee Transactions",
    "section_id": 145943,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534766",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVEN a club user is logged in with Employee Place on Temporarily Inactive List Admin Permissions\r\nOR a club user is logged in with Employee Place on Temporarily Inactive List Viewer Permissions ",
    "custom_steps": "When user attempts to do anything with a Temporarily Inactive Transactions ",
    "custom_expected": "THEN user with Viewer permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n\r\n          However, there are exceptions:\r\n                  1. No Transactions that are in Suppressed state\r\n                  2. They cannot edit or change these transactions (Basic only)\r\n                  3. They cannot see \"BOC Notes\" field\r\n \r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\nOR User with Admin permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n \r\n      However, there are exceptions:\r\n      1. No Transactions that are in Suppressed state\r\n      2. They cannot see \"BOC Notes\" field\r\n\r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n      1.  Cannot see BOC Notes field for any transaction\r\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n \r\nBUT Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1214149,
    "title": "As a user I want to receive an error if the person I am trying to create an Employee Place on Ineligible List transaction for is not an Active Employee",
    "section_id": 145944,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534233",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction permission\r\n",
    "custom_steps": "WHEN user tries to create an Employee Place on Ineligible List transaction for not  Active Employee\r\n\r\n",
    "custom_expected": "THEN Selecting \"Place on Ineligible List\" from the Employee Transaction Create New menu will check that the person is a current Employee with an Active or Active (Not Under Contract) status.  If not, display Error #12.\r\n\r\nSee Business Rule #8.01, 8.05: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214150,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Ineligible List transaction for an employee that has a prior pending transaction",
    "section_id": 145944,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534243",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC approver logs in with Employee transaction permission\r\nAND an employee has a prior pending Place on Ineligible List transaction\r\n\r\n",
    "custom_steps": "WHEN user clicks on Approve a new Place on Ineligible List transaction\r\n\r\n",
    "custom_expected": "THEN Clicking \"Approve\" will check if the current date is after the assignment date entered on the transaction. If yes, then a warning will be shown. If the assignment date is on or before the current date, then no error is shown. See Messages #19.\r\n\r\nSee Business Rule #8.09: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nSee Error Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1214151,
    "title": "As a Club user I want to receive a notification when my Place on Ineligible List transaction is approved or reversed",
    "section_id": 145944,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534247",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction Permissions\r\n\r\n",
    "custom_steps": "WHEN BOC user Approves or Reverse Place on Ineligible List transaction\r\n",
    "custom_expected": "THEN Initiating Club (or the Club that the employee belongs to) will receive a notification when the transaction is updated to Approved. \r\nOR Initiating Club (or the Club that the employee belongs to) will receive a notification when the transaction is updated to Reversed, unless the transaction is also Suppressed. \r\nAND \"Description\" will be a hyperlink.\r\nAND Clicking on the description hyperlink of any of these notifications will open the transaction in view mode in the same window/tab. \r\nAND Employee's name will be a hyperlink.\r\nAND Clicking on the employee's name hyperlink of any of these notifications will open the employee's profile in view mode in the same window/tab on the History tab.\r\n\r\nSee Clipboard Rules (#2, #4): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard",
    "custom_steps_separated": null
  },
  {
    "id": 1214152,
    "title": "As a BOC user I want to approve a Place on Ineligible List transaction",
    "section_id": 145944,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534239",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions \r\n\r\n\r\n",
    "custom_steps": "WHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in Preliminary",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved. \r\nAND Update Employee's History: Code =  INELG , Description = Place on Ineligible List , From Org/Club field to be in black font. \r\nAND Update player's Employee Status to be \"Ineligible\".\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/8.+Place+on+Ineligible+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Ineligible+List",
    "custom_steps_separated": null
  },
  {
    "id": 1214153,
    "title": "As a BOC user I want approving an Employee's Place on Ineligible List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 145944,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534238",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with daily transaction bulletin permissions",
    "custom_steps": "WHEN a Place on Ineligible List is approved for a MJ Roster employee",
    "custom_expected": "THEN transaction should appear on the current Pending Daily Transaction Bulletin as \"Placed on Ineligible List\"\r\nAND when a Place on Ineligible List transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed\r\nBUT if it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Placed on Ineligible List - Reversed\" \r\nAND when a Place on Ineligible List is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed",
    "custom_steps_separated": null
  },
  {
    "id": 1214154,
    "title": "Place on Ineligible List Permissions - Club - Employee Transactions  - Basic",
    "section_id": 145945,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534236",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN a club user is logged in with Club Viewer permissions for Place on Ineligible List tx\r\n",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\nBUT user should not be able to view transactions that are in Suppressed state\r\nAND user should not be able to edit or change these transactions (Basic only)\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAnd user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org",
    "custom_steps_separated": null
  },
  {
    "id": 1214155,
    "title": "Place on Ineligible List Permissions - Club - Employee Transactions - Admin",
    "section_id": 145945,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534236",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN a club user is logged in with viewer permissions for a Place on Ineligible List Transaction\r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List Transaction\r\n",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should not be able to view or print Transactions that are in Suppressed state\r\nAND user should not be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions\r\nBUT user should not be able to see BOC Notes field for any transaction\r\nAND user should not be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\nAND user should not be able to see Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1214156,
    "title": "Place on Ineligible List Permissions - BOC - Employee Transactions - Basic",
    "section_id": 145945,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534237",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Transactions Viewer Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Place on Ineligible List tx",
    "custom_expected": "THEN user will be able to view and Print all employee transactions in all states for employees but cannot make any changes or e-sign.\r\nAnd use will be able to view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1214157,
    "title": "Place on Ineligible List Permissions - BOC - Employee Transactions-Admin",
    "section_id": 145945,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534237",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 178,
    "updated_on": 1562009361,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transactions Admin Permissions\r\n\r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with Place on Ineligible List Transaction",
    "custom_expected": "THEN user should be able to view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND user should be able to view all flags for all transactions and transaction attachments in all states.\r\nAND user should be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nand user should be able to  Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\n\r\nCurrently Employee transactions do NOT have a print button\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214170,
    "title": "As a BOC Approver I want to receive an error if I'm attempting to approve a Place on Deceased List transaction with an assignment date after the current date",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534705",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "Business Rule #7.08: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #9: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in as BOC approver\r\nAND user is attempting to approve a Place on Deceased List tx",
    "custom_steps": "WHEN user clicks \"Approve\" on the tx",
    "custom_expected": "THEN system should check if the assignment date entered on the transaction is after the current date\r\nAND if yes, system should show Messages #9: \"This transaction cannot be approved unless the placement date is on or before the current date.\"\r\nAND only \"Back\" button should be available\r\nAND Clicking \"Back\" should return user to the point of entry ",
    "custom_steps_separated": null
  },
  {
    "id": 1214171,
    "title": "As a user I want to receive an error if I'm attempting to submit a Place on Deceased List transaction for a player that has a prior pending transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534704",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user logs in with with Employee transaction permission\r\nAND an employee has any existing Pending transactions prior to the entered assignment date on the new Place on Deceased List transaction",
    "custom_steps": "WHEN user clicks on Approve on new Place on Deceased List transaction",
    "custom_expected": "THEN all places OnSubmit rules are fired \r\nAND system will check if the employee has any pending transactions with an assignment date prior to this transaction's assignment date.  If yes, display message #19.\r\n\r\nSee Business Rule #7.09: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\n\r\nSee Error Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214172,
    "title": "As a user I want to receive an error if I'm attempting to submit a Place on Deceased List transaction for an Employee that has a prior pending transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534704",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 156,
    "updated_on": 1516373231,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "Business Rule #7.09: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #19: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with edit/submit permissions for Deceased List tx\r\nAND user is attempting to submit a Place on Deceased list tx for an Employee\r\nAND the chosen Employee already has a pending tx with an earlier date",
    "custom_steps": "WHEN user clicks \"Approve\"",
    "custom_expected": "THEN system should check if the transaction being approved has a transaction date on or after other pending transactions for the player\r\nAND if yes - an error (Messages #19) Should display stating: \"This transaction cannot be approved while a previously submitted transaction is pending.\"\r\nAND only \"Back\" button should be available\r\nAND clicking \"Back\" should return the user to the point of entry\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214173,
    "title": "As a Club user I want to receive a notification when my Place on Deceased List transaction is approved, rejected or reversed",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534703",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "Clipboard Rules (#2, #3, #4): \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Clipboard\r\nGIVEN a user is logged in as a club admin user\r\nAND a Place on Deceased list tx has been submitted for an Employee from logged in user's org",
    "custom_steps": "WHEN the Deceased List tx is Approved, Rejected, or Reversed\r\nAND user is currently viewing the clipboard for their org",
    "custom_expected": "THEN initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Approved\r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Reversed\r\nBUT if the transaction is also Suppressed, club should NOT receive a notification \r\nAND initiating Club (or the Club that the employee belongs to) should receive a notification when the transaction is updated to Rejected\r\nAND \"Description\" should be a hyperlink\r\nAND clicking on the description hyperlink of any of these notifications should open the transaction in view mode in the same window/tab\r\nAND Employee's name should be a hyperlink\r\nAND clicking on the employee's name hyperlink of any of these notifications should open the employee's profile in view mode in the same window/tab on the History tab",
    "custom_steps_separated": null
  },
  {
    "id": 1214174,
    "title": "As a user I want to receive an error if the employee I am creating a Place on Deceased List transaction for has an approved transaction after the entered assignment date",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534707",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 156,
    "updated_on": 1516374559,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "Business Rule #7.06: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #3: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a user is logged in with edit permissions for Deceased List tx\r\nAND user is attempting to submit or approve a Place on Deceased List tx\r\nAND Employee that tx is being created for has an approved transaction dated after the assignment date of the Deceased List tx\r\n",
    "custom_steps": "WHEN user clicks \"Submit\" or \"Approve\" (all places OnSubmit rules are fired)",
    "custom_expected": "THEN system should check if the Assignment date is before the latest approved transaction date for the player\r\nAND if the above condition is met on Clicking submit system should display Messages #3 as follows:\r\n \"A transaction cannot **be scheduled** before the date of the player's latest approved or pending transaction, on <TX Date>.\"\r\nAND \"Ignore and Continue\" button should be available (only for BOC and only on submit)\r\nAND clicking \"Ignore and Continue\" should continue with transaction submission\r\nAND \"Back\" button should be available \r\nAND clicking back should return user to point of entry\r\nBUT if the above condition is met on clicking Approve, system should display messages #3 as follows:\r\n\"A transaction cannot **occur** before the date of the player's latest approved or pending transaction, on <TX Date>.\"\r\nAND \"Back\" button should be available \r\nAND clicking back should return user to point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214175,
    "title": "As a user I want to receive an error if the person I'm attempting to create a Deceased List transaction for is not a current employee",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534712",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "Business Rule #8.01, 8.05: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nError Message #12: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club or BOC user is logged in with edit/create permissions for Deceased List tx\r\nAND user is viewing the profile that is NOT a current Employee with an \"Active\" or \"Active (Not Under Contract)\" status\r\n",
    "custom_steps": "WHEN user selects \"Place on Deceased List\" from the Employee Transaction Create New menu ",
    "custom_expected": "THEN system should check that the person is a current Employee with an \"Active\" or \"Active (Not Under Contract)\" status\r\nAND if not, system should display Error #12: \"This person is not an Active Employee.\"\r\nAND only a \"Back\" button should be available\r\nAND clicking \"Back\" should return user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214176,
    "title": "As a user I want to edit an existing Place on Deceased List transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534713",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": "Data Discovery: https://wiki.mlbam.com/display/EBIS/Deceased+List\r\nGIVEN a club or BOC user is logged in with edit permissions for Deceased List tx\r\n",
    "custom_steps": "WHEN user opens a Place on Deceased List tx in view mode",
    "custom_expected": "THEN an Edit button should be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state\r\nAND clicking  Edit should reload the form in edit mode\r\nAND a Save button should appear in place of the Edit button (no edit button displayed in edit mode)\r\nAND in Preliminary state, the BOC users should be able to edit all portions displayed on the form\r\nBUT club should not be able to edit existing attachments or any other part of transaction\r\nAND BOC should be able to edit all fields in all states except for Approved and Reversed transactions\r\nAND in Approved and Reversed transactions, edit should only give BOC access to attach new files or edit existing attachments. (They should also be able update \"Comments\" and \"BOC Notes\" fields)\r\nBUT they should not be able to edit any other part of transaction unless specifically stated in data discovery\r\nAND a Save button should be available anytime the form is in edit mode\r\nAND clicking Save should save the transaction and it's current values and reload the form in View mode\r\nAND transaction status should be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status should not change\r\nAND after a successful save the system should display a successful save blue notification\r\nAND whenever the form is in edit mode, the user should see a \"Cancel\" button on the form in grey\r\nAND clicking \"Cancel\" should prompt the user to confirm that they wish to cancel the changes they have made\r\nAND if they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction\r\nBUT if they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected\r\nAND if they do not confirm the cancellation then the user should be returned to the form and no action should be taken",
    "custom_steps_separated": null
  },
  {
    "id": 1214177,
    "title": "As a user I want to submit a Place on Deceased List transaction to the BOC for approval",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152741305",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": "Submission Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\nGIVEN a club or BOC user is logged in with create/submit permissions for Place on Deceased list tx\r\n",
    "custom_steps": "WHEN user opens a new preliminary or rejected Place on Deceased list tx in view or edit mode from create new\r\n",
    "custom_expected": "THEN a Submit to BOC button should be available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button should be blue\r\nAND Submit button should be available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button should be grey\r\nAND clicking Submit should run a required field and format check according to the data discovery\r\nAND if any fields are missing or formatted incorrectly, user should receive an error message\r\nAND clicking Submit will run the On Submit rules check (each covered in other test cases - this test case assumes they all pass)\r\nAND after the rules have passed, the system should update the status of the transaction to \"Submitted to BOC\"  \r\nAND system should reload the transaction in view mode, and display a successful submit blue notificationd\r\nAND once the transaction has successfully been submitted, the system should set the player's pending Status to \"Deceased\".\r\nAND when a transaction reaches a status of \"Submitted to BOC\" an approval item should be generated and display on the BOC - Employee Transactions - Admin's Approvals widget\r\nAND if a file is attached to the transaction, that should be displayed and available for download from the Attachments column of the Approvals widget\r\nAND if Comments are populated on the transaction, they should display in the Comments column of the Approvals widget\r\nAND player name should be a hyperlink in the Approvals widget. \r\nAND clicking on the player name should open the Player Profile (should default to Player History tab) in the same window/tab \r\nAND \"Type\" should be a hyperlink\r\nAND clicking on the type hyperlink of a submitted transaction should open the submitted transaction in view mode in the same window/tab\r\nAND once the transaction has been successfully submitted, system should create an entry in Player's Player History in green font. Code = DEAD (Not displayed on the front end), Description = Place on Deceased List, From Org.",
    "custom_steps_separated": null
  },
  {
    "id": 1214178,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Place on Deceased List transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534717",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": "Reverse/Suppress Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nGIVEN a user is logged in as BOC approver\r\nAND a Place on Deceased List tx has been approved for an Employee\r\n",
    "custom_steps": "WHEN BOC approver opens the Approved Place on Deceased List tx",
    "custom_expected": "THEN user should see a \"Reverse\" button in grey (in view or edit mode)\r\nAND clicking \"Reverse\" should run all required field and formatting checks and display any relevant error or warning messages. On Submit rules should not be run\r\nAND a successful reverse notification should be displayed\r\nAND the transaction status should be updated to \"Reversed\"\r\nAND reversed transaction should display in player history with \"Voided\" in front of the transaction description. Example:\"Voided: Place on Deceased List\"\r\nAND system should set the employee's Status, Club and Org to their values from prior to the transaction approval\r\nAND users that have permission to suppress the form should see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode\r\nAND clicking \"Reverse and Suppress\" should first reverse, and then suppress the transaction\r\nAND clicking \"Suppress\" should suppress the transaction\r\nAND when a transaction is suppressed it should be hidden from the player's Player History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI\r\nAND clicking \"Reverse\" or \"Reverse and Suppress\", should check if the current transaction is the most recent approved transaction\r\nAND if the transaction is not the most recent approved transaction for the player, then the user should receive an error message\r\n**Message** \"Only the player's latest approved transaction can be reversed.\"\r\nAND user should ONLY have the back option\r\nAND clicking Back should close the modal and return the user to the transaction",
    "custom_steps_separated": null
  },
  {
    "id": 1214179,
    "title": "As a BOC user I want to approve a Place on Deceased List transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534698",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC user is logged in with Employee Transaction Permissions\r\n\r\n",
    "custom_steps": "WHEN the user is viewing Place on Ineligible List transaction (in view or edit mode) in Preliminary\r\n",
    "custom_expected": "THEN BOC Approvers will see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nAND If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved. \r\nAND Update History: Code = DEAD (not displayed on front end) , Description = Place on Deceased List , From Org/Club and To Org/Club fields to be in black font. \r\nAND Update employee's to be \"Deceased\". Do NOT display this roster status. On front end roster status should appear blank. \r\nAND Status should not appear on profile or in advanced search. \r\nAND Update logo displayed on employee profile to standard MLB logo to signify they are no longer associated with a team.\r\nAND Do NOT Add transaction to the Daily Transaction Bulletin.\r\n\r\nSee Approval Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List",
    "custom_steps_separated": null
  },
  {
    "id": 1214180,
    "title": "As a user I want to be able to delete a Place on Deceased List transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534718",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": "GIVEN BOC and Club user logs in with edit Employee Transaction permission\r\nAND Place on Deceased List transaction already exist\r\n\r\n",
    "custom_steps": "WHEN user is viewing Place on Deceased List transaction in Preliminary and Rejected states \r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nOR If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1214181,
    "title": "As a user I want to be able to create a new Place on Deceased List transaction for an Employee",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534716",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": "GIVEN the user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN the user clicks on \"Create New\" button on the Employee Profile\r\n",
    "custom_expected": "THEN \"Employee Transactions\" is an option in the top-level dropdown (already built)\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Place on Deceased List\" should be an option in the third level dropdown.\r\nAND Selecting \"Place on Deceased List\" from the Create New will check to see if there is an existing Preliminary Place on Deceased List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOr If no preliminary transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_deceased_list\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1214182,
    "title": "As a user I want to view an existing Place on Deceased List transaction",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534715",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": "GIVEN BOC and Club user logs in with Employee Transaction permission\r\nAND Place on Deceased List transaction already exist\r\n\r\n",
    "custom_steps": "WHEN Clicking on the transaction in an employee's History or Advanced Search\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND  Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND  Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC:\r\n* The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Deceased+List\r\n\r\nSee Wireframe: \r\nhttp://r6vcv1.axshare.com/#p=place_on_deceased_list",
    "custom_steps_separated": null
  },
  {
    "id": 1214183,
    "title": "As a Club user I want to be prevented from initiating a Place on Deceased List transaction for an employee at the MJ Level",
    "section_id": 145946,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152741328",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 14,
    "custom_preconds": "See Business Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/7.+Place+on+Deceased+List\r\nSee Messages #17:\r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\nGIVEN a club user is logged in with create permissions for Place on Deceased list tx\r\nAND user is attempting to create a \"Place on Deceased List\" for an Employee\r\nAND selected Employee is at the MJ level",
    "custom_steps": "WHEN user Selects \"Place on Deceased List\" on the Employee Transactions create new menu\r\n",
    "custom_expected": "THEN system should check to see if the Employee's current position level is Major League\r\nAND if it is, system should display error #17 \"Only a BOC user is authorized to use the selected transaction on this employee\"\r\nAND clicking \"Back\" should return the user to the point of entry",
    "custom_steps_separated": null
  },
  {
    "id": 1214164,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions - Admin",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 178,
    "updated_on": 1562009331,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List  Admin Permissions \r\n\r\n",
    "custom_steps": "WHEN user attempts to do anything with Place on Deceased List\r\n\r\n",
    "custom_expected": "THEN user will be able to view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND user will be able to view all flags for all transactions and transaction attachments in all states.\r\nAND user will be able to create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND user will be able to Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\n\r\nCurrently Employee transactions do NOT have a print button",
    "custom_steps_separated": null
  },
  {
    "id": 1214165,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions  - Basic",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List Basic Permissions",
    "custom_steps": "WHEN user attempts to do anything with a Place on Deceased List Permissions",
    "custom_expected": "THEN user will be able to view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND user will be able to view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1214166,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions - Basic",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN a club user is logged in with basic (viewer) permissions for Place on Deceased List tx",
    "custom_steps": "WHEN basic club user attempts to do anything with a Place on Deceased List tx",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should NOT be able edit or change these transactions\r\nAND user should NOT be able to see \"BOC Notes\" field\r\nAND user should NOT be able to view any Transactions that are in Suppressed state \r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should NOT be able to see BOC Notes field for any transaction\r\nAND user should NOT be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. (Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org)\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees",
    "custom_steps_separated": null
  },
  {
    "id": 1214167,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions - Admin",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN a club user is logged in with admin permissions for Place on Deceased List tx",
    "custom_steps": "WHEN club admin user attempts to do anything with a Place on Deceased List tx\r\n",
    "custom_expected": "THEN user should be able to view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too\r\nBUT user should NOT be able to view Transactions that are in Suppressed state\r\nAND user should NOT be able to see \"BOC Notes\" field\r\nAND user should be able to view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions \r\nBUT user should NOT be able to see BOC Notes field for any transaction\r\nAND user should NOT be able to see the Comments field for any transaction unless the logged in Org is the From Org or To Org. (Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org)\r\nAND user should NOT be able to see attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\nAND user should NOT be able to create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1214168,
    "title": "Place on Deceased List Permissions - BOC - Employee Transactions",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534761",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with Employee Place on Deceased List Admin Permissions \r\nOR a BOC user is logged in with Employee Place on Decease List Viewer Permissions",
    "custom_steps": "WHEN BOC user attempts to do anything with Employee Place on Deceased List",
    "custom_expected": "THEN BOC with Admin permissions can view and Print all employee league transactions [Club and BOC] in all states for Employees.\r\nAND Can view all flags for all transactions and transaction attachments in all states.\r\nAND Can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \r\nAND Can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\r\nOR BOC with Viewer permissions can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\r\nAND Can view all flags for all transactions and transaction attachments in all states.",
    "custom_steps_separated": null
  },
  {
    "id": 1214169,
    "title": "Place on Deceased List Permissions - Club - Employee Transactions",
    "section_id": 145947,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534760",
    "created_by": 103,
    "created_on": 1513283541,
    "updated_by": 103,
    "updated_on": 1513283541,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": "GIVE a club user is logged in with Employee Place on Deceased List Admin Permissions \r\nOR a club user is logged in with Employee Place on the Decease List Viewer Permissions",
    "custom_steps": "WHEN club user attempts to do anything with Place on Deceased List transactions",
    "custom_expected": "THEN club with Viewer permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n\r\n          However, there are exceptions:\r\n                  1. No Transactions that are in Suppressed state\r\n                  2. They cannot edit or change these transactions (Basic only)\r\n                  3. They cannot see \"BOC Notes\" field\r\n \r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n    1.  Cannot see BOC Notes field for any transaction\r\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n\r\nOR club with admin permissions can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\r\n \r\n      However, there are exceptions:\r\n      1. No Transactions that are in Suppressed state\r\n      2. They cannot see \"BOC Notes\" field\r\n\r\nAND Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\r\n \r\n      1.  Cannot see BOC Notes field for any transaction\r\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\r\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\r\n \r\nBUT Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_steps_separated": null
  },
  {
    "id": 1216823,
    "title": "As a BOC user I want approving an Employee's Place on Suspended List transaction to create an entry in the daily transaction bulletin if applicable",
    "section_id": 146373,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153394003",
    "created_by": 103,
    "created_on": 1516116602,
    "updated_by": 103,
    "updated_on": 1516116602,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": "GIVEN BOC user logs in with employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN user approves Place on Suspended List transaction for a MJ Roster employee",
    "custom_expected": "THEN it should appear on the current Pending Daily Transaction Bulletin as \"Place on Suspended List\"\r\nBUT When a Place on Suspended List transaction is reversed, if the \"approved\" bulletin entry is still on the Pending Bulletin, it should be removed. If it was on a previous Bulletin, then a new entry should be added to the current Pending Daily Transaction Bulletin as \"Place on Suspended List - Reversed\" \r\nOR When a Place on Suspended List is suppressed, if the \"reversed\" bulletin entry is still on the Pending Bulletin, it should be removed.",
    "custom_steps_separated": null
  },
  {
    "id": 1216824,
    "title": "As a BOC user I want to approve or reject a Place on Suspended List transaction",
    "section_id": 146373,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393969",
    "created_by": 103,
    "created_on": 1516116602,
    "updated_by": 103,
    "updated_on": 1516116602,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC user logs in with Employee transaction permission\r\n\r\n\r\n",
    "custom_steps": "WHEN BOC user opens a Place on Suspended List transaction in Preliminary or Submitted to BOC (in view or edit mode)\r\n\r\n\r\n",
    "custom_expected": "THEN BOC Approvers see an \"Approve\" button in blue \r\nAND Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\nAND Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\nBUT If the item was in edit mode, it is reloaded in view mode. \r\nAND A successful blue notification is displayed that states the transaction was approved.  \r\nAND Update Player's Player History: Code = EESUSPD , Description = Place on Suspended List , From Org fields to be in black font. \r\nAND Update employee's Status to be Suspended. \r\nAND Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\nAND Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\nAND Successful reject notification is displayed. \r\nBUT If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\nAND Remove pending history entry.\r\n\r\nSee Approval/Rejection Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/5.+Place+on+Suspended+List\r\n\r\nSee Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages",
    "custom_steps_separated": null
  },
  {
    "id": 1216825,
    "title": "As a user I want to be able to delete a Place on Suspended List transaction",
    "section_id": 146373,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393971",
    "created_by": 103,
    "created_on": 1516116602,
    "updated_by": 103,
    "updated_on": 1516116602,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN the Club or BOC user logs in with Employee Transaction permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user opens a Place on Suspended List transaction in Preliminary and Rejected states\r\n",
    "custom_expected": "THEN user will see a \"Delete\" button on the form in grey, in either view or edit mode. \r\nAND Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\r\n**Title:** Warning\r\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\r\n**Hint:** This is a permanent action that cannot be undone.\r\n**Buttons:** Yes, No\r\nAND If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\r\nBUT If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_steps_separated": null
  },
  {
    "id": 1216826,
    "title": "As a user I want to be able to create a new Place on Suspended List transaction for an employee",
    "section_id": 146373,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393972",
    "created_by": 103,
    "created_on": 1516116602,
    "updated_by": 103,
    "updated_on": 1516116602,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": "GIVEN Club or BOC user logs in with Employee Transaction Permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on Create New for an Employee",
    "custom_expected": "THEN user will see \"Employee Transactions\" is an option in the top-level dropdown\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Place on Suspended List\" should be an option in the third level dropdown.\r\nAND Selecting \"Place on Suspended List\" from the Create New will check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Place on Suspended List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary or rejected transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nAND If a submitted transaction already exists, the system will load the existing transaction in View Mode.\r\nBUT If no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Suspended+List\r\n\r\nSee Wireframe: ",
    "custom_steps_separated": null
  },
  {
    "id": 1216827,
    "title": "As a user I want to view an existing Place on Suspended List transaction",
    "section_id": 146373,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153393974",
    "created_by": 103,
    "created_on": 1516116602,
    "updated_by": 103,
    "updated_on": 1516116602,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": "GIVEN Club or BOC user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN Clicking on Place on Suspended List transaction in an employee's History or Advanced Search\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC:The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Suspended+List\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 1216828,
    "title": "Place on Suspended List Permissions - Club - Employee Transactions",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534771",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \nBASIC:\n* Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\n\n          However, there are exceptions:\n                  1. No Transactions that are in Suppressed state\n                  2. They cannot edit or change these transactions (Basic only)\n                  3. They cannot see \"BOC Notes\" field\n \n* Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\n \n    1.  Cannot see BOC Notes field for any transaction\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\n\nADMIN:\n\n* Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\n \n      However, there are exceptions:\n      1. No Transactions that are in Suppressed state\n      2. They cannot see \"BOC Notes\" field\n\n* Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\n \n      1.  Cannot see BOC Notes field for any transaction\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\n \n* Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216829,
    "title": "As a user I want to view an existing Reinstate from Inactive List transaction",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520263",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 2,
    "custom_preconds": "GIVEN BOC or Club user logs in with Employee transaction permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on Reinstate from Inactive List transaction in an employee's History or Advanced Search\r\n\r\n\r\n",
    "custom_expected": "THEN system will open the transaction in the same window. \r\nAND The layout of the transaction will match the View mode of the provided wireframe.\r\nAND Fields will match the provided data discovery.\r\nAND Whenever the form is in view mode, the user will see a \"Close\" button on the form in grey. \r\nAND Clicking \"Close\" will return the user to their entry point into the transaction. \r\n\r\nGlobal AC: The field Current Status will display in red if the transaction is in a preliminary state, green if pending and black for all other states.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List",
    "custom_steps_separated": null
  },
  {
    "id": 1216830,
    "title": "As a user I want to be able to create a new Reinstate from Inactive List transaction for an employee",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520261",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 3,
    "custom_preconds": "GIVEN the BOC or Club user logs in with Employee Transaction permission\r\n\r\n",
    "custom_steps": "WHEN user clicks on create new menu icon for an employee\r\n\r\n\r\n",
    "custom_expected": "THEN \"Employee Transactions\" should an option in the top-level dropdown (already built)\r\nAND \"Inactive List\" should be an option under Employee Transactions.\r\nAND \"Reinstate from Inactive List\" should be an option in the third level dropdown.\r\nAND Selecting \"Reinstate from Inactive List\" from the Create New will check to see if there is an existing Preliminary, Submitted to BOC or Rejected MN Reinstate from Inactive List transaction for the same employee created within 10 days of the current date. \r\nAND If a preliminary or rejected transaction already exists, the system will load the existing transaction in Edit Mode instead of opening a new transaction. \r\nOR If a submitted transaction already exists, the system will load the existing transaction in View Mode.\r\nOR If no preliminary, submitted or rejected transaction created within 10 days of the current date exists, the system will load a new Preliminary transaction.\r\nAND Transaction should follow the wireframe and data discovery.\r\n\r\nSee Data Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List",
    "custom_steps_separated": null
  },
  {
    "id": 1216831,
    "title": "As a user I want to be able to delete a Reinstate from Inactive List transaction",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520259",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 4,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria:\n* Users that have edit permissions for the form in Preliminary and Rejected states will see a \"Delete\" button on the form in grey, in either view or edit mode. \n* Clicking \"Delete\" will prompt the user to confirm that they wish to delete the form from the system.\n**Title:** Warning\n**Body:** Are you sure you want to delete this [form]? (\"Form\" to be replaced with transaction type)\n**Hint:** This is a permanent action that cannot be undone.\n**Buttons:** Yes, No\n* If they confirm the deletion, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction and a blue notification should be thrown.\n* If they do not confirm the deletion, then they should be returned to the form and no action should be taken.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216832,
    "title": "Reinstate from Inactive List Permissions - BOC - Employee Transactions",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534769",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 5,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \n* The transaction has a view permission set that can be added to an existing user if needed. Users without the permission cannot view the form anywhere in the system.\n\nADMINS:\n* Can view and Print all employee league transactions [Club and BOC] in all states for Employees.\n* Can view all flags for all transactions and transaction attachments in all states.\n* Can create, delete, edit, e-sign and submit all Employee transactions for Employees (or players where applicable). \n* Can Approve, Reject, Reverse and Suppress all Employee transactions and see associated Flags.\n\nBASIC:\n* Can view and Print all employee transactions [Club and BOC] in all states for employees but cannot make any changes or e-sign.\n* Can view all flags for all transactions and transaction attachments in all states.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216833,
    "title": "Reinstate from Inactive List Permissions - Club - Employee Transactions",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "152534768",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 6,
    "custom_preconds": null,
    "custom_steps": "Acceptance Criteria: \nBASIC:\n* Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transaction. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\n\n          However, there are exceptions:\n                  1. No Transactions that are in Suppressed state\n                  2. They cannot edit or change these transactions (Basic only)\n                  3. They cannot see \"BOC Notes\" field\n \n* Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\n \n    1.  Cannot see BOC Notes field for any transaction\n    2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n    3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\n\nADMIN:\n\n* Club users with this role can view and print all employee transactions in all states when the logged in Org matches the \"From Org\" for that transactions. It does not matter if the BOC or the club initiated the transaction. It also does not matter which Org the involved employee currently belongs too.\n \n      However, there are exceptions:\n      1. No Transactions that are in Suppressed state\n      2. They cannot see \"BOC Notes\" field\n\n* Club users with this role Can view all APPROVED (no other states) employee transactions including other club's employee transactions or BOC only transactions with the following exceptions:\n \n      1.  Cannot see BOC Notes field for any transaction\n      2. Cannot see the Comments field for any transaction unless the logged in Org is the From Org or To Org. Note that even if the employee involved is currently part of their Org, they still cannot see the comments field unless they are the From Org or To Org\n      3. Attached Files section in the transaction form unless the logged in Org is the From Org or To Org\n \n* Can NOT create, delete, submit, edit, or attach files to any BOC only employee transactions for employees.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216834,
    "title": "As a user I want to submit a Reinstate from Inactive List transaction to the BOC for approval",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520258",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 7,
    "custom_preconds": null,
    "custom_steps": "See Business Rules: \nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\n\nData Discovery: \nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List\n\nMessages: \nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\n\nAcceptance Criteria:\n* Submit to BOC button is available to Club users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is blue. \n* Submit button is available for BOC users when the transaction is in a preliminary or rejected state in edit mode or view mode. The button is grey.\n* Clicking Submit will run a required field and format check according to the data discovery. If any fields are missing or formatted incorrectly, user will receive an error message. \n* Clicking Submit will run the On Submit rules check (each covered in other stories - this story assumes they all pass).\n* After the rules have passed, the system updates the status of the transaction to \"Submitted to BOC\"  \n* System reloads the transaction in view mode, and displays a successful submit blue notification.  \n* Once the transaction has successfully been submitted, the system sets the employee's pending Status to whatever it was prior to their being placed on the Inactive List. \n* When a transaction reaches a status of \"Submitted to BOC\" an approval item will be generated and display on the BOC - Employee Transactions - Admin's Approvals widget. \n* If a file is attached to the transaction, that is displayed and available for download from the Attachments column of the Approvals widget. \n* If Comments are populated on the transaction, they display in the Comments column of the Approvals widget.\n* Employee name is a hyperlink in the Approvals widget. Clicking on the employee name will open the profile (defaults to History tab) in the same window/tab. \n* \"Type\" will be a hyperlink. Clicking on the type hyperlink of a submitted transaction will open the submitted transaction in view mode in the same window/tab.\n* Once the transaction has been successfully submitted, system creates an entry in employee's History in green font. Code = EERSTIL, Description = Reinstate from (Inactive List) - with (Inactive List) replaced with the type of inactive list they are being reinstated from, From Org.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216835,
    "title": "As a BOC user I want to approve or reject a Reinstate From Inactive List transaction",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520257",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 156,
    "updated_on": 1516393402,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 8,
    "custom_preconds": null,
    "custom_steps": "See Approval/Rejection Updates: \r\nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\r\n\r\nSee Messages: \r\nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\r\n\r\nAcceptance Criteria:\r\nAPPROVE:\r\n* BOC Approvers see an \"Approve\" button in blue when they are viewing a transaction (in view or edit mode) in Preliminary or Submitted to BOC if applicable. \r\n* Clicking \"Approve\" will run all required field, formatting and On Approve rules checks and display any relevant error or warning messages. \r\n* Once all rules have passed or been overridden, the transaction status is updated to \"Approved\"\r\n* If the item was in edit mode, it is reloaded in view mode. \r\n* A successful blue notification is displayed that states the transaction was approved.  \r\n* Update Player's Player History: Code = EERSTIL , Description = Reinstate from (Inactive List) , From Org fields to be in black font. \r\n\r\n\r\nREJECT:\r\n* Clicking \"Reject\" will run all required field and formatting checks and display any relevant error or warning messages (all covered in previous stories). \r\n* Once all On Save rules have passed or been overridden, the transaction status is updated to \"Rejected\"\r\n* Successful reject notification is displayed. \r\n* If the item was on the Approvals Clipboard, that is removed from the approvals clipboard. \r\n* Remove pending history entry.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216836,
    "title": "As a BOC user I want to be able to reverse, reverse and suppress or suppress a Reinstate from Inactive List transaction",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520254",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 9,
    "custom_preconds": null,
    "custom_steps": "See Reverse/Suppress Updates: \nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\n\nAcceptance Criteria:\n* BOC Approvers see a \"Reverse\" button in grey when they are viewing a transaction (in view or edit mode) in the Approved state. \n* Clicking \"Reverse\" will run all required field and formatting checks and display any relevant error or warning messages. On Submit rules are not run. \n* Successful reverse notification will be displayed. \n* The transaction status is updated to \"Reversed\"\n* Display reversed transaction in player history with â€œVoided:â€￾ in front of the transaction description. Example:â€￾ Voided: Major/Minor Outrightâ€￾\n* Set the employee's Status, Club and Org to their values from prior to the transaction approval.\n* Users that have permission to suppress the form will see a \"Reverse and Suppress\" option on Approved transactions and a \"Suppress\" button on Reversed transactions, both in grey, in either view or edit mode. \n* Clicking \"Reverse and Suppress\" will first reverse, and then suppress the transaction. \n* Clicking \"Suppress\" will suppress the transaction.\n* When a transaction is suppressed it will be hidden from the employee's History, Searches (unless BOC user specifically searches suppressed transactions), and any other place where it is visible on UI.\n* Clicking \"Reverse\" or \"Reverse and Suppress\", will check if the current transaction is the most recent approved transaction. \n* If the transaction is not the most recent approved transaction for the employee, then the user will receive an error message. \n**Message** \"Only the player's latest approved transaction can be reversed.\"\n* User will ONLY have the back option. Clicking Back will close the modal and return the user to the transaction.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216837,
    "title": "As a Club user I want to be prevented from initiating a Reinstate from Inactive List transaction for an employee that does not belong to my Club",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520252",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 10,
    "custom_preconds": null,
    "custom_steps": "Business Rule 9.02: \nhttps://wiki.mlbam.com/display/EBIS/9.+Reinstate+from+IL\n\nMessages #1: \nhttps://wiki.mlbam.com/display/EBIS/Employee+Transactions+-+Messages\n\nAcceptance Criteria:\n* Selecting \"Reinstate from Inactive List\" from the Employee Transaction Create New menu will check if the employee's Current Org is set to the Org of the initiating user. \n* If the Org of the initiating user is BOC, then they should be allowed to create the transaction.\n* If the Org of the initiating user is not BOC or the Current Org of the employee, then display message #1.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216838,
    "title": "As a user I want to edit an existing Reinstate from Inactive List transaction for an employee",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153520239",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 11,
    "custom_preconds": null,
    "custom_steps": "See Data Discovery: \nhttps://wiki.mlbam.com/display/EBIS/Reinstate+from+Inactive+List\n\nAcceptance Criteria:\n* An Edit button will be available anytime the form is in view mode if the viewing user has edit permissions for the form in its current state. \n* Clicking  Edit will reload the form in edit mode, and a Save button will appear in place of the Edit button (no edit button displayed in edit mode). \n* In Preliminary or Rejected state, Club users will be able to edit all portions displayed on the form. \n* BOC is able to edit all fields in all states except for Approved and Reversed transactions. \n* In Approved and Reversed transactions, edit only gives Clubs access to attach new files, but they cannot edit any other part of transaction unless specifically stated in data discovery.\n* In Approved and Reversed transactions, edit only gives BOC access to attach new files or edit existing attachments. They can also update \"Comments\" and \"BOC Notes\" fields, but they cannot edit any other part of transaction unless specifically stated in data discovery.\n* A Save button will be available anytime the form is in edit mode. \n* Clicking Save will save the transaction and it's current values and reload the form in View mode.\n* Transaction status will be set to \"Preliminary\" if this is the first time the transaction is being saved. Otherwise the transaction status will not change.  \n* After a successful save the system will display a successful save blue notification. \n* Whenever the form is in edit mode, the user will see a \"Cancel\" button on the form in grey. \n* Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel the changes they have made. \n* If they confirm the cancellation and the form has not yet been saved in the system, then the form should be closed and no record should be kept. User should be returned to entry point of the transaction. \n* If they confirm the cancellation and the form has been previously saved in the system, then the form should be reloaded into view mode, with none of the edits that were made since the last save and up to the cancellation point reflected.\n* If they do not confirm the cancellation then the user will be returned to the form and no action will be taken.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216839,
    "title": "As a user I want to be able to view a Disqualified List transaction for an employee",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153993608",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 12,
    "custom_preconds": null,
    "custom_steps": "Wireframe:\nhttps://r6vcv1.axshare.com/#p=place_on_disqualified_list\n\nAcceptance Criteria: \n* If any Disqualified List transactions existed for employees in ebis1, we need to build the UI and ETL them to ebis2. \n* UI matches that of the player transaction. \n* We do not need to be able to enter new, edit, save these transactions.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 1216840,
    "title": "As a user I want to be able to view an Offseason Assignment for an employee",
    "section_id": 146374,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153653315",
    "created_by": 103,
    "created_on": 1516116826,
    "updated_by": 103,
    "updated_on": 1516116826,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 20165,
    "display_order": 13,
    "custom_preconds": null,
    "custom_steps": "Wireframe:\nhttps://b6mbog.axshare.com/#p=offseason_assignment\n\nAcceptance Criteria:\n* If any Offseason Assignment transactions existed for employees in ebis1, we need to build the UI and ETL them to ebis2. \n* UI has 1 additional field (Designate As), but otherwise matches that of the player transaction. \n* We do not need to be able to enter new, edit, save these transactions.",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]