[
  {
    "id": 17147471,
    "title": "As a user I want to see an error if I am entering a new grandfathered player profile that has the same national ID as another player",
    "section_id": 806077,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155140078",
    "created_by": 103,
    "created_on": 1621264372,
    "updated_by": 103,
    "updated_on": 1621264372,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": "GIVEN a club and BOC user is logged in with permissions for creating Grandfathered Profile\r\nAND user is entering a new grandfathered player profile that has the same national ID as another player",
    "custom_steps": "WHEN user clicking \"Next\" on the Create New ",
    "custom_expected": "THEN the system will run a duplicate profile check according to the provided rules (National ID Only for this story). \r\nAND If a National ID is entered, the system should check to see if any other International Amateur profile already exists with the same National ID and Country.  \r\nAND If another international amateur profile is found with the same National ID and National ID country, the user gets a hard error. See Messages #7\r\n-- \"You cannot create a profile for this player because one already exists.\" --\r\nAND If no match is found, the user is able to proceed with profile creation. \r\n\r\n*Because there are no visibility rules around grandfathered players - this works the same for all users*\r\n\r\nBusiness Rules:\r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/3787792/4+of+7+Check\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=possible_matches-_grandfathered\r\n\r\nMessages #7: \r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/3787668/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147441,
    "title": "As a user I want to create a new Registration Profile",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "153790594",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": "GIVEN a user is logged in with Admin permissions for Registration Profile\r\nAND user navigates to International tab",
    "custom_steps": "WHEN user click on \"New Player\" on International dashboard",
    "custom_expected": "THEN System will load Create New Player form.\r\nAND user will see the \"Register\" button is disabled until all of the required fields have been entered. \r\nAND The National ID fields are conditionally required based on the selection of \"Birth Country\", and this should be reflected via the red asterisks displayed on the UI. \r\nAND Entering the required fields on the Create New form, including a DOB on or after 9/1/1995 will take the user to a new registration profile, per the data discovery and wireframe. \r\nAND There are a lot of conditionally displayed fields on these profiles, so the data discovery should be paid special attention. \r\nAND The Registration Reviews and Means of Contact sections are not visible on create. \r\nAND Any action buttons and calculated fields (Eligible to Sign date/Meets Age Requirements) are handled in follow up stories.\r\n\r\nData Discovery: \r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/3787669/EBIS4-TXT-5831+Data+Discovery+2.5\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration\r\nhttps://tb5api.axshare.com/#p=master",
    "custom_steps_separated": null
  },
  {
    "id": 17147442,
    "title": "As a user I want to save a new Registration Profile",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154039143",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 2,
    "custom_preconds": "GIVEN a user is logged in with Admin permissions for Registration Profile\r\nAND User is in the create new player form",
    "custom_steps": "WHEN user click \"Save\" on the new Registration profile form",
    "custom_expected": "THEN The system runs a required field and formatting check per the provided data discovery, saves the profile and a blue successful save notification is thrown. \r\nAND Fields are conditionally required, especially upload labels, so the data discovery should be paid special attention. \r\nAND The Registration status should be set to \"Pending BOC Review\" on save.\r\nOR If the user Clicking \"Cancel\" will prompt the user to confirm that they wish to cancel. If they confirm, the user is returned to the point of entry and no profile is stored. If they do not confirm, they are returned to the profile in edit mode. \r\n\r\n\r\nData Discovery: \r\nhttps://baseball.atlassian.net/wiki/spaces/EBIS/pages/3787669/EBIS4-TXT-5831+Data+Discovery+2.5\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=master",
    "custom_steps_separated": null
  },
  {
    "id": 17147443,
    "title": "As a Club user I want to edit an existing Registration Profile",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155275285",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 3,
    "custom_preconds": "GIVEN club user is logged in with Edit Permissions for existing Registration Profile\r\nAND user is viewing a Registration Profile in View mode",
    "custom_steps": "WHEN user click \"Edit\" button",
    "custom_expected": "THEN system will reload the profile in edit mode per the data discovery.\r\nAND the majority of the profile fields are NOT editable for Club users if the player Elig to Sign date is not pass \r\nBUT the majority of the profile fields are editable for Club user if the Elig to sign date for player has passed expect these fields ( First Name, Last Name, and Extended Last Name)\r\nAND Previously attached files that have been saved are NOT editable for the Club users, though they can add additional attached files. \r\nAND The entire Contact Information section remains editable for the Club users. \r\nAND There will be a \"Save\" and a \"Cancel\" button available in edit mode. \r\nAND No Origin toggles appear for the Club user in edit mode UNLESS it appears in View mode (meaning there are already 2 versions of the same Org's contact info/attached files from a profile merge). \r\nAND Clicking \"Cancel\" will ask the user to confirm that they wish to lose any unsaved changes. If they confirm, the system will reload the profile in View mode, with no changes made. \r\nOR Clicking \"Save\" will run a required field and formatting check. Assuming the required field and format check passes, the system will reload the profile in View mode, with the changes stored and visible. \r\nAND The locked fields apply to anything other than players with a status of \"Unregistered\".\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 17147444,
    "title": "As a BOC user I want to edit an existing Registration Profile",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155275287",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 4,
    "custom_preconds": "GIVEN BOC user is logged in with Edit Permissions for existing Registration Profile\r\nAND user is viewing a Registration Profile in View mode",
    "custom_steps": "WHEN user click on \"Edit\" button",
    "custom_expected": "THEN the system will reload the profile in edit mode per the data discovery. All previously editable fields remain editable for the BOC. \r\nAND The Attached Files sections and Contact Information sections will load the selected Origin for editing.  \r\nAND Each individual Contact Info section will have its own Origin toggle in edit mode, as will the Attached Files section. \r\nAND Changing any of these will update the remainder (so all match at all times). \r\nAND Attempting to switch Origins will prompt the user that they are going to lose any changes already made. Confirming will load the new Origin in edit mode (along with the rest of the profile). Any edits made to the prior version of the Contact Information will not be maintained. \r\nAND There will be a \"Save\" and a \"Cancel\" button available in edit mode. \r\nAND Clicking \"Cancel\" will ask the user to confirm that they wish to lose any unsaved changes. If they confirm, the system will reload the profile in View mode, with no changes made. \r\nOR Clicking \"Save\" will run a required field and formatting check. Assuming the required field and format check passes, the system will reload the profile in View mode, with the changes stored and visible.\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 17147445,
    "title": "As a user I want to add a Registration Profile to my Club registration List via the Create New",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273657",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 5,
    "custom_preconds": "GIVEN club user is logged in with permission to Create Registration Profile and Add Registration Profile to their club\r\nAND user is creating a new Profile",
    "custom_steps": "WHEN user click \"Register\" on the Create New\r\n\r\n",
    "custom_expected": "THEN The System will run a duplicate check per prior stories. \r\nAND If a match is found that the Club has permission to see per #155273643 (no such restrictions exist for BOC users) and it is a registration profile that has not yet been added to the Club's Registration List, per #155273652, then selecting the existing Registration profile and clicking \"Add to Club Reg List\" will perform the following actions: \r\n  -  The Registration Profile should be added to the viewing Org's Club Registration List for the relevant Signing Period, based on the player's Eligible to Sign Date. \r\n  - The system should navigate the user to the existing Registration profile in edit mode. \r\n  - The Club user should have the ability to add their own Contact Information and Attached Files to the Registration Profile. They should not be able to view the Contact Info or Attached Files of other Clubs - nor should they be able to edit any other information on the profile.\r\n  - Regardless of what actions they take while on the Registration Profile itself - the player should appear on the Club's Registration List from that point forward, and therefore be visible to the Org in searches and widgets.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/Adding+a+Player+to+the+Club+Registration+List\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=possible_matches",
    "custom_steps_separated": null
  },
  {
    "id": 17147446,
    "title": "As a Club user I want to be able to check the registration status of a player after the Registration Period has ended",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155302515",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 103,
    "updated_on": 1621264256,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 6,
    "custom_preconds": "GIVEN Club user logged in with Admin permissions for Registration Profile\r\nAND Registration Period has ended",
    "custom_steps": "WHEN user try to Register a profile ",
    "custom_expected": "THEN There is a system date for each year that is the \"registration cut off date\".  It is composed of a date and time component.  (Registration Period end date/time on the system dates screen)\r\nAND Prior to the specified date and time, both BOC users and Club users can create Registration profiles for the upcoming Signing Period. \r\nAND After the specified date and time, Club users should no longer see a \"Register\" button on the Create New when they have entered the DOB for a player subject to register. The button should now read \"Check Registration\"\r\nAND The entry of grandfathered players is unaffected. \r\nAND Entering player information in the Create New and clicking \"Check Registration\" should run a standard matching check for the player based on the matching rules (all covered in prior stories). \r\nAND If no match is found, display Message #16.\r\nOR If a match is found, display Message #4. \r\nAND Club users should still be able to add players to their Club Registration List outside of the Registration period, but if a match is found to an Unregistered profile they do not see a \"Register MLSB\" button, nor should they see a \"Register\" button to continue with the registration process with their entered information.\r\n\r\n\r\nMessages:\r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147447,
    "title": "As a user I want to Register an Unregistered Profile from Create New",
    "section_id": 806078,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273667",
    "created_by": 103,
    "created_on": 1621264256,
    "updated_by": 309,
    "updated_on": 1701878986,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 7,
    "custom_preconds": "GIVEN a user is logged in with Admin permissions for Registration Profile\r\nAND user is viewing the create new widget",
    "custom_steps": "WHEN user click \"Register\" on the matching modal",
    "custom_expected": "THEN The system will Load the Unregistered profile in edit mode. The profile will look like a normal registration profile, just will also have the Scouting Info section visible and editable.\r\nAND The Club user will be able to edit all of the profile's fields. \r\nAND The Club user will have a \"Save\" and \"Cancel\" button just like they do when normally creating a Registration Profile.\r\nAND Clicking \"Save\" will run the same required field and formatting checks that would be run if they were otherwise entering a Registration Profile. \r\nAND Once the required field and formatting checks have passed, the profile's Registration Status will update to \"Pending BOC Review\". \r\nAND The Scouting Info will continue to display. \r\nAND If the user clicks \"Cancel\" or otherwise navigates away from the profile prior to completing the registration process, the profile's Registration Status is not updated, and no changes to the profile are stored.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/Adding+a+Player+to+the+Club+Registration+List\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+Player+Profile+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 17147459,
    "title": "As a BOC user I want to merging 2 profiles to maintain the first Level 1 Registration date",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922348",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep\r\n",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the player's Level 1 Registration date will be the earliest date that this player was registered, regardless of which player's information is selected as \"Master\". \r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147460,
    "title": "As a BOC user I want to merging 2 profiles to maintain originally registered by information",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922449",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 2,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the \"Originally Registered By' will be maintained based on the Org and user that registered the player first, regardless of which player's information is selected as \"Master\"\r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147461,
    "title": "As a BOC user I want to merging 2 profiles to maintain Scouting Information",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922346",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 3,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the Scouting Info subsection will be maintained as entered if it exists for only one of the two profiles, regardless of which player's information is selected as \"Master\"\r\nAND In the unique scenario that this information exists for both profiles selected for merge, then use the information for the player that is specified as the \"Master\" for the Bio Information\r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 17147462,
    "title": "As a BOC user I want to merging 2 profiles to maintain MLB Program Participation Information",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922595",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 4,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the MLB Program Participation subsection will be maintained as entered if it exists for only one of the two profiles, regardless of which player's information is selected as \"Master\"\r\nAND In the unique scenario that this information exists for both profiles selected for merge, then use the information for the player that is specified as the \"Master\" for the Bio Information\r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147463,
    "title": "As a BOC user I want to merging 2 profiles to maintain any \"tags\"",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922593",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the profile should display as having been \"registered by\" any Org that registered or added to their Club Reg List either of the two profiles that were merged. \r\n  * Example: Player 1 was Registered by BOC, and added to Club Reg List by ARI, BOS and Player 2 was Registered by BOC and added to Club Reg List by MLSB, CIN - after the merge the \"new\" profile will display as having additional registrations by ARI, BOS, MLSB and CIN - and all of those Orgs will continue to see the player on their Club Reg Lists.\r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147464,
    "title": "As a BOC user I want to merging 2 profiles to maintain the oldest Player ID",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922349",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 6,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, the primary player ID for the newly merged player will be the oldest player ID, regardless of which profile was selected as the Master. \r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147465,
    "title": "As a Scouting Admin I want to view the Scouting Admin Clipboard",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155455088",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 7,
    "custom_preconds": "GIVEN a Scouting Admin is logged in with permissions to view Scouting Admin Clipboard ",
    "custom_steps": "WHEN user click on \"Scouting\" option on the Left navigation under International tab ",
    "custom_expected": "THEN There should be a \"Scouting\" Left Navigation option for users that have permission to see the Admin Clipboard. \r\nAND Opening the Scouting Dashboard should display the Admin Clipboard for those that have permission to view it. \r\nAND The Admin Clipboard should follow the provided wireframe and data discovery. \r\nAND The population of this clipboard is covered in follow up stories.\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_admin_clipboard\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Admin+Clipboard+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 17147466,
    "title": "As a Scout I want to view my Clipboard",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155455086",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 8,
    "custom_preconds": "GIVEN a Scouting user is logged",
    "custom_steps": "WHEN user click on \"Scouting\" option on the Left navigation under International tab",
    "custom_expected": "THEN There should be a \"Scouting\" Left Navigation option for users that have permission to see the Scout Clipboard. \r\nAND Opening the Scouting Dashboard should display the Scout Clipboard. \r\nAND The Scout Clipboard should follow the provided wireframe and data discovery. \r\nAND Ultimately each scout will have their own Clipboard, based on username, but that is covered in a follow up story. #156057672\r\n\r\nWireframe:\r\nhttps://s8xnnx.axshare.com/#p=scout_clipboard\r\n\r\nData Discovery: \r\nhttps://wiki.mlbam.com/display/EBIS/Scout+Clipboard+-+Data+Discovery",
    "custom_steps_separated": null
  },
  {
    "id": 17147467,
    "title": "As a BOC user I want to select 2 International Profiles for merge",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155819174",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 9,
    "custom_preconds": "GIVEN BOC user is logged in with Mergers Permission for International player\r\nAND user navigates to \"Registration Admin widget\"\r\n",
    "custom_steps": "WHEN user selected two profiles in the Reg Admin ",
    "custom_expected": "THEN Users with International player mergers permission see a \"Merge\" button on the Registration Admin widget.\r\nAND When exactly two profiles are selected in the Reg Admin, the \"Merge\" button is enabled. \r\nAND Selecting two profiles and clicking \"Merge\" will prompt the user to confirm the merge, and to select the \"Master\" information that they wish to keep. See Messages #20\r\nAND See wireframe for layout of/information contained in message. \r\nAND If one of the profiles selected is an Unregistered profile, then the message will NOT have the option to select Master Information that is not entered in the MLSB profile (like attached files). \r\nOR If one of the profiles has more than one set of Origin information - use the following hierarchy to determine which Contact Info/Files to show:\r\n 1- Master\r\n 2- BOC\r\n 3 - First Registering Org\r\n 4 - MLSB (should only be used if it is the only available Origin)\r\n\r\n*The actual merge is covered in another story*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147468,
    "title": "As a BOC user I want to merging 2 profiles to maintain Level 2 Registration information",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155922347",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 10,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN Once the profiles have been merged, any Level 2 Registration information will be maintained regardless of which player's information is selected as \"Master\".\r\n  * Example - if either of the profiles were selected for Level 2 Registration or Elevated, the merged profile will maintain this - regardless of which was selected as the Master.\r\nAND In the unique scenario that this information exists for both profiles selected for merge, then use the earliest entered information for the Level 2 Registered Date. For the Selected By fields use all Organizations from both profiles selected for merge. \r\n\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*\r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration",
    "custom_steps_separated": null
  },
  {
    "id": 17147469,
    "title": "As a BOC user I want to merge 2 Profiles",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155819222",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 11,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "WHEN user click \"Merge\"",
    "custom_expected": "THEN If they choose to click \"Cancel\" then the modal closes and no merge is taken. The user is returned to the Registration Admin with no changes saved. A\r\nAND If they click \"Merge\" then the system will merge the two selected profiles. \r\nAND The Bio Information selected as the \"Master\" will now be the record for ANY user that loads that profile in the system. \r\nAND The system will need to maintain a record of the merge, and maintain BOTH player IDs. \r\nAND The attached files selected as \"Master\" will display under the MASTER origin for BOC users. \r\nAND The contact information selected as \"Master\" will display under the MASTER origin for BOC users. \r\nAND Any Origins that were available on BOTH profiles are also available to the BOC under the \"Origin\" dropdown.  (Ex: If Player 1 had Origins of BOC and MLSB, and Player 2 had Origins of BOC and BOS, the profile after the merge will have Master, BOC - 1, BOC- 2, MLSB and BOS)\r\nAND The player will only appear once in the Reg Admin widget, Club Reg List and any searches using the new \"Master\" Bio information.\r\nAND Clubs continue to see ONLY their own Contact information and Attached Files. \r\n\r\nWireframe:\r\nhttps://tb5api.axshare.com/#p=registration_admin\r\nhttps://tb5api.axshare.com/#p=player_merge\r\n\r\nRules: \r\nhttps://wiki.mlbam.com/display/EBIS/Merging+Players+subject+to+Registration\r\n\r\n*Additional merge rules covered in followup stories*\r\n*NOTE TO QA: players can be merged multiple times - all of these merge stories will need to be tested accordingly.*",
    "custom_steps_separated": null
  },
  {
    "id": 17147470,
    "title": "As a BOC user I want merging two international player profiles to bring over any relevant Investigation info",
    "section_id": 806079,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155998812",
    "created_by": 103,
    "created_on": 1621264326,
    "updated_by": 103,
    "updated_on": 1621264326,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 12,
    "custom_preconds": "GIVEN a BOC user is logged in with Intl Ama Reg Admin permissions\r\nAND user navigated to Reg Admin widget \r\nAND user has selected two player from the Red Admin widget using the check box\r\nAND user has selected which Master records to keep",
    "custom_steps": "When user click \"Merge\"",
    "custom_expected": "THEN the system should check to see if either of the players has an Investigation or Investigation Request associated with them. \r\nAND Regardless of which profile is selected as the \"Master\", all available Investigations and Investigation Requests need to be maintained and available via the newly merged profile. \r\nAND All relevant updates to player information and/or Player ID should also be sent to LARI per #139253907.",
    "custom_steps_separated": null
  },
  {
    "id": 17147448,
    "title": "As a Club user I want to see an Are you Sure message if I attempt to override a match message",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156231827",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": "https://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nGIVEN a user is attempting to register a new international registration profile\r\nAND the user has entered data in the create new fields that triggers a 4 of 7 match\r\nAND user has clicked \"Register\"\r\nAND matching modal has a \"Register\" button available\r\nAND matching modal has a \"Register MLSB entered\" or \"Add to Club Reg List\" options (where applicable)",
    "custom_steps": "WHEN Club user clicks \"Register\" on the matching message",
    "custom_expected": "THEN the system should ask if the user is sure that they wish to create the profile anyway\r\nAND Messages #30: \"Matches were found to this player. Please make sure that you have reviewed the matches and the profile does not yet exist in the system prior to continuing.\" \r\nAND if user clicks \"Ignore and Continue\" system should continue with registering the profile\r\nBUT if user clicks \"Back\" system should cancel the registration and take user back to entry point",
    "custom_steps_separated": null
  },
  {
    "id": 17147449,
    "title": "As a user I want matching messages to default to NOT creating a new profile unless that is the only way forward",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156293870",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 2,
    "custom_preconds": "GIVEN Club and BOC user logs in with International Amateur registration permission\r\nAND user tries to register a player with the information that match the existing international player profile on the system",
    "custom_steps": "WHEN user user clicks on 'Register' on the Create New",
    "custom_expected": "THEN user is presented with a matching message from the Create New widget, the system should default the selection on the matching message to that which already exists in the system, unless there are no other actions that can be taken. \r\n - Example: If a user is attempting to register a player and the system finds a match to another player not yet on their Club Reg List, the matching message displayed should have the first \"System matches\" match found selected, and the \"Add to Club Reg List\" button activated by default. \r\nAND The user should have the ability to select the new information and proceed with Registration anyway, assuming that they otherwise would have been able to (no rules/system dates stopping them).",
    "custom_steps_separated": null
  },
  {
    "id": 17147450,
    "title": "As a scouting user I want to see a warning if I am attempting to enter a new unregistered player profile that matches another profile",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "156329416",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 3,
    "custom_preconds": "GIVEN Scouting user logs in with permission to create unregistered player profile\r\n\r\n\r\n",
    "custom_steps": "WHEN user tries to create unregistered player profile that matches another profile\r\n\r\n",
    "custom_expected": "THEN Clicking \"Next\" on the Create New when creating a new Unregistered player profile will run a duplicate check according to the provided rules. \r\nAND If a match is found to another international player profile that the user has permission to see as a match, then the user gets an error. See Messages #7. \r\nAND The same visibility rules should also apply to the \"Add Player\" check on Daily Reports.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147451,
    "title": "As a Club user I want to see a warning if I am attempting to enter a new player profile that matches another profile (updated)",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954307",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 4,
    "custom_preconds": "GIVEN a Club user logs in with permission to creating a new International Amateur profile \r\n\r\n",
    "custom_steps": "WHEN user Clicks \"Next\" on the Create New when creating a new International Amateur profile\r\n\r\n",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND If a match is found to another international player profile that the user has permission to see as a match, then the user gets a warning. See Messages #4 or #5.\r\nAND MLSB Group 1 or Group 2 profiles are no longer automatically public. \r\nAND International Suspects should NOT appear as matches to Club users.\r\nAND Unregistered International Prospects should ONLY appear as a match to Club users if they have a record status of Approved.\r\nAND The remainder of the visibility restrictions should continue to work.\r\nAND Register MLSB Entered and Add to Club Reg list functionality should continue to work as previously laid out.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147452,
    "title": "As a BOC user I want to see a warning if I am attempting to enter a new player profile that matches another profile (updated)",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "157954312",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 5,
    "custom_preconds": "GIVEN a BOC user logs in with permission to create new International Amateur profile ",
    "custom_steps": "WHEN user clicks \"Next\" on the Create New when creating a new International Amateur profile",
    "custom_expected": "THEN the system will run a duplicate check according to the provided rules (NOT via the Scouting dashboard). \r\nAND If a match is found to another international player profile, including to an International Suspect profile, then the user gets a warning. See Messages #4 or #5.\r\nAND International Suspects SHOULD appear as matches to BOC users. They should have the option to Register MLSB entered for these profiles, just like any other Unregistered profile. \r\nAND Unregistered International Prospects should ONLY appear as a match to BOC users if they have a record status of Approved UNLESS the BOC user also has the ability to create unregistered profiles. If they have that permission, then they also see matches to Submitted profiles.\r\nAND Register MLSB Entered and Add to Club Reg list functionality should continue to work as previously laid out.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147453,
    "title": "As a user I want to see a warning if I am entering a new registration player profile that matches an Unregistered profile",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "154576980",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 6,
    "custom_preconds": "GIVEN Club and BOC user logs in with International Amateur registration permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user user clicks on 'Register' on the Create New\r\n\r\n",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND If a match is found to an international player profile that has a Registration Status of \"Unregistered\", then the user gets a warning. See Messages #5.\r\nAND This check is also run on \"Save\" when the profile is being created for the first time.\r\nAND This check is conditionally run on \"Save\" for subsequent saves. That workflow is covered in #155273711.\r\nAND The \"Register\" button should only be enabled if the information that the Club is currently entering is selected in the modal. \r\nAND Clicking \"Register\" will proceed with profile creation. \r\nAND The \"Register MLSB Entered\" button should only be enabled if the information that matches the MLSB Unregistered Profile is selected in the modal. \r\nAND Clicking \"Register MLSB Entered\" should navigate the user to the Unregistered MLSB entered profile. (Actual registration covered in a separate story). \r\nAND The \"Cancel\" button should always be enabled, regardless of which profile is selected. \r\nAND Clicking \"Cancel\" should close the modal and return the user to the Create New form. No information should be cleared from the form, and the user should be able to make any desired edits and try again. \r\n\r\n*Note for QA - in the past we've seen behavior where if the user clicks \"Cancel\" goes back and makes edits (or doesn't) and clicks \"Register\" again the matching logic isn't kicked off again so make sure to test for this case*\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=possible_matches_-_mlsb_unregistered",
    "custom_steps_separated": null
  },
  {
    "id": 17147454,
    "title": "As a user I want to see a warning if I am entering a new registration player profile that matches a profile I have already entered or added to my Club registration List",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273631",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 7,
    "custom_preconds": "GIVEN Club and BOC user logs in with International Amateur registration permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user user clicks on 'Register' on the Create New",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND If a match is found to an international player profile that has a Registration Status of \"Unregistered\", then the user gets a warning. See Messages #4.\r\nAND This check is also run on \"Save\" when the profile is being created for the first time.\r\nAND This check is conditionally run on \"Save\" for subsequent saves. That workflow is covered in #155273711.\r\nAND The \"Register\" button should only be enabled if the information that the Club is currently entering is selected in the modal. This is the default selection. \r\nAND Clicking \"Register\" will proceed with profile creation. \r\nAND Any matches to the entered information that belong to a profile that the Club registered or are already on the Club's Registration List are displayed as matches, but the radio buttons are greyed out or simply not displayed.  \r\nAND The \"Cancel\" button should always be enabled, regardless of which profile is selected. \r\nAND Clicking \"Cancel\" should close the modal and return the user to the Create New form. No information should be cleared from the form, and the user should be able to make any desired edits and try again. \r\n\r\n*Note for QA - in the past we've seen behavior where if the user clicks \"Cancel\" goes back and makes edits (or doesn't) and clicks \"Register\" again the matching logic isn't kicked off again so make sure to test for this case*\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=possible_matches_-_mlsb_unregistered\r\n\r\n",
    "custom_steps_separated": null
  },
  {
    "id": 17147455,
    "title": "As a user I want to see a warning if I am entering a new registration player profile that matches a registration profile I have not yet added to my Club registration List",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273652",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 8,
    "custom_preconds": "GIVEN Club and BOC user logs in with International Amateur registration permission\r\n\r\n\r\n",
    "custom_steps": "WHEN user user clicks on 'Register' on the Create New\r\n\r\n",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND If a match is found to an international player profile that has a Registration profile that the user has not already Registered or added to their Club Reg List then the user gets a warning. See Messages #4.\r\nAND This check is also run on \"Save\" when the profile is being created for the first time.\r\nAND This check is conditionally run on \"Save\" for subsequent saves. That workflow is covered in #155273711.\r\nAND The \"Register\" button should only be enabled if the information that the Club is currently entering is selected in the modal. \r\nAND Clicking \"Register\" will proceed with profile creation. \r\nAND The \"Add to Club Reg List\" button should only be enabled if the information that matches the existing Registration Profile is selected in the modal. \r\nAND Clicking \"Add to Club Reg List\" should navigate the user to the existing Registration profile. (Actual addition to the Club Reg List is covered in a separate story). \r\nAND The \"Cancel\" button should always be enabled, regardless of which profile is selected. \r\nAND Clicking \"Cancel\" should close the modal and return the user to the Create New form. No information should be cleared from the form, and the user should be able to make any desired edits and try again. \r\n\r\n*Note for QA - in the past we've seen behavior where if the user clicks \"Cancel\" goes back and makes edits (or doesn't) and clicks \"Register\" again the matching logic isn't kicked off again so make sure to test for this case*\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=possible_matches_-_mlsb_unregistered",
    "custom_steps_separated": null
  },
  {
    "id": 17147456,
    "title": "As a Club user I do NOT want to see a warning if I am entering a new registration player profile that matches a profile I do not have permission to see",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273643",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 9,
    "custom_preconds": "GIVEN Club user logs in with International Amateur registration permission\r\n\r\n",
    "custom_steps": "WHEN club user clicks on 'Register' on the Create New\r\n",
    "custom_expected": "THEN system will run a duplicate check according to the provided rules. \r\nAND Club users will only see a match per stories if they have permission to view the matching profile as a match. \r\nAND Club users are able to see a profile as a match under the following conditions: \r\n  - The player has been selected for L2 Registration by the BOC.\r\n  - The player has been entered by the viewing Org.\r\n  - The player has been added to the viewing Org's Club Reg List. \r\n  - The player has passed their Eligible to Sign Date. \r\n  - The player has been identified as a Group 1 or Group 2 player from their MLSB Reports. (flag on profile)\r\n  - The player has been explicitly been made public by the BOC by a flag on their profile. \r\nBUT If none of the above conditions have been met - then the player may appear as a match only under the following conditions: \r\n        - The player has been registered and their First Review has been set to \"Verified\" or \"Pre-Verified\". \r\n        - The player is Unregistered and does not have a Scouting Status of \"International Suspect\".\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nVisibility Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/International+Amateur+-+Profile+Visibility",
    "custom_steps_separated": null
  },
  {
    "id": 17147457,
    "title": "As a BOC user I want to see a warning if I am entering a new registration player profile that matches another profile",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155275190",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 10,
    "custom_preconds": "GIVEN BOC user is logged in with Create permissions for Registration Profile \r\nAND user navigates to International tab \r\nAND user is entering info that matches existing profile in the create new Registration Profile form\r\n",
    "custom_steps": "WHEN user click on \"Register\" on the Create New will run a duplicate check according to the provided rules",
    "custom_expected": "THEN If a match is found to another international player profile, then the user gets a warning. See Messages #4 or 5. This should work the same as for Club users, except there are no visibility restrictions for the BOC, so they will see matches to any matching profile in the system. \r\nAND The \"Register\" button should only be enabled if the information that the Club is currently entering is selected in the modal. This is the default selection. \r\nAND Clicking \"Register\" will proceed with profile creation. \r\nAND Any matches to the entered information that belong to a profile that the Club registered or are already on the Club's Registration List are displayed as matches, but the radio buttons are greyed out or simply not displayed. \r\nAND If any of the profile matches are Unregistered, there should be a \"Register MLSB Entered\" button available on the modal. If that profile is selected, the button should be enabled. Clicking the button should navigate the user to the Unregistered profile. \r\nAND If any of the profile matches are Registered, but not yet on the BOC's Club Registration list, there should be an \"Add to Club Reg List\" button available on the modal. If that profile is selected, the button should be enabled. \r\nAND Clicking the button should navigate the user to the relevant profile. \r\nAND The \"Cancel\" button should always be enabled, regardless of which profile is selected. \r\nAND Clicking \"Cancel\" should close the modal and return the user to the Create New form. No information should be cleared from the form, and the user should be able to make any desired edits and try again.\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur",
    "custom_steps_separated": null
  },
  {
    "id": 17147458,
    "title": "As a user I only want to see matching warnings on \"Save\" of a profile if I have updated a matching related field",
    "section_id": 806080,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "155273711",
    "created_by": 103,
    "created_on": 1621264283,
    "updated_by": 103,
    "updated_on": 1621264283,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 11,
    "custom_preconds": "GIVEN a user is logged in with Admin permissions for Registration Profile\r\nAND user navigates to International tab\r\nAND user is editing registered player profile",
    "custom_steps": "WHEN user clicking \"Save\" on an International Player Profile",
    "custom_expected": "THEN the system will check to see if any of the matching related fields have been updated on the profile (First, Last, DOB, Twin Count, National ID, Birth City). This is done on initial save as well as subsequent saves.\r\nAND If yes, then the system will run a duplicate check according to the provided rules. \r\nAND If a match is found, the user gets a warning. See Messages #5.\r\nOR If none of the matching related fields has been updated since the profile was loaded, the system does not perform a match check.\r\n\r\n\r\nBusiness Rules: \r\nhttps://wiki.mlbam.com/display/EBIS/4+of+7+Check\r\n\r\nMessages: \r\nhttps://wiki.mlbam.com/display/EBIS/Messages+-+International+Amateur\r\n\r\nWireframe: \r\nhttps://tb5api.axshare.com/#p=possible_matches_-_mlsb_unregistered",
    "custom_steps_separated": null
  },
  {
    "id": 22408580,
    "title": "INC0166382 - As an Intl User, I want to see the International tab for a player who was drafted and signed as a domestic amateur",
    "section_id": 1138796,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-823",
    "created_by": 207,
    "created_on": 1629828790,
    "updated_by": 308,
    "updated_on": 1644956255,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "Description: Some \"domestic\" players require Visa information.  These fields are located on the International tab, which is only displayed for international players.\r\n\r\nAC:\r\n\r\n* There will be a flag created in the db that will control if the international tab on a professional players profile\r\n* If a \"domestic\" player has this flag set, the intl tab will be displayed and function as if the player were an intl player\r\n* Test to see how link handles this.  If this doesn't work, a LINK story will need to be opened.\r\n\r\n\r\n\r\nReceived from: JJ.Estevez@nationals.com\r\nRecipients: EBISSupport@mlb.com,ryan.thomas@nationals.com,patrick.nathanson@mlb.com\r\n\r\nHello,\r\n\r\nHope you are all well. Please see below. I am trying to update the Immigration information on two of our players' profiles on Ebis but they don't have an International Tab like all the international players do. The players are Paolo Espino and Francinel Martina. I think the reason is because they were both drafted here in the US and did not sign as International amateur players. However, since we have to add immigration information on their profiles, is there a way to add that tab for them?",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22408581,
    "title": "As a User, I want to merge multiple Intl Amateur profiles at the same time",
    "section_id": 1138797,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-843",
    "created_by": 207,
    "created_on": 1629828832,
    "updated_by": 207,
    "updated_on": 1629828832,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "- when you're merging a verified player with unregistered profiles, the verified one just wins and there's no decisions about master info\r\n - call it a multi merge and its a two step process?  You click on a specific player to start a multi merge and then check off everyone else you want to just get rolled into them?",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 22408582,
    "title": "Fix Logic Update Intl Verification Email",
    "section_id": 1138797,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "PIVOTAL-552",
    "created_by": 207,
    "created_on": 1629828832,
    "updated_by": 207,
    "updated_on": 1629828832,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 244410,
    "display_order": 2,
    "custom_preconds": null,
    "custom_steps": "There is an email that is sent to intl amateur players upon verification.  The dates/period logic in the email is hard coded, so emails going out after the system dates were changed are now incorrect.\n\nAC:\n\n* Update the email template to remove the placeholder and set it to 2020-21 for the year\n* Set the Eligible to Sign Date to 1/15/2021\n* The email that gets sent out will now reflect accurate signing periods and ETSDs\n\nConfirm this is still necessary before doing anything.",
    "custom_expected": null,
    "custom_steps_separated": null
  }
]