[
  {
    "id": 682165,
    "title": "As a user I want to be prevented from approving a 2nd recert for a date",
    "section_id": 82602,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "135047423",
    "created_by": 75,
    "created_on": 1480695318,
    "updated_by": 75,
    "updated_on": 1480695318,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 1,
    "custom_preconds": null,
    "custom_steps": "Messages: \nhttps://u8r.jamacloud.com/perspective.req?projectId=14044&docId=2309676\n\nAcceptance Criteria: \n* Clicking \"Submit\" on a DL Recertification transaction will check that no approved Recert transaction exists for the player for the Recertification date on the transaction.\n* If one already exists, blocking message #88 will display.",
    "custom_expected": null,
    "custom_steps_separated": null
  },
  {
    "id": 649316,
    "title": "As a user I want to be able to print a blank 7-Day Concussion Diagnostic Form",
    "section_id": 83132,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132212269",
    "created_by": 75,
    "created_on": 1479140409,
    "updated_by": 75,
    "updated_on": 1480959684,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 1,
    "custom_preconds": "GIVEN \"7-Day Concussion Diagnostic Form\" appears as an option in the Reporting widget under the Type \"Blank Letters\".",
    "custom_steps": "WHEN Selecting this option will print the proper pdf of the letter.",
    "custom_expected": "THEN The pdf will follow the provided format and details.\r\nAND This story should also cover the replacement of the old form with the new one (See Contour).",
    "custom_steps_separated": null
  },
  {
    "id": 649325,
    "title": "As a user I want to be able to print a Consent to Continue Rehab at ST Facility Beyond 20 Days letter for a player",
    "section_id": 83132,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "128656067",
    "created_by": 75,
    "created_on": 1479140409,
    "updated_by": 75,
    "updated_on": 1480959684,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 2,
    "custom_preconds": "GIVEN \"Consent to Continue Rehab at ST Facility Beyond 20 Days\" appears as an option in the Create New menu for players under \"Player Letters\".",
    "custom_steps": "WHEN Selecting this option will print the proper pdf of the letter using the proper information from the player's profile.",
    "custom_expected": "THEN Users will have the ability to alter the Date used for the form. (Should be pre-populated with current date)\r\nAND Users will have the ability to alter the player's name as it will appear on the form. (Should be pre-populated with player's First Last)\r\nAND Users will have the ability to enter the Injury to be populated on the form. \r\nAND Users will have the ability to enter the Effective Date to be populated on the form. \r\nAND The form will be generated in English if the language on the player's profile is set to anything other than Spanish. \r\nAND The form will be generated in Spanish if the language on the player's profile is set to Spanish. \r\nAND The pdf will follow the provided format and details.",
    "custom_steps_separated": null
  },
  {
    "id": 649314,
    "title": "As a user I want a Return from Rehab to be created when a Waiver Claim Assignment is approved",
    "section_id": 83133,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132788285",
    "created_by": 75,
    "created_on": 1479140409,
    "updated_by": 75,
    "updated_on": 1480959684,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 1,
    "custom_preconds": "GIVEN a Waiver Claim Assignment is approved, if the player has a MJ or MN Roster status of \"Rehab\"",
    "custom_steps": "WHEN the system will automatically create a \"Return from Rehab\" transaction for the player. ",
    "custom_expected": "THEN If the player is on the MJ League DL, then a MJ League Return from Rehab should be created.\r\nIF the player is on the MN League DL, then a MN League Return from Rehab should be created. \r\nAND The Return date will = the waiver claim assignment date. \r\nAND The Return from Rehab will automatically be submitted and approved for the player. Any rules violations will be overridden. \r\nAND Once the Return from Rehab has been approved, the system will create a Reinstate from DL for the player as laid out in #132788303. \r\nAND This should only happen once the Waiver Claim Assignment rules have all passed.",
    "custom_steps_separated": null
  },
  {
    "id": 649315,
    "title": "As a user I want a Reinstate from DL to be created when a Waiver Claim Assignment is approved",
    "section_id": 83133,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "132788303",
    "created_by": 75,
    "created_on": 1479140409,
    "updated_by": 75,
    "updated_on": 1480959684,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 2,
    "custom_preconds": "GIVEN  a Waiver Claim Assignment is approved, if the Request Date falls in the MJ League Season and the player has a MJ or MN Roster status of \"DL\"",
    "custom_steps": "WHEN the system will automatically create a \"Reinstate from DL\" transaction for the player. ",
    "custom_expected": "THEN If the player is on the MJ League DL, then a MJ League Reinstate from DL should be created.\r\nIF the player is on the MN League DL, then a MN League Reinstate from DL should be created. \r\nAND The Reinstatement date will = the waiver claim assignment date. \r\nAND The Reinstate from DL will automatically be submitted and approved for the player. \r\nAND This should only happen once the Waiver Claim Assignment rules have all passed.",
    "custom_steps_separated": null
  },
  {
    "id": 649328,
    "title": "UAT Feedback - CDF checkbox changes",
    "section_id": 83134,
    "template_id": 1,
    "type_id": 4,
    "priority_id": 6,
    "milestone_id": null,
    "refs": "133149473",
    "created_by": 75,
    "created_on": 1479140409,
    "updated_by": 75,
    "updated_on": 1480959712,
    "estimate": null,
    "estimate_forecast": null,
    "suite_id": 13533,
    "display_order": 1,
    "custom_preconds": "GIVEN user is creating a DL placement tx for a concussion ",
    "custom_steps": "WHEN:\r\n* The \"Received CDF\" checkbox present on MJ Concussion Placements should now be \"CDF Submitted\". \r\n\r\n",
    "custom_expected": "THEN:\r\n* Club users should NOT be able to check the CDF Submitted checkbox unless a file is attached with the label \"Concussion Diagnostic Form\" selected. (OK to be accomplished with either an error message or a front-end rule) \r\n* BOC users should continue to be able to check the CDF Submitted checkbox without a file attached in all states. \r\n",
    "custom_steps_separated": null
  }
]